{
	"version": "https://jsonfeed.org/version/1",
	"title": "fatmixx",
	"icon": "https://micro.blog/sujal/avatar.jpg",
	"home_page_url": "https://sujal.micro.blog/",
	"feed_url": "https://sujal.micro.blog/feed.json",
	"items": [
		
			{
				"id": "http://sujal.micro.blog/2024/10/27/new-hosting-for.html",
				"title": "New hosting for Fatmixx",
				"content_html": "<p>Fatmixx has moved from <a href=\"https://pair.com\">Pair.com</a> to <a href=\"https://micro.blog\">micro.blog</a> for hosting. This also means we&rsquo;re no longer using Wordpress and are now hosted on <a href=\"https://gohugo.io\">Hugo</a>. Old URLs should redirect to the new ones, images should be working if they worked on the old host. If you see anything weird, let me know.</p>\n<p>If you want more technical details on why the change, I wrote more about this on <a href=\"https://www.usefulclever.com\">UsefulClever</a>.</p>\n<p>BTW - this had nothing to do with <a href=\"https://www.theverge.com/2024/9/27/24256361/wordpress-wp-engine-drama-explained-matt-mullenweg\">the recent Wordpress controversy</a>, I&rsquo;ve wanted to do this just for efficiency &amp; security &amp; cost for months. The controversy did bring it top of mind though.</p>\n",
				"content_text": "Fatmixx has moved from [Pair.com](https://pair.com) to [micro.blog](https://micro.blog) for hosting. This also means we're no longer using Wordpress and are now hosted on [Hugo](https://gohugo.io). Old URLs should redirect to the new ones, images should be working if they worked on the old host. If you see anything weird, let me know.\r\n\r\nIf you want more technical details on why the change, I wrote more about this on [UsefulClever](https://www.usefulclever.com).\r\n\r\nBTW - this had nothing to do with [the recent Wordpress controversy](https://www.theverge.com/2024/9/27/24256361/wordpress-wp-engine-drama-explained-matt-mullenweg), I've wanted to do this just for efficiency & security & cost for months. The controversy did bring it top of mind though.\n",
				"date_published": "2024-10-27T13:12:45-04:00",
				"url": "https://sujal.micro.blog/2024/10/27/new-hosting-for.html"
			},
			{
				"id": "http://sujal.micro.blog/2022/03/04/monday-links-moving.html",
				"title": "Monday links moving to another site",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<!-- wp:paragraph -->\n<p>Hi folks - hope you're having a good Friday! I've decided to consolidate the tech things I'm doing onto my other site, <a href=\"https://www.usefulclever.com\">Useful &amp; Clever</a>, which is where I was putting some of the fun projects I'm working on. There's a little more to this move that I'll share later, but if you're a long time reader of this site, add Useful &amp; Clever to your RSS reader or wherever you get the blog. Ping <a href=\"https://twitter.com/sujal\">me on Twitter</a> if you have any questions or concerns.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>You'll notice that I'll be migrating the existing Monday Links posts to U&amp;C over the day.</p>\n<!-- /wp:paragraph -->\n",
				"date_published": "2022-03-04T14:43:33-04:00",
				"url": "https://sujal.micro.blog/2022/03/04/monday-links-moving.html",
				"tags": ["In the News"]
			},
			{
				"id": "http://sujal.micro.blog/2018/08/01/time-should-fade.html",
				"title": "Time Should Fade (Almost) Everything...",
				"content_html": "<p><!-- raw HTML omitted -->Update:<!-- raw HTML omitted --> There aren&rsquo;t APIs for most of the services that I&rsquo;d want to use here, so I&rsquo;m putting this project on pause for now. I&rsquo;ll probably hack something together for my own use, but trying to turn this into a service doesn&rsquo;t seem possible given API usage guidelines from these services.</p>\n<!-- raw HTML omitted -->\n<p>I posted the following to Twitter the other day:</p>\n<!-- raw HTML omitted -->\n<p>I used to believe that everything posted on the Internet should stay, forever. I’m not so sure that is true. Published for public consumption, forever? Beginning to doubt that for most normal humans…</p>\n<p>In the near future (weeks hopefully), I’m going to start automatically hiding old photos, blog posts, everything except those that seem really worthwhile to keep up indefinitely. I’m working on the rules still, curious what people think are good rules.</p>\n<p>I’m almost certain that corporate social media policies, especially for public facing employees, should strongly recommend services that do the same - either delete or tighten up permissions after a window of time on public posts (And anything on FB)…<!-- raw HTML omitted -->\nSo, in short - you&rsquo;re only going to see ~7 days of old tweets on my Twitter account. This post is about how I&rsquo;m setting that up.</p>\n<!-- raw HTML omitted -->\n<p>I found a small script someone wrote on Github, forked it, and then modified it quite significantly. The script and instructions are <!-- raw HTML omitted -->on my Github account<!-- raw HTML omitted -->. You’ll need to be comfortable at the command line if you want to use it. It’s rough, and I offer no guarantees that it will run smoothly for you. Also, keep in mind - it will delete <!-- raw HTML omitted -->all<!-- raw HTML omitted --> of your tweets, and <!-- raw HTML omitted -->there is no undo<!-- raw HTML omitted -->. Keep your backup archive safe, and make sure this is what you want: delete <!-- raw HTML omitted -->everything<!-- raw HTML omitted -->.</p>\n<p>To get around the 3200 tweet API issue mentioned above, the script uses the <!-- raw HTML omitted -->tweets.js<!-- raw HTML omitted --> file that comes in the data backup from Twitter, so the good thing is that you’re basically forced to download the backup to use the utility. That file contains the IDs for all of your tweets (among other things), which is all we need to issue the delete command for that tweet.</p>\n<!-- raw HTML omitted -->\n<p>The bot runs every few hours, looks for tweets in my account older than the interval I’ve configured, currently set at 7 days, and deletes them if it finds anything. It’s all pretty simple.</p>\n<!-- raw HTML omitted -->\n<p>I mentioned this to a few folks, and got a few enthusiastic “I want that for my account!” comments. So, I’m going to spin this up as a side project and see what I can cobble together. If you take a look at the code I linked to above, it’s very simplistic - fine for a single account, but not the best for a real service.</p>\n<p>The other aspect of this I’m working on is governance. I don’t want to do this as a business - that’s not a goal. What I do want is a service that has a strong privacy stance, that offers high trust to folks that use it. One of the reasons I didn’t use the public services that are out there is that their business model is unclear.[footnote]I do think the popular ones, like <!-- raw HTML omitted -->TweetDelete<!-- raw HTML omitted -->, seem like fine options. That one, for example, is owned by a hosting company that doesn’t seem to need the revenue from a tweet deletion service.[/footnote]</p>\n<p>I am hoping to use this as an experiment in a cooperative form of governance for an online service, one where any charges are transparently used to maintain the service, where the source code is available for people to review, and where users can have some sort of assurance that the code that is released is the code that the hosted service is actually running. These seem like interesting problems regardless of the service being offered.</p>\n<p>Because naming things is easily the most important and most fun part of any project (seriously, I have so many domain names!), I’ve decided to call this the <!-- raw HTML omitted -->Time Fades Project<!-- raw HTML omitted -->. A placeholder page is all that’s over there, but stay tuned for more.</p>\n<p>If you have any interest in this sort of governance topic, or in contributing to the service, or in what a good set of default rules are for these sorts of ephemeral behaviors (I expect this will need to be different for different social networks), please get in touch.</p>\n",
				"content_text": "<b>Update:</b> There aren't APIs for most of the services that I'd want to use here, so I'm putting this project on pause for now. I'll probably hack something together for my own use, but trying to turn this into a service doesn't seem possible given API usage guidelines from these services.\n\n<hr>\n\nI posted the following to Twitter the other day:\n<blockquote>So, if all goes according to plan, all of my Twitter history up to yesterday-ish will be deleted, and I will have setup some code (that I control) that will delete everything older than 7 days on an ongoing basis.\n\nI used to believe that everything posted on the Internet should stay, forever. I’m not so sure that is true. Published for public consumption, forever? Beginning to doubt that for most normal humans…\n\nIn the near future (weeks hopefully), I’m going to start automatically hiding old photos, blog posts, everything except those that seem really worthwhile to keep up indefinitely. I’m working on the rules still, curious what people think are good rules.\n\nI’m almost certain that corporate social media policies, especially for public facing employees, should strongly recommend services that do the same - either delete or tighten up permissions after a window of time on public posts (And anything on FB)…</blockquote>\nSo, in short - you're only going to see ~7 days of old tweets on my Twitter account. This post is about how I'm setting that up.\n<h2>The short term hack</h2>\nTwitter makes this hard (though I think this is unintentional). Specifically, they make it hard to access anything more than the last 3200 tweets in your account via the API. So, getting your account down to just the last 7 days ends up requiring two bits of software:\n<ol>\n \t<li>Find a way to delete tweets older than my most recent 3200.</li>\n \t<li>Setup a process that watches my twitter feed regularly and deletes tweets older than 7 (or whatever) days.</li>\n</ol>\n<h3>Deleting all of my tweets</h3>\nI decided I would delete all of my tweets to begin with. If twitter offered a native “archive” or unpublish option, a la Instagram, I may not have deleted everything. But they don’t, so this was my only option to start with a clean slate.[footnote]I didn’t feel too bad about this, because I had an out. As part of this process, I had to download my official twitter data archive, which has everything. On top of that, I use a bookmarking service called <a href=\"http://pinboard.in\">Pinboard</a> that has a feature that copies all my tweets and makes them searchable, privately, just for me. (It does require the paid archive feature in order to get the full text of the tweet. Otherwise it only stores a truncated version of the text.)[/footnote]\n\nI found a small script someone wrote on Github, forked it, and then modified it quite significantly. The script and instructions are <a href=\"https://github.com/sujal/tweet-cleaner\">on my Github account</a>. You’ll need to be comfortable at the command line if you want to use it. It’s rough, and I offer no guarantees that it will run smoothly for you. Also, keep in mind - it will delete <strong>all</strong> of your tweets, and <strong>there is no undo</strong>. Keep your backup archive safe, and make sure this is what you want: delete <strong>everything</strong>.\n\nTo get around the 3200 tweet API issue mentioned above, the script uses the <code>tweets.js</code> file that comes in the data backup from Twitter, so the good thing is that you’re basically forced to download the backup to use the utility. That file contains the IDs for all of your tweets (among other things), which is all we need to issue the delete command for that tweet.\n<h3>The ongoing culling of my older tweets</h3>\nAgain, I started with someone else’s code. I found a nice little project written in Go that leveraged AWS Lambda to run the little bot. I used this project as a chance to brush up on my Cloud Formation skills, as well. My fork, with CloudFormation templates, is <a href=\"https://github.com/sujal/ephemeral\">on my Github account</a> as well. There’s even a handy “Launch Stack” button if you want to set it up on your own AWS account.\n\nThe bot runs every few hours, looks for tweets in my account older than the interval I’ve configured, currently set at 7 days, and deletes them if it finds anything. It’s all pretty simple.\n<h2>Making this a thing</h2>\nAs I started working through this, I starting thinking about enabling this for the other social media services I use. I don’t know why everything, from Flickr to Pinboard don’t offer ephemerality as a feature. If the feature is offered, it should be the default. As I mentioned at the start, I don’t believe we, as people, are prepared for a world with total recall of our every utterance. My thoughts on this are complicated[footnote]For example, I’m not in favor of the right-to-be-forgotten laws even as I want services to offer that capability on the individual service level…[/footnote], but suffice to say, I am going to build tools that allow me to manage my social media presence following these guidelines.\n\nI mentioned this to a few folks, and got a few enthusiastic “I want that for my account!” comments. So, I’m going to spin this up as a side project and see what I can cobble together. If you take a look at the code I linked to above, it’s very simplistic - fine for a single account, but not the best for a real service.\n\nThe other aspect of this I’m working on is governance. I don’t want to do this as a business - that’s not a goal. What I do want is a service that has a strong privacy stance, that offers high trust to folks that use it. One of the reasons I didn’t use the public services that are out there is that their business model is unclear.[footnote]I do think the popular ones, like <a href=\"https://www.tweetdelete.net\">TweetDelete</a>, seem like fine options. That one, for example, is owned by a hosting company that doesn’t seem to need the revenue from a tweet deletion service.[/footnote]\n\nI am hoping to use this as an experiment in a cooperative form of governance for an online service, one where any charges are transparently used to maintain the service, where the source code is available for people to review, and where users can have some sort of assurance that the code that is released is the code that the hosted service is actually running. These seem like interesting problems regardless of the service being offered.\n\nBecause naming things is easily the most important and most fun part of any project (seriously, I have so many domain names!), I’ve decided to call this the <a href=\"https://www.timefades.com\">Time Fades Project</a>. A placeholder page is all that’s over there, but stay tuned for more.\n\nIf you have any interest in this sort of governance topic, or in contributing to the service, or in what a good set of default rules are for these sorts of ephemeral behaviors (I expect this will need to be different for different social networks), please get in touch.\n",
				"date_published": "2018-08-01T22:07:10-04:00",
				"url": "https://sujal.micro.blog/2018/08/01/time-should-fade.html",
				"tags": ["Programming"]
			},
			{
				"id": "http://sujal.micro.blog/2018/03/25/i-deactivated-my.html",
				"title": "I Deactivated My Facebook Profile",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>Just as a public service announcement: I deactivated my Facebook account to see what it's like to not have a Facebook account. I suspect I'm going to run into places where it's impossible not to have one, but let's see what it's like.</p>\n\n<p>Over the past year, especially since the 2016 election, I find Facebook... exhausting. Mentally, it's draining. Lots of debate, lots of echoes, and mental noise in my life that I don't really need. In January, I deleted the app from my phone to see what that was like.</p>\n\n<p>While it wasn't a major factor, after the Cambridge Analytica stuff and yet another \"<a href=\"https://arstechnica.com/information-technology/2018/03/facebook-scraped-call-text-message-data-for-years-from-android-phones/\">Facebook abused it's access to your phone</a>\" tidbit coming out, I'm also just kinda done trusting their engineers.</p>\n\n<p>If you want to keep up with the kids, <a href=\"https://flickr.com/photos/sujal\">friend me on Flickr</a> or <a href=\"https://instagram.com/sujal\">Instagram</a>[footnote]Yes, I know it's owned by Facebook...[/footnote]. If you want to keep up with my news posts, <a href=\"https://twitter.com/sujal\">follow me on Twitter</a>. If you want to just ignore me, I'm cool with that, too. :)</p>\n\n<p>I'm contemplating starting a project with a friend or two to replace the most valuable (to me) function of FB - as a clearinghouse for keeping up with your friends &amp; family. More on that once work quiets down a little. Lots of ideas on how to structure that as a side project...</p>\n",
				"date_published": "2018-03-25T23:15:48-04:00",
				"url": "https://sujal.micro.blog/2018/03/25/i-deactivated-my.html",
				"tags": ["Me Me Me"]
			},
			{
				"id": "http://sujal.micro.blog/2017/06/26/e-pluribus-unum.html",
				"title": "E Pluribus Unum",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<blockquote>\n  <p>The motto of the United States is not, in fact, “Fuck you, I got mine.” It was, and should have remained, “E Pluribus Unum” — out of many, one. We’re all Americans. We all deserve the blessings this country can provide. This one is willing to pay his taxes for the benefit of the many.</p>\n</blockquote>\n\n<p>Source: <a style=\"color: white; text-decoration: underline;\" href=\"http://whatever.scalzi.com/2017/06/22/on-that-gop-health-care-bill-and-tax-breaks/\">John Scalzi</a> (read the whole thing)</p>\n",
				"date_published": "2017-06-26T12:51:00-04:00",
				"url": "https://sujal.micro.blog/2017/06/26/e-pluribus-unum.html",
				"tags": ["Politics","Quote"]
			},
			{
				"id": "http://sujal.micro.blog/2016/11/11/we-hold-these.html",
				"title": "We hold these truths to be self-evident...",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>Like many of you who vehemently opposed a Trump presidency, I've been walking around in a bit of a stunned stupor these last few days. I'm gathering my thoughts on what I want to do next, and how I can do the most I can to help bring about a more respectful world. There has to be a better way for us to talk to each other, and a better way to be humans to each other.</p>\n\n<p>Until then, I've been reflecting on what I know:</p>\n\n<ol>\n<li><p>I know I can't comprehend running away, even though given my current work experience, I could probably easily find a job overseas. I also can't see disengaging, Garrison Keillor, \"<a href=\"https://www.washingtonpost.com/opinions/trump-voters-will-not-like-what-happens-next/2016/11/09/e346ffc2-a67f-11e6-8fc0-7be8f848c492_story.html\">Let them deal with it</a>\" style. I love my country too much, and I know evil flourishes only when good people do nothing.</p></li>\n<li><p>I know most Trump voters aren't KKK style racists. Thus, I don't blame Trump voters en masse for the racism and bigotry that's emerging (and sure to get worse) or think they're all racists.</p></li>\n<li><p>I know that many of non-racist, non-sexist Trump voters seem blind to the limitations of their own experiences and the biases that creates. I hope that the these voters recognize the real fear that many minorities are feeling after the election. It is real. There are real fears here informed by <a href=\"https://medium.com/@seanokane/day-1-in-trumps-america-9e4d58381001#.1eazzuqgd\">real violence happening right now</a>, real fears caused by un-American behavior.</p></li>\n<li><p>I know that we, as a society, seem to be lacking in basic empathy these days. We are too willing to believe people we disagree with are stupid or blind or ignorant. Please try to approach your fellow Americans with an open mind and an willingness to understand their perspective. You don't need to agree - but it's better than assuming they're idiots or stupid for being scared. I try to assume people are acting in good faith until they prove they aren't.</p></li>\n<li><p>I know that Facebook and Twitter have fed a lot of the divisiveness this election cycle, no matter what <a href=\"http://www.theverge.com/2016/11/10/13594558/mark-zuckerberg-election-fake-news-trump?utm_campaign=theverge&amp;utm_content=chorus&amp;utm_medium=social&amp;utm_source=twitter\">Mark Zuckerberg says</a>, or what picture <a href=\"http://qz.com/833670/twitters-jack-dorsey-is-the-major-tech-ceo-to-speak-about-power-and-accountability-following-donald-trumps-election-victory/\">Jack Dorsey paints about his own beliefs</a>. We don't all need to agree, but we do need to agree on a common set of facts and some shared truths. We can and should interpret those according to our own beliefs and our own perspectives, but we can't disagree on whether gravity works or that 2+2=4. For a lot of reasons, we have receded into echo chambers, and we need to do something about it (<a href=\"http://www.niemanlab.org/2016/11/the-forces-that-drove-this-elections-media-failure-are-likely-to-get-worse/\">or it will get a lot worse</a>).</p></li>\n<li><p>I know the Democratic party as it stands doesn't work the way I want it to anymore. We need to help the party evolve, possibly by <a href=\"https://medium.com/@biggiesu/they-dont-speak-for-me-e61b1897137f#.xderzr7wu\">working outside the party</a>. Tea Partiers organized. Folks that have an alternative need to do the same.</p></li>\n<li><p>I know I need to engage more. More at the local level. More at the state level. And then maybe at the federal level. The question in front of me is, \"How?\"</p></li>\n</ol>\n\n<p>That's the question that will preoccupy me until we move back home. I'll probably not write anything else until then. I won't be able to help but retweet the odd Trump item on Twitter, but I'm going to dial back on social media, read and follow what he does, and talk offline to friends and family. It's time to get to work.</p>\n\n<img src=\"uploads/2024/a599d1f108.jpg\"> \n",
				"date_published": "2016-11-11T02:30:39-04:00",
				"url": "https://sujal.micro.blog/2016/11/11/we-hold-these.html",
				"tags": ["In the News","Politics"]
			},
			{
				"id": "http://sujal.micro.blog/2016/02/25/from-humble-beginnings.html",
				"title": "From Humble Beginnings: the NFL vs. eSports",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<p>All of that combined makes being a professional “League of Legends” player a viable career opportunity. This helps the game reach its full potential, because we want to avoid our pro players coming under financial stress and having to hold down part-time jobs. We want to make it so being a pro player is a completely viable career opportunity.</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted -->Riot Games' CEO, Brandon Beck<!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>By most accounts, American Football[footnote]… hey, I’m overseas now, have to distinguish! :) [/footnote] started out with <a href=\"https://en.wikipedia.org/wiki/History_of_American_football\">humble beginnings</a>: a college sport that branched off association football (rugby) that spawned a bunch of disorganized professional organizations that eventually coalesced into the NFL and the college football behemoths we know about today.</p>\n\n<p>The game started in the mid 1800s. The first professional game was in the 1890s, with the first player getting <a href=\"https://en.wikipedia.org/wiki/William_Heffelfinger\">a secret single game contract</a> that paid him $500 (a staggering $13,000 in 2016 dollars). By 1920, what would be the NFL was born. Players were <a href=\"https://books.google.co.in/books?id=DHBujbvNV1AC&amp;pg=PA97&amp;lpg=PA97&amp;dq=1920+nfl+salaries&amp;source=bl&amp;ots=0-xSC1JeuZ&amp;sig=twf7YJqLs44yhpNFvTiu4rZKN68&amp;hl=en&amp;sa=X&amp;ved=0ahUKEwigi_fR1pDLAhXBkY4KHShSD8YQ6AEITDAI#v=onepage&amp;q=1920%20nfl%20salaries&amp;f=false\">averaging a few thousand dollars a year</a> ($27K in 2016 dollars) by the 30s and often took second jobs to make ends meet. By the 70s, the modern game and the college game began to take the form we see today. The rest you know: Billions of dollars and a billion fans watching for it’s marquee event.</p>\n\n<h3>Parallels</h3>\n\n<p>In the late 90s, a new genre of competition now called MOBAs (multiplayer online battle arena) came to be. Derived from a popular real time strategy game, <a href=\"https://en.wikipedia.org/wiki/StarCraft\">Starcraft</a>, it has since spawned a growing industry of games in that genre. A few games, <a href=\"https://en.wikipedia.org/wiki/League_of_Legends\">League of Legends</a> (LoL) and <a href=\"https://en.wikipedia.org/wiki/Dota_2\">Dota 2</a>, have tournaments with <a href=\"https://en.wikipedia.org/wiki/League_of_Legends_World_Championship\">million dollar prizes</a>. They have <a href=\"http://na.leagueoflegends.com/en/news/community/university/university-league-legends\">college clubs around the world</a>, including at a few you may have <a href=\"https://www.facebook.com/harvardesports/\">heard of</a>. They even have <a href=\"http://www.businessinsider.in/Theres-an-Adderall-doping-scandal-in-the-world-of-professional-gaming/articleshow/48194463.cms\">their own doping</a> problems.</p>\n\n<h3>Discovery</h3>\n\n<p>ESPN <a href=\"http://www.usatoday.com/story/tech/gaming/2014/07/17/espn-dota/12792079/\">streamed a Dota 2 tournament</a> in 2015 and even broadcast a <a href=\"http://www.sbnation.com/2015/4/27/8502649/heroes-of-the-dorm-storm-blizzard-espn2-esports-arizona-state-cal-video-games\">MOBA on ESPN2 last year</a>. Hard core sports fans were <a href=\"http://ftw.usatoday.com/2015/04/espn-esports-heroes-of-the-dorm-reaction\">less than impressed</a>.</p>\n\n<p>I admit, I also was a little confused why a game I personally had never heard of, let alone played, was worth broadcasting on TV. Being me, that meant I started doing my research: learned about big prizes and <a href=\"http://www.nytimes.com/2014/08/31/technology/esports-explosion-brings-opportunity-riches-for-video-gamers.html\">huge audiences</a>, read about the <a href=\"http://www.nytimes.com/2014/10/20/technology/league-of-legends-south-korea-epicenter-esports.html?_r=0\">massive popularity of eSports in Korea</a>, and looked at the games themselves.</p>\n\n<p>That these games are the popular tournament ones makes sense to me. I used to <em>love</em> RTS games back in the day[footnote]I was a decent Starcraft player in my youth, and related titles like <a href=\"https://en.wikipedia.org/wiki/Warcraft_III:_Reign_of_Chaos\">Warcraft III</a> and <a href=\"https://en.wikipedia.org/wiki/Command_%26_Conquer\">Command and Conquer</a> are still some of my favorite games. And wow, I didn’t realize C&amp;C was still being released…[/footnote]. These RTS games are the predecessor to LoL, Dota 2, and Vainglory. MOBAs still share a lot in common with their ancestors. These games are a mix of:</p>\n\n<ul>\n<li>pure reflex and physical skill</li>\n<li>complex strategy carried out on a deceptively simple field</li>\n<li>clear, easy to understand objectives</li>\n</ul>\n\n<p>Actually, kind of like the NFL.</p>\n\n<p>In other words, if you don’t play, you can still tell what’s going on at a basic level (kill the other team, take an objective). But if you play… wow, there are layers to unfold and strategies to debate and technique to admire.</p>\n\n<p>I don’t play Dota or LoL, which is why a single Dota 2 broadcast couldn’t keep my attention for the whole event. I thought it was cool, recognized the RTS heritage, and basically went back to watching sports.</p>\n\n<h3>Revelation</h3>\n\n<p>One day, I picked up <a href=\"http://vainglorygame.com\">Vainglory</a>. It’s a free MOBA for iOS which was <a href=\"https://www.youtube.com/watch?v=2ChOe6dIJHw\">featured during an Apple event</a>. I dove in and immediately was hooked. I wrote about Vainglory (indirectly) <a href=\"https://fatmixx.com/2015/04/12/an-ipad-a-mac-and-a-twitch-tv/\">last year</a>. At that time, I had been playing the game frequently for months, so now (except for a couple month hiatus around the birth of my daughter) I’ve been playing this game for over a year. I literally play a round most nights before I head to bed.</p>\n\n<p>I’m naturally competitive, and so naturally I want to be good at this game… Which is when the whole thing finally clicked.</p>\n\n<p>In the Twitch post, I likened watching Twitch to the Golf Network. Boring if you’re not a golfer, but a great source of tips and help if you are. This is true of the entire community around video gaming now. For example, I’ve been watching videos on YouTube like <a href=\"https://www.youtube.com/watch?v=yIQU7Yn_UbA\">BenTimm1’s videos</a> to learn strategy and tactics. Tournaments are often streamed on <a href=\"http://www.twitch.tv/vainglory/profile\">Twitch.tv</a>, so that’s another good resource.</p>\n\n<p>Vainglory also has televised tournaments in Korea. The <a href=\"http://www.vainglorygame.com/news/vipl_broadcastschedule/\">Vainglory IPL</a> is broadcast on <a href=\"https://en.wikipedia.org/wiki/OGN_(TV_channel)\">OGN</a>, \"a South Korean cable television channel that specializes in broadcasting video game-related content and eSports matches.\" Here’s one of their broadcasts of a Vainglory IPL final:</p>\n\n<iframe width=\"640\" height=\"360\" src=\"https://www.youtube-nocookie.com/embed/tTuLitBhfTY?t=1h34m\" frameborder=\"0\" allowfullscreen></iframe>\n\n<p>Those are pretty good production values, which isn't very surprising given the popularity of eSports in Korea. You can see a huge improvement, though, as each subsequent tournament is streamed. There's a big improvement in the commentary, for example, even from <a href=\"https://www.youtube.com/watch?v=y88KJjJFvok&amp;list=PLvEkgn9uepVSRAoWa570Z-nuxCdwe2uW-&amp;index=1\">the Vainglory World Invitational final</a>, which took place right before the IPL tournament embedded above.</p>\n\n<p>It's important to note that this is for Vainglory, a relative newcomer to the MOBA and eSports world. Take everything I've said above and amplify it for LoL or Dota 2. This is a shot from Wikipedia of the Dota 2 finals crowd in Seattle:</p>\n\n<p>[caption id=\"attachment_24736\" align=\"aligncenter\" width=\"720\"]<a href=\"https://commons.wikimedia.org/w/index.php?curid=33874814\" rel=\"attachment wp-att-24736\"><img src=\"uploads/2024/8c176564a3.jpg\" alt=\"By User:DarthBotto, CC BY-SA 3.0, https://commons.wikimedia.org/w/index.php?curid=33874814\" width=\"720\" height=\"540\" class=\"size-large wp-image-24736\"></a> By <a href=\"//en.wikipedia.org/wiki/User:DarthBotto\" class=\"extiw\" title=\"en:User:DarthBotto\">User:DarthBotto</a>, <a href=\"http://creativecommons.org/licenses/by-sa/3.0\" title=\"Creative Commons Attribution-Share Alike 3.0\">CC BY-SA 3.0</a>, [commons.wikimedia.org/w/index.p...](https://commons.wikimedia.org/w/index.php?curid=33874814[/caption])</p>\n\n<h3>Legitimacy</h3>\n\n<p>While the Great Depression hurt the growth of the NFL, it did provide one benefit: it convinced otherwise respectable men to turn to football as a primary source of income. These were college educated men, <a href=\"https://books.google.co.in/books?id=DHBujbvNV1AC&amp;pg=PA179&amp;lpg=PA179&amp;dq=white+collar+families+nfl+1920s&amp;source=bl&amp;ots=0-xSC7IeC_&amp;sig=Reb6exu-vAtJxRGGEDnFxWOpKJE&amp;hl=en&amp;sa=X&amp;ved=0ahUKEwiN0uHdspLLAhWDA44KHcpsDzwQ6AEIHDAA#v=onepage&amp;q=white%20collar%20families%20nfl%201920s&amp;f=false\">disproportionately from white collar families</a> who probably would've pursued other opportunities. This raised the talent level, making the league stronger and likely creating a feedback loop[footnote]I didn't find too many sources aside from that one book (which I only have the Google excerpts for - it's out of print, it seems). The draft came to be toward the end of the Depression and pre-WWII, which could correlate. It's unclear (to me, right now) if the draft initially was because of an abundance of potential players or a way to entice players in. Worth doing more reading around this.[/footnote].</p>\n\n<p>Vainglory, my favorite, is still small, paying out 10s of thousands for their grand prizes. Dota 2 <a href=\"http://www.digitaltrends.com/gaming/valve-is-making-worlds-best-dota-2-players-into-millionaires/\">has much higher payouts and an enormous prize pool</a>. LoL is further along in their growth, and their tournaments provide a sense of where things are going. Riot Games, makers of League of Legends, provides <a href=\"http://espn.go.com/blog/playbook/tech/post/_/id/1541/league-of-legends-esports-growing\">salaries for their tournament players</a> along with travel stipends. Make the choice to leap into professional eSports easier and the talent should follow.</p>\n\n<blockquote>\n\nAll of that combined makes being a professional “League of Legends” player a viable career opportunity. This helps the game reach its full potential, because we want to avoid our pro players coming under financial stress and having to hold down part-time jobs. We want to make it so being a pro player is a completely viable career opportunity. \n\n<cite><a href=\"http://espn.go.com/blog/playbook/tech/post/_/id/1541/league-of-legends-esports-growing\">Riot Games' CEO, Brandon Beck</a></cite> \n\n</blockquote>\n\n<p>It’s still not huge money. With sponsors involved, some of these players are making a decent living, even if they need to also have a side job. Kind of like the early NFL.</p>\n\n<h3>Prediction</h3>\n\n<p>The big MOBAs are growing the infrastructure around eSports in a way that points to a sustainable future. There are campus organizations forming along with amateur associations. There’s also more mainstream acceptance of gaming thanks to smartphones, and thus a bigger potential audience. The choice to play competitively is getting easier to make for players. Those trends just need to continue in the same direction, and eSports could be a huge thing. Maybe… kind of like the NFL.</p>\n",
				"date_published": "2016-02-25T04:05:01-04:00",
				"url": "https://sujal.micro.blog/2016/02/25/from-humble-beginnings.html",
				"tags": ["Technology News"]
			},
			{
				"id": "http://sujal.micro.blog/2015/10/20/one-year-later.html",
				"title": "One year later with the Twelve South SurfacePad",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>A year ago, I wrote that the <a href=\"https://fatmixx.com/2014/12/08/my-favorite-iphone-case/\">Twelve South SurfacePad was my favorite iPhone case</a>. After a year, I'm still very happy I bought the case. I love knowing that I can leave the house with just my phone knowing I have the two most important cards with it.[footnote]Interestingly, in the US, that's my driver's license and main credit card. In India, I just carry two credit cards since I don't have a valid driver's license.[/footnote] I thought it would be worth following up on two aspects a year into using this case based on the most common questions I saw in reviews while buying the case.</p>\n\n<p>The biggest question was around one of the marquee features: can it be moved/removed without residue and while still remaining effective?</p>\n\n<p>For me, I ran into a snag, but was able to get it off and onto a new iPhone successfully. The snag has to do with how the adhesive is made. It's basically attached as a sheet to the insider of the leather. As I started pulling the case off the phone, the adhesive sheet started separating from the case and sticking to the phone. I just stopped when I noticed that, made sure I got the adhesive off, and then made sure to peel by pulling the adhesive &amp; leather. The adhesive stayed intact as a sheet, still attached to the case, once I got the first edge pulled off. I had no problem after that. No residue on the old phone, too.</p>\n\n<p>I then reattached it to the new phone. So far, it feels snug, I can dangle the phone by the case and the adhesive doesn't seem to budge at all. I'm pretty happy.</p>\n\n<p>The second question was around how the leather would age. Leather darkens and can stiffen as it ages, especially something like a phone case that's always in my hand or in a pocket.</p>\n\n<p>It has definitely darkened, and I'm debating whether to get a new case for this reason. I do like the darker red, but I'm going to get some leather cleaner and see if I can brighten it up.</p>\n\n<p>The slots that hold the cards still hold the cards well, but they do slide around a tiny bit. I have one card that's heavier, made of a faux metal material, that does want to slide out if I shake the case. That may seem contrived, but I do jog with the phone in my hand, which does worry me a little (I check to make sure the phone is right side up as I begin.</p>\n\n<p>I've included a photo below that shows the case back when I bought it, the case now, and the back of the old phone. The phone photo was taken without any cleaning or other work - just the case removed. Click on it for a larger view.</p>\n\n<p>Even with the wear, I'm really happy with the case.</p>\n\n<p><a href=\"https://fatmixx.com/wp-content/uploads/2015/10/Composite-SurfacePad-Shots-1.jpg\"><img src=\"uploads/2024/72aa472969.jpg\" alt=\"Composite-SurfacePad-Shots-small\" width=\"300\" height=\"147\" class=\"aligncenter size-medium wp-image-24655\"></a></p>\n",
				"date_published": "2015-10-20T11:34:46-04:00",
				"url": "https://sujal.micro.blog/2015/10/20/one-year-later.html",
				"tags": ["export","Product Reviews","twelve south"]
			},
			{
				"id": "http://sujal.micro.blog/2015/07/09/goodbye-google-apps.html",
				"title": "Goodbye Google Apps (GMail), Hello Fastmail (and MailRoute)",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>I recently moved nearly all of my email off of Google’s services over to <a href=\"http://www.fastmail.com/?STKI=14508441\">Fastmail</a>, with <a href=\"http://MailRoute.net\">MailRoute</a> in front of it to block spam. [footnote]My @gmail.com address can’t be moved, and I’m keeping it. While I'm shifting most of that email to my main address, I'll still use it for some things.[/footnote]</p>\n\n<p>So far, I’m really happy. The services are relatively inexpensive, and the features compare well with Google, both in terms of space as well as functionality that I used. The best thing is that Fastmail offers a real, simple, plain vanilla IMAP implementation, which means it works a lot better with my iPhone and OS X’s Mail.app without weird label/folder/all mail strangeness.</p>\n\n<p>MailRoute’s best feature is the <a href=\"https://support.mailroute.net/entries/23213573-Quarantine-Notifications\">quarantine summary email</a>. Basically, each morning (or any interval you define), MailRoute sends an email listing mail it blocked that might be legit. Each email listed has a link to recover the mail and/or whitelist the sender. So, from there, I can quickly recover false positives without logging in and trolling through dozens of obvious spam emails.</p>\n\n<p>I’m really happy with the setup, and with a lot of the surrounding email cleanup this prompted - I consolidated a few addresses and unsubscribed from a lot of newsletters/marketing crap I wasn’t reading anyway.</p>\n\n<p>On the spam front, it’s just a tiny, tiny bit worse than what I had with Google. There are fewer false positives (legit email that ends up in the spam folder) and once in a while, a spam message makes it into the inbox. There are knobs and controls to twiddle with if that bothered me, but so far I’m not motivated to fix it - it’s just not enough of an inconvenience that it bothers me.</p>\n\n<h2>Whys and Wherefores</h2>\n\n<p>Both Fastmail &amp; MailRoute are paid services, while my use of Google Apps for Domains/Business/Work/whatever-its-called-today was free. So, why did I do this?</p>\n\n<p>I had a long, rambling explanation written talking about tracking and the ad market and <a href=\"https://en.wikipedia.org/wiki/Evercookie\">evercookies</a> and <a href=\"http://money.cnn.com/2015/01/09/technology/security/super-cookies/\">super cookies</a> and why this bothered me, but I’ll summarize all of this with a few images. These are all the third party elements loaded when you visit a major online site like <a href=\"http://people.com\">people.com</a>:</p>\n\n<p><a href=\"https://fatmixx.com/wp-content/uploads/2015/07/people-com-1-1.png\"><img src=\"uploads/2024/51c2651952.jpg\" alt=\"people.com\" width=\"171\" height=\"300\" class=\"aligncenter size-medium wp-image-24627\"></a></p>\n\n<p>Step down to a smaller publication that has to be more creative about ad networks or revenue, like, say the <a href=\"http://www.norwichbulletin.com\">Norwich Bulletin</a>:</p>\n\n<p><a href=\"https://fatmixx.com/wp-content/uploads/2015/07/norwich-bulletin-1-1.png\"><img src=\"uploads/2024/95315df677.jpg\" alt=\"norwich-bulletin\" width=\"138\" height=\"300\" class=\"aligncenter size-medium wp-image-24626\"></a></p>\n\n<p>Tell me the business models and privacy policies of all of those third party sites. I’m in the industry and even I don’t recognize them all.</p>\n\n<p>While most of the top 10-20 online sites are pretty good about restricting the partners they work with, <a href=\"https://en.wikipedia.org/wiki/Behavioral_retargeting\">ad retargeting</a> and related ad models are getting more popular, all of which <a href=\"https://www.eff.org/deeplinks/2014/10/facebook-increases-its-tracking-reach-atlas-and-users-have-little-choice-about-it\">require tracking you</a> as you wander around the web.</p>\n\n<p>I just want to browse the Internet without a simple Google search or visit to an Amazon product page, for example, following me around the Internet for the next few days. So, that means not relying on services that need that data unless I have no choice. [footnote]I still can’t justify/rationalize quitting Facebook or Twitter. Moving email providers was easy. Yay, standards![/footnote]</p>\n\n<p>Email is only one of the things I’m looking at removing. I’m testing out <a href=\"https://duckduckgo.com\">DuckDuckGo</a> instead of Google Search.[footnote]so far, Google just seems better, especially for technical/programming searches. I haven’t switched over to DDG yet.[/footnote] I’m also contemplating writing/installing/tweaking a web analytics package to get rid of Google Analytics. That’s a bigger time commitment, though, so I may just need to find one with a better privacy stance.</p>\n\n<h3>Why Fastmail and MailRoute?</h3>\n\n<p>There are a lot of services out there and, if I’m being honest, I didn’t do a ton of research on this one. Just too busy these days. I heard about both of these services over the last few months from the <a href=\"http://atp.fm\">Accidental Tech Podcast</a> (MailRoute sponsored them a few times, I think), and co-host Marco Arment has <a href=\"http://www.marco.org/2015/05/29/why-not-google\">blogged about them a few times</a>.[footnote]That post, by the way, expresses a lot of what I like about this setup[/footnote]</p>\n\n<p>So, I basically just ran with that recommendation after pricing it out and deciding that the $5-6/month was worth it. A little more privacy (plus the better/different features) for a little bit of money seems like a fair tradeoff.</p>\n\n<p>Like I said, it’s been about a month and I’m very happy so far.</p>\n",
				"date_published": "2015-07-09T14:46:51-04:00",
				"url": "https://sujal.micro.blog/2015/07/09/goodbye-google-apps.html",
				"tags": ["export","Product Reviews","Technology News"]
			},
			{
				"id": "http://sujal.micro.blog/2015/04/21/moov-fitness-coaching.html",
				"title": "Moov: Fitness coaching, not just tracking",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p><a href=\"http://www.amazon.com/gp/product/B00MV96GO2/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B00MV96GO2&amp;linkCode=as2&amp;tag=fatmixx0fc-20&amp;linkId=TS23OS76MBABVJ7O\"><img src=\"uploads/2024/c394af4e1e.jpg\" alt=\"41WGe2Sns+L._SL250_\" width=\"150\" height=\"150\" class=\"alignleft size-thumbnail wp-image-24580\"></a>We're flooded with fitness oriented wearable devices from the step/activity trackers like the <a href=\"http://fitbit.com\">Fitbit</a> and <a href=\"https://jawbone.com/up\">Up</a> to smartwatches like, of course, the <a href=\"http://www.apple.com/watch/health-and-fitness/\">Apple Watch</a>. Some phones even have dedicated <a href=\"http://en.wikipedia.org/wiki/Apple_M7\">activity tracking chips</a>.</p>\n\n<p>The sad reality, though, is that most of devices are basically the same. They do step tracking. A few add some extra dimensions of motion capture, or have some additional functionality like sleep tracking, or online tools for food tracking. They're all about quantifying your day and they're mostly passive companions. You may get a short vibration when you hit some goals, but that's kind of it.</p>\n\n<p>There are exceptions, and one of them is <a href=\"https://www.moov.cc\">Moov</a>. A few years back, I preordered it based on a tweet from a friend and one feature I hadn't seen before: it pairs with dedicated smartphone apps to provide live feedback during workouts.</p>\n\n<p>So far, they have dedicated apps for <a href=\"http://run.moov.cc\">Running/Walking</a>, for <a href=\"http://boxing.moov.cc\">Cardio Boxing</a>, <a href=\"http://swim.moov.cc\">Swimming</a>, and the trendy <a href=\"http://training.moov.cc\">7-minute workout</a> (with <a href=\"http://cycling.moov.cc\">Cycling</a> on the way).</p>\n\n<p>I've been using the Running app as I come back from my shin splints injury. As I run, the app provides feedback on my balance, stride frequency, and posture, making sure I'm landing without too much force or jarring of my leg. So far, the runs feel better on my legs when using the app, and it's been good about keeping me from running to fast or too aggressively (it talks to you to stay within a certain stride frequency). It's simple, but very useful.</p>\n\n<p>I also tried the 7-minute workout app for the first time today. The workout is based on the workout the NY Times covered in <a href=\"http://well.blogs.nytimes.com/2013/05/09/the-scientific-7-minute-workout/?_r=0\">The Scientific 7-minute workout</a>. It's not the exact same workout, instead using a simpler set of exercises with multiple reps. It did feel good this morning - the muscles I don't workout regularly were slightly sore, and the app's feedback and rep counter worked well.</p>\n\n<p>Every time I use this device, I'm impressed. I'm surprised it doesn't get more buzz, to be honest. It's way more useful than any other fitness tracker I've tried. Totally recommended.</p>\n",
				"date_published": "2015-04-21T11:48:32-04:00",
				"url": "https://sujal.micro.blog/2015/04/21/moov-fitness-coaching.html",
				"tags": ["export","Product Reviews","fitness trackers","moov"]
			}
	]
}
