{
	"version": "https://jsonfeed.org/version/1",
	"title": "fatmixx",
	"icon": "https://micro.blog/sujal/avatar.jpg",
	"home_page_url": "https://fatmixx.com/",
	"feed_url": "https://fatmixx.com/feed.json",
	"items": [
		
			{
				"id": "http://sujal.micro.blog/2025/01/09/on-metas-content-moderation-changes.html",
				"title": "On Meta's content moderation changes",
				"content_html": "<p>Meta <a href=\"https://www.nytimes.com/live/2025/01/07/business/meta-fact-checking\">announced a significant change</a> to their content moderation practices yesterday. If you haven&rsquo;t read it, it boils down to this (from <a href=\"https://www.threads.net/@zuck/post/DEhgZJYJu5D\">Zuckerberg on Threads</a>):</p>\n<blockquote>\n<ol>\n<li>Replace fact-checkers with Community Notes, starting in the US.</li>\n<li>Simplify our content policies and remove restrictions on topics like immigration and gender that are out of touch with mainstream discourse.</li>\n<li>Change how we enforce our policies to remove the vast majority of censorship mistakes by focusing our filters on tackling illegal and high-severity violations and requiring higher confidence for our filters to take action.</li>\n<li>Bring back civic content. We&rsquo;re getting feedback that people want to see this content again, so we&rsquo;ll phase it back into Facebook, Instagram and Threads while working to keep the communities friendly and positive.</li>\n<li>Move our trust and safety and content moderation teams out of California, and our US content review to Texas. This will help remove the concern that biased employees are overly censoring content.</li>\n<li>Work with President Trump to push back against foreign governments going after American companies to censor more. The US has the strongest constitutional protections for free expression in the world and the best way to defend against the trend of government overreach on censorship is with the support of the US government.</li>\n</ol>\n</blockquote>\n<p>I have a strong perspective on this, but I wanted to highlight some of the best analysis on the issue that I&rsquo;ve read so far, in particular this passage from <a href=\"https://www.platformer.news/meta-fact-checking-free-speech-surrender/\">Casey Newton from his Platformer newsletter</a>:</p>\n<blockquote>\n<p>Chastened by the criticism, Meta set out to shore up its defenses. It hired 40,000 content moderators around the world, invested heavily in building new technology to analyze content for potential harms and flag it for review, and became the world’s leading funder of third-party fact-checking organizations. It spent $280 million to create an independent Oversight Board to adjudicate the most difficult questions about online speech. It disrupted dozens of networks of state-sponsored trolls who sought to use Facebook, Instagram, and WhatsApp to spread propaganda and attack dissenters.</p>\n<p>CEO Mark Zuckerberg had expected that these moves would generate goodwill for the company, particularly among the Democrats who would retake power after Trump lost in 2020. Instead, he found that disdain for the company remained strongly bipartisan. Republicans scorned him for policies that disproportionately punished the right, who post more misinformation and hate speech than the left does. Democrats blamed him for the country’s increasingly polarized politics and decaying democracy. And all sides pilloried him for the harms that his apps cause in children — an issue that 42 state attorneys general are now suing him over.</p>\n</blockquote>\n<p>It stands out to me that the moves this week are consistent with his actions in 2016 and 2020. These moves are externally prompted - reactions to whoever seems to hold power versus some new beliefs or principles held by the company or by Zuckerberg himself.</p>\n<p>Whatever else I think about the specific changes they announced, the thing at the top of my mind right now is why Zuckerberg believes things will go any differently for Meta this time? The two most likely answers to that are, first, (as the pieces linked below all mention) this is a uniquely &ldquo;transactional&rdquo; administration - a polite way of saying this administration can be bought, explicitly. The second possible answer is that it&hellip; just won&rsquo;t go differently. It&rsquo;s going to be easy for people to continue to be mad at Meta. Many of the issues people are upset about are, honestly, non-partisan: harm to their kids' mental health, fraud, and hate speech. While some groups may welcome some of that content, especially the hate speech, I still don&rsquo;t see that as being acceptable to many voters with more loosely held partisanship.</p>\n<p>Meta, in a way, epitomizes the product development version of <a href=\"https://pressthink.org/2010/11/the-view-from-nowhere-questions-and-answers/\">the view from nowhere</a> - the elevation of some noble position without doing the actual work that make that position noble. As it has been for journalists, maybe this is ultimately a no-win battle for Meta anyway, but it&rsquo;s definitely so when it&rsquo;s so obvious that there&rsquo;s no deep principle here on what makes a safe online space or a great social experience. They&rsquo;re just optimizing different metrics. Trump gives them an easy way to optimize some of the business and regulatory battles ahead.</p>\n<p>For a more favorable view of Meta&rsquo;s changes, I&rsquo;d recommend <a href=\"https://stratechery.com/2025/meta-changes-moderation-policies-zuckerbergs-journey-and-mine-the-audacity-of-copying-well/\">Ben Thompson&rsquo;s piece today</a>, <sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup> where he does a great job analyzing this as a potentially rational decision independent of politics and outcomes for users. I want to highlight this portion, which he quotes from an earlier post (summer 2024):</p>\n<blockquote>\n<p>The fundamental issue with blaming misinformation on Facebook for Trump is that it was, to use Zuckerberg’s words, “a pretty crazy idea”. That’s why all of the efforts over the last eight years to contain misinformation have totally failed; worse, they have actually made everyone mad at tech, not just Democrats. In short, you have an industry that has been endlessly vilified in the press, bent over backwards to do what the press demanded, but instead of receiving credit for those efforts, has only seen itself even more isolated and under siege…</p>\n<p>What Horowitz says about the pain of switching sides and losing friends is important: I have criticized tech companies for alienating their natural allies in Washington, but what I am driving at in this Update is the extent to which the Democrats generally and the media specifically have made a similar error; by making tech the scapegoat for Trump, “the deal” that united tech and Democrats was broken. The end result is not so much enmity as it is naked self interest. In other words, the surprise isn’t that Musk and Andreessen and Horowitz are supporting the politician that is better for their business ventures, but that Democrats gave up the enviable position of being the default choice for people who didn’t want to think about politics at all.</p>\n</blockquote>\n<p>I don&rsquo;t agree with some of Ben Thompson&rsquo;s political views, insofar as I understand them through his writing, but I <em>respect</em> his views immensely. For me, it&rsquo;s hard to argue against two basic observations: no one is happy with content moderation in Meta&rsquo;s products, and Democrats haven&rsquo;t done much to <em>govern</em> in ways that encouraged tech companies to support them. His <a href=\"https://stratechery.com/2024/tech-for-trump-breaking-the-deal-from-inertness-to-interest/\">full argument is worth reading in its entirety</a>. The net effect: for tech companies, Trump is much easier to read and manage - pay him, and he can be placated. It&rsquo;s horrifying to write that about an American president, but&hellip; here we are.</p>\n<p>Final thought - these changes will be massive for how we measure, understand, and combat misinformation on the internet. I just listened to a <a href=\"https://pod.link/recodemedia/episode/5bd09b62c90445192ab2d327a34c3d36\">wonderful interview with Renee DiResta</a>. Worth listening to if you want more details on how misinformation was researched before and how things might change from someone that was at the forefront of this work.</p>\n<p>Actually, one more thing - my own personal take on this is maybe more nuanced than you&rsquo;d expect: I am very concerned about this, not for electoral interference reasons, but because of potential harm to communities I care about, along with minorities of all stripes. As Casey Newton pointed out in the piece above, we&rsquo;ve seen the worst that can happen with light moderation in Myanmar - that ended in genocide. The US is in a bad place right now with public discourse and rising political violence. Maybe we&rsquo;re all a lot savvier about social media now, and this change will have little effect. That is the free speech argument - that more speech is the only way to combat &ldquo;bad&rdquo; speech. I&rsquo;ll be honest - even though I generally agree, I am not confident our systems can survive that approach given asymmetrical passion and asymmetrical amplification by the platforms.</p>\n<p>As a final example, it&rsquo;s worth pointing out that a major presidential campaign was willing to lie about immigrants eating pets. They didn&rsquo;t back down when numerous people pointed out that this was a lie. The only thing that stopped it from being a major factor in the election was, IMHO, the obvious ridiculousness of the lie. A bigger lie, but made in a more plausible way - e.g. the way trans athletes were <a href=\"https://www.newsweek.com/how-many-transgender-athletes-play-womens-sports-1796006\">disproportionately</a> vilified during the election  - will easily get amplified by social media. I don&rsquo;t know how to combat that, and I worry these changes undo the best effort any platform has made yet to combat this sort of evil nonsense.</p>\n<p>I hope Meta approaches this problem as a core product experience - how to really get community notes at scale on posts that may not be fully public, in a way that elevates the correction as much as the original bad take. That would be wonderful. I worry they will do what Meta does - optimize the easily quantifiable metrics at the expense of a truly meaningful free speech platform.</p>\n<p>Because of this, I&rsquo;m going to actively prioritize my networks on Bluesky - please <a href=\"https://bsky.app/profile/sujal.bsky.social\">follow me there</a> if you haven&rsquo;t already.</p>\n<p><strong>UPDATE</strong>: I swear I checked, but I really wanted to include a take by Mike Masnick, who writes a lot about content moderation and free speech issues with tech. Well, <a href=\"https://www.techdirt.com/2025/01/08/the-good-the-bad-and-the-stupid-in-metas-new-content-moderation-policies/\">he posted</a> literally as I was posting this. Worth reading in its entirety. He covers a lot of ground, including some of the positive in Meta&rsquo;s announced changes - it&rsquo;s a really good piece. He does go into the politics, unlike Ben Thompson - to me they&rsquo;re indisputably tied to this change, and he seems to agree:</p>\n<blockquote>\n<p>The timing of all of this is obviously political. It is very clearly Zuckerberg caving to more threats from Republicans, something he’s been doing a lot of in the last few months, while insisting he was done caving to political pressure.</p>\n<p>I mean, even Donald Trump is saying that Zuckerberg is doing this because of the threats that Trump and friends have leveled in his direction: [embedded tweet removed]</p>\n<p>I raise this mainly to point out the ongoing hypocrisy of all of this. For years we’ve been told that the Biden campaign (pre-inauguration in 2020 and 2021) engaged in unconstitutional coercion to force social media platforms to remove content. And here we have the exact same thing, except that it’s much more egregious and Trump is even taking credit for it… and you won’t hear a damn peep from anyone who has spent the last four years screaming about the “censorship industrial complex” pushing social media to make changes to moderation practices in their favor.</p>\n</blockquote>\n<p>Go read it!</p>\n<p><strong>UPDATE 2:</strong> Just read <a href=\"https://daringfireball.net/2025/01/meta_zuck_content_moderation_zig_zag\">John Gruber&rsquo;s take at Daring Fireball</a>. Some echoes of my point above:</p>\n<blockquote>\n<p>What the whole thing primarily highlights is that Zuckerberg has no guiding principles — zero, zilch, nada — behind any of Meta’s platforms other than “success” in and of itself. Is it about you and your closest friends and family? Or about following celebrity influencers? Politics yes, or politics no? The answers were all different a few years ago, and they’re likely to be different again a few years from now.</p>\n</blockquote>\n<p>Does anyone believe Meta is going to really, thoughtfully try for a solution here?</p>\n<p><strong>UPDATE 3:</strong> Masnick wrote a post looking deeper at the specific changes announced by Meta, specifically <a href=\"https://www.techdirt.com/2025/01/09/metas-moderation-modifications-mean-anti-lgbtq-speech-is-welcome-while-pro-lgbtq-speech-is-not/\">around language dealing with LGBT+ topics</a>:</p>\n<blockquote>\n<p>Indeed, the most incredible thing in all of this is that these changes show how successful the “working the refs” aspect of the MAGA movement has been over the last few years. It was always designed to get social media companies to create special rules for their own hot button topics, and now they’ve got them. They’re literally getting special treatment by having Meta write rules that say “your bigotry, and just your bigotry, is favored here” while at the very same time suppressing speech around LGBTQ or other progressive issues.</p>\n<p>It’s not “freedom of speech” that Zuck is bringing here. It’s “we’re taking one side in the culture war.”</p>\n</blockquote>\n<p>It really is incredible.</p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>Ben Thompson&rsquo;s posts are behind a paywall. It&rsquo;s not a cheap sub, but it&rsquo;s 100% worth it if you want to understand the business of technology. If you can&rsquo;t or don&rsquo;t want to get a sub, ping me and I will share a copy.&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "Meta [announced a significant change](https://www.nytimes.com/live/2025/01/07/business/meta-fact-checking) to their content moderation practices yesterday. If you haven't read it, it boils down to this (from [Zuckerberg on Threads](https://www.threads.net/@zuck/post/DEhgZJYJu5D)):\n\n> 1. Replace fact-checkers with Community Notes, starting in the US.\n> 2. Simplify our content policies and remove restrictions on topics like immigration and gender that are out of touch with mainstream discourse.\n> 3. Change how we enforce our policies to remove the vast majority of censorship mistakes by focusing our filters on tackling illegal and high-severity violations and requiring higher confidence for our filters to take action.\n> 4. Bring back civic content. We're getting feedback that people want to see this content again, so we'll phase it back into Facebook, Instagram and Threads while working to keep the communities friendly and positive.\n> 5. Move our trust and safety and content moderation teams out of California, and our US content review to Texas. This will help remove the concern that biased employees are overly censoring content.\n> 6. Work with President Trump to push back against foreign governments going after American companies to censor more. The US has the strongest constitutional protections for free expression in the world and the best way to defend against the trend of government overreach on censorship is with the support of the US government.\n\nI have a strong perspective on this, but I wanted to highlight some of the best analysis on the issue that I've read so far, in particular this passage from [Casey Newton from his Platformer newsletter](https://www.platformer.news/meta-fact-checking-free-speech-surrender/):\n\n> Chastened by the criticism, Meta set out to shore up its defenses. It hired 40,000 content moderators around the world, invested heavily in building new technology to analyze content for potential harms and flag it for review, and became the world’s leading funder of third-party fact-checking organizations. It spent $280 million to create an independent Oversight Board to adjudicate the most difficult questions about online speech. It disrupted dozens of networks of state-sponsored trolls who sought to use Facebook, Instagram, and WhatsApp to spread propaganda and attack dissenters.\n> \n> CEO Mark Zuckerberg had expected that these moves would generate goodwill for the company, particularly among the Democrats who would retake power after Trump lost in 2020. Instead, he found that disdain for the company remained strongly bipartisan. Republicans scorned him for policies that disproportionately punished the right, who post more misinformation and hate speech than the left does. Democrats blamed him for the country’s increasingly polarized politics and decaying democracy. And all sides pilloried him for the harms that his apps cause in children — an issue that 42 state attorneys general are now suing him over.\n\nIt stands out to me that the moves this week are consistent with his actions in 2016 and 2020. These moves are externally prompted - reactions to whoever seems to hold power versus some new beliefs or principles held by the company or by Zuckerberg himself.\n\nWhatever else I think about the specific changes they announced, the thing at the top of my mind right now is why Zuckerberg believes things will go any differently for Meta this time? The two most likely answers to that are, first, (as the pieces linked below all mention) this is a uniquely \"transactional\" administration - a polite way of saying this administration can be bought, explicitly. The second possible answer is that it... just won't go differently. It's going to be easy for people to continue to be mad at Meta. Many of the issues people are upset about are, honestly, non-partisan: harm to their kids' mental health, fraud, and hate speech. While some groups may welcome some of that content, especially the hate speech, I still don't see that as being acceptable to many voters with more loosely held partisanship.\n\nMeta, in a way, epitomizes the product development version of [the view from nowhere](https://pressthink.org/2010/11/the-view-from-nowhere-questions-and-answers/) - the elevation of some noble position without doing the actual work that make that position noble. As it has been for journalists, maybe this is ultimately a no-win battle for Meta anyway, but it's definitely so when it's so obvious that there's no deep principle here on what makes a safe online space or a great social experience. They're just optimizing different metrics. Trump gives them an easy way to optimize some of the business and regulatory battles ahead.\n\nFor a more favorable view of Meta's changes, I'd recommend [Ben Thompson's piece today](https://stratechery.com/2025/meta-changes-moderation-policies-zuckerbergs-journey-and-mine-the-audacity-of-copying-well/), [^1] where he does a great job analyzing this as a potentially rational decision independent of politics and outcomes for users. I want to highlight this portion, which he quotes from an earlier post (summer 2024):\n\n> The fundamental issue with blaming misinformation on Facebook for Trump is that it was, to use Zuckerberg’s words, “a pretty crazy idea”. That’s why all of the efforts over the last eight years to contain misinformation have totally failed; worse, they have actually made everyone mad at tech, not just Democrats. In short, you have an industry that has been endlessly vilified in the press, bent over backwards to do what the press demanded, but instead of receiving credit for those efforts, has only seen itself even more isolated and under siege…\n> \n> What Horowitz says about the pain of switching sides and losing friends is important: I have criticized tech companies for alienating their natural allies in Washington, but what I am driving at in this Update is the extent to which the Democrats generally and the media specifically have made a similar error; by making tech the scapegoat for Trump, “the deal” that united tech and Democrats was broken. The end result is not so much enmity as it is naked self interest. In other words, the surprise isn’t that Musk and Andreessen and Horowitz are supporting the politician that is better for their business ventures, but that Democrats gave up the enviable position of being the default choice for people who didn’t want to think about politics at all.\n\nI don't agree with some of Ben Thompson's political views, insofar as I understand them through his writing, but I *respect* his views immensely. For me, it's hard to argue against two basic observations: no one is happy with content moderation in Meta's products, and Democrats haven't done much to *govern* in ways that encouraged tech companies to support them. His [full argument is worth reading in its entirety](https://stratechery.com/2024/tech-for-trump-breaking-the-deal-from-inertness-to-interest/). The net effect: for tech companies, Trump is much easier to read and manage - pay him, and he can be placated. It's horrifying to write that about an American president, but... here we are.\n\nFinal thought - these changes will be massive for how we measure, understand, and combat misinformation on the internet. I just listened to a [wonderful interview with Renee DiResta](https://pod.link/recodemedia/episode/5bd09b62c90445192ab2d327a34c3d36). Worth listening to if you want more details on how misinformation was researched before and how things might change from someone that was at the forefront of this work.\n\nActually, one more thing - my own personal take on this is maybe more nuanced than you'd expect: I am very concerned about this, not for electoral interference reasons, but because of potential harm to communities I care about, along with minorities of all stripes. As Casey Newton pointed out in the piece above, we've seen the worst that can happen with light moderation in Myanmar - that ended in genocide. The US is in a bad place right now with public discourse and rising political violence. Maybe we're all a lot savvier about social media now, and this change will have little effect. That is the free speech argument - that more speech is the only way to combat \"bad\" speech. I'll be honest - even though I generally agree, I am not confident our systems can survive that approach given asymmetrical passion and asymmetrical amplification by the platforms.\n\nAs a final example, it's worth pointing out that a major presidential campaign was willing to lie about immigrants eating pets. They didn't back down when numerous people pointed out that this was a lie. The only thing that stopped it from being a major factor in the election was, IMHO, the obvious ridiculousness of the lie. A bigger lie, but made in a more plausible way - e.g. the way trans athletes were [disproportionately](https://www.newsweek.com/how-many-transgender-athletes-play-womens-sports-1796006) vilified during the election  - will easily get amplified by social media. I don't know how to combat that, and I worry these changes undo the best effort any platform has made yet to combat this sort of evil nonsense.\n\nI hope Meta approaches this problem as a core product experience - how to really get community notes at scale on posts that may not be fully public, in a way that elevates the correction as much as the original bad take. That would be wonderful. I worry they will do what Meta does - optimize the easily quantifiable metrics at the expense of a truly meaningful free speech platform.\n\nBecause of this, I'm going to actively prioritize my networks on Bluesky - please [follow me there](https://bsky.app/profile/sujal.bsky.social) if you haven't already.\n\n**UPDATE**: I swear I checked, but I really wanted to include a take by Mike Masnick, who writes a lot about content moderation and free speech issues with tech. Well, [he posted](https://www.techdirt.com/2025/01/08/the-good-the-bad-and-the-stupid-in-metas-new-content-moderation-policies/) literally as I was posting this. Worth reading in its entirety. He covers a lot of ground, including some of the positive in Meta's announced changes - it's a really good piece. He does go into the politics, unlike Ben Thompson - to me they're indisputably tied to this change, and he seems to agree:\n\n> The timing of all of this is obviously political. It is very clearly Zuckerberg caving to more threats from Republicans, something he’s been doing a lot of in the last few months, while insisting he was done caving to political pressure.\n> \n> I mean, even Donald Trump is saying that Zuckerberg is doing this because of the threats that Trump and friends have leveled in his direction: [embedded tweet removed]\n> \n> I raise this mainly to point out the ongoing hypocrisy of all of this. For years we’ve been told that the Biden campaign (pre-inauguration in 2020 and 2021) engaged in unconstitutional coercion to force social media platforms to remove content. And here we have the exact same thing, except that it’s much more egregious and Trump is even taking credit for it… and you won’t hear a damn peep from anyone who has spent the last four years screaming about the “censorship industrial complex” pushing social media to make changes to moderation practices in their favor.\n\nGo read it!\n\n**UPDATE 2:** Just read [John Gruber's take at Daring Fireball](https://daringfireball.net/2025/01/meta_zuck_content_moderation_zig_zag). Some echoes of my point above:\n\n> What the whole thing primarily highlights is that Zuckerberg has no guiding principles — zero, zilch, nada — behind any of Meta’s platforms other than “success” in and of itself. Is it about you and your closest friends and family? Or about following celebrity influencers? Politics yes, or politics no? The answers were all different a few years ago, and they’re likely to be different again a few years from now.\n\nDoes anyone believe Meta is going to really, thoughtfully try for a solution here?\n\n**UPDATE 3:** Masnick wrote a post looking deeper at the specific changes announced by Meta, specifically [around language dealing with LGBT+ topics](https://www.techdirt.com/2025/01/09/metas-moderation-modifications-mean-anti-lgbtq-speech-is-welcome-while-pro-lgbtq-speech-is-not/):\n\n> Indeed, the most incredible thing in all of this is that these changes show how successful the “working the refs” aspect of the MAGA movement has been over the last few years. It was always designed to get social media companies to create special rules for their own hot button topics, and now they’ve got them. They’re literally getting special treatment by having Meta write rules that say “your bigotry, and just your bigotry, is favored here” while at the very same time suppressing speech around LGBTQ or other progressive issues.\n> \n> It’s not “freedom of speech” that Zuck is bringing here. It’s “we’re taking one side in the culture war.”\n\nIt really is incredible.\n\n[^1]: Ben Thompson's posts are behind a paywall. It's not a cheap sub, but it's 100% worth it if you want to understand the business of technology. If you can't or don't want to get a sub, ping me and I will share a copy.\n\n",
				"date_published": "2025-01-09T14:51:00-05:00",
				"url": "https://fatmixx.com/2025/01/09/on-metas-content-moderation-changes.html"
			},
			{
				"id": "http://sujal.micro.blog/2024/12/28/uncertainty-is-going-to-be.html",
				"title": "Uncertainty is going to be the one certainty for 2025",
				"content_html": "<p>If you remember the first Trump presidency, it seemed like some major news broke\nevery month, either creating outrage or introducing a new avenue for corruption.\nThings were unpredictable and some level of volatility ruled the day.</p>\n<p>My sense is that while things will be more stable - wealthy Americans and corporations\nseem prepared and <a href=\"https://www.cbsnews.com/news/trump-tech-ceos-meta-amazon-donate-millions-inauguration/\">willing to pay (or bribe)</a>\nto enjoy some stability - there&rsquo;s still a\nlot of risk. Additionally, that risk itself is unpredictable. A stupid example:\nI accelerated the purchase of gear just in case tariffs to really kick in. Now it looks\nlike Trump may be willing to <a href=\"https://9to5mac.com/2024/12/17/analyst-trump-will-waive-apples-china-tariffs-so-it-doesnt-lose-to-samsung/\">excuse companies</a>\nfor various reasons.</p>\n<p>I just don&rsquo;t know how much the rest of the country will be willing to accept the\ndirection the wealthiest want to go, even amongst the Trump voters. There&rsquo;s at\nleast one common thread between January\n6th and the public discourse around Luigi Mangione&rsquo;s assassination of a healthcare executive:\npeople are angry. That anger is getting redirected toward violence. The question is\nwhether there&rsquo;s a trend line here and where it&rsquo;s going. For better or worse,\n<a href=\"https://www.popehat.com/p/some-other-america-one-i-do-not-know\">this sort of violence isn&rsquo;t necessarily new</a>\nfor America, but it feels different to me.</p>\n<p>I keep thinking about the line from &ldquo;The Big Short&rdquo; where the Brownfield guys\nexplain their investment thesis:</p>\n<blockquote>\n<p>People hate to think about bad things happening so they always underestimate their likelihood.</p>\n</blockquote>\n<p>I&rsquo;ve definitely been avoiding thinking about the worst that&rsquo;s possible in the next 4 years&hellip;</p>\n",
				"content_text": "If you remember the first Trump presidency, it seemed like some major news broke\nevery month, either creating outrage or introducing a new avenue for corruption.\nThings were unpredictable and some level of volatility ruled the day.\n\nMy sense is that while things will be more stable - wealthy Americans and corporations\nseem prepared and [willing to pay (or bribe)](https://www.cbsnews.com/news/trump-tech-ceos-meta-amazon-donate-millions-inauguration/) \nto enjoy some stability - there's still a\nlot of risk. Additionally, that risk itself is unpredictable. A stupid example:\nI accelerated the purchase of gear just in case tariffs to really kick in. Now it looks\nlike Trump may be willing to [excuse companies](https://9to5mac.com/2024/12/17/analyst-trump-will-waive-apples-china-tariffs-so-it-doesnt-lose-to-samsung/) \nfor various reasons.\n\nI just don't know how much the rest of the country will be willing to accept the \ndirection the wealthiest want to go, even amongst the Trump voters. There's at \nleast one common thread between January \n6th and the public discourse around Luigi Mangione's assassination of a healthcare executive: \npeople are angry. That anger is getting redirected toward violence. The question is \nwhether there's a trend line here and where it's going. For better or worse,\n[this sort of violence isn't necessarily new](https://www.popehat.com/p/some-other-america-one-i-do-not-know)\nfor America, but it feels different to me.\n\nI keep thinking about the line from \"The Big Short\" where the Brownfield guys \nexplain their investment thesis:\n\n> People hate to think about bad things happening so they always underestimate their likelihood.\n\nI've definitely been avoiding thinking about the worst that's possible in the next 4 years...\n",
				"date_published": "2024-12-31T14:05:07-05:00",
				"url": "https://fatmixx.com/2024/12/28/uncertainty-is-going-to-be.html",
				"tags": ["Politics"]
			},
			{
				"id": "http://sujal.micro.blog/2024/12/09/everything-my-doctor.html",
				"title": "Everything my doctor told me was basically right (or lessons from using Stelo for 3 months)",
				"content_html": "<p>Let&rsquo;s start this post by sharing an embarrassing fact: between leaving Disney in early 2022 and leaving Ohai in late 2024, I have gained about 28lbs (about 12kg). This wasn&rsquo;t a new trajectory - going back to the beginning of 2021, I&rsquo;ve put on 40ish pounds. By January 2024, I was a very unhealthy weight and just plain unfit.</p>\n<p>My checkup with my doctor at the beginning of the year raised some alarms. I was at risk of being diagnosed as <a href=\"https://www.hopkinsmedicine.org/health/conditions-and-diseases/diabetes/prediabetes\">pre-diabetic</a>. My blood pressure was starting to wobble higher from its normally consistent healthy level. I wanted none of this future and began making changes. My weight leveled off, but I was unable to really get it moving downward consistently, or improve my energy levels. Eventually, I started feeling crummy &amp; unhappy<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup> which led me to execute the reset I should’ve done back in 2022.</p>\n<p>As part of the reset, I’ve incorporated using a continuous glucose monitor (CGM) to help track my blood sugar. CGMs are most often associated with diabetics who want to avoid the annoyance of finger pricks to monitor their blood sugar. These days, though, CGMs are also being <a href=\"https://www.reuters.com/sports/olympics/why-are-top-athletes-using-diabetes-tech-pursuit-medals-2024-06-10/\">used by athletes to optimize training and performance</a>. These little coin-sized sensors provide insights more difficult to capture from other biosensors. There are also a few startups built around these non-diabetes uses, for example <a href=\"https://www.levels.com/\">Levels</a>.</p>\n<p>I’m not a high performance athlete, but I still wanted a CGM. My initial goal was really simple: I was determined to lower my average glucose level and knock down my <a href=\"https://www.niddk.nih.gov/health-information/diagnostic-tests/a1c-test\">A1C</a> before my follow-up exam this month (December 2024). I was also curious if it would help me gain insights into some occasional bouts of fatigue that didn’t seem tied directly to sleep quality.</p>\n<p>Over the summer, a new CGM hit the market that didn&rsquo;t require a prescription: <a href=\"https://www.stelo.com\">Stelo</a>. Stelo is made by Dexcom, makers of a <a href=\"https://www.dexcom.com/g7-cgm-system\">popular CGM</a> for diabetics, so they know how to build these sensors. The device costs between $84-$99/month, depending on the length of your subscription. They offer a single purchase (w/o subscription) and 1- and 3-month subscriptions. They can be expensed to your FSA/HSA if you want.</p>\n<p>I started using Stelo in September. Attaching the sensor is painless. The “needle” part of the sensor is super thin. I’ve never felt it go in in the 6 times I’ve replaced the sensor. It’s more painful removing the sensor - the adhesive is basically like pulling a bandage off. The sensor uses bluetooth to share data to my phone, which then records it in the background, (optionally) sharing it with the Apple Health app. <sup id=\"fnref:2\"><a href=\"#fn:2\" class=\"footnote-ref\" role=\"doc-noteref\">2</a></sup> The sensor takes about 30 minutes to warm up/calibrate, and then you get readings every minute that get pushed to your phone periodically - usually within 5 minutes, but sometimes a bit longer. Each sensor will last 2 weeks, and the app will notify you when it’s time to replace it. It also manages a grace period so you have time to replace it when convenient.</p>\n<p>The app has some rough edges and bugs, but works well enough. The app will trigger a notification when it detects a blood sugar spike (i.e. a significant change in levels, which can be the normal result of eating or a heavy workout). Tapping on the notification will offer you the option to log anything that happened around the spike - meals, exercise, a stressful event, or other notes. There are weekly insights, tips for managing blood sugar, and a few other things in the app, but I basically live on its home screen, which shows the most recent readings and a graph of the last 3, 6, 12, or 24 hours.</p>\n<p>In the three months I’ve had it, I’ve basically learned that everything my doctor has been gently encouraging me to do really has measurable, direct effects on my blood sugar and, more importantly, how I feel.</p>\n<p>I know what you’re thinking: I’m an idiot for not realizing this (or listening to my doctor). I’ll concede you have a point, but in my defense the sensor described the magnitude of the changes I needed to make, and the consistency with which I needed to implement them. Before, I fell into the trap of sort of making changes without doing anywhere near enough. The little real-time reminders, tied to real data about my specific body and choices I made that day - not just a timer that says “drink more water!” or whatever - created a perspective shift for me that registered deeper than anything else I had heard or tried to that point.</p>\n<p>So, what have I learned since starting with the sensor?</p>\n<p>First, the difference between sedentary and even a small amount of daily movement is significant. Even a short walk after a meal can curb a glucose spike that might trigger fatigue for me. A more intense workout, e.g. a 30-minute Peloton ride or strength workout, will lower my average blood glucose for the rest of the day. A consistent schedule of daily movement, even if it’s just leisurely walking, was the key to a sustained reduction in my average blood glucose.</p>\n<p>None of this should be a surprise - it’s why Oura and Apple both have step counts or activity goals in their basic feature set. The nice thing is that I could see when my body needed the workout, which made it easier to stay motivated and make adjustments if my meeting schedule or family schedule prevented a workout or a healthy meal.</p>\n<p>I was also able to see a correlation between food and the afternoon waves of fatigue that would hit on some days. There’s more I need to track there before I can share more conclusions, but there’s a pattern there that I’m now mapping to <a href=\"https://blog.myfitnesspal.com/essential-guide-macros/\">tracked macros</a> for each meal. I’m removing carb-heavy quick options (e.g. grabbing a bagel) for busy days and incorporating more of the protein-rich salads I used to eat daily at ESPN’s cafeteria pre-pandemic. Those are just two examples of several significant tweaks I’ve basically measured my way into. These changes are more recent (in the last month), but they’ve been working out really well so far.</p>\n<p>I’ve got a long road ahead of me, especially as I ramp back up into full-time hours over the coming weeks. I lost a ton of weight back in 2009-2010 - nearly 80lbs (36kg) over 18 months or so. I’ve done this before, and know it can be done without all of this technology attached. That weight loss journey was before kids and before I was a senior executive with a large team, though. <sup id=\"fnref:3\"><a href=\"#fn:3\" class=\"footnote-ref\" role=\"doc-noteref\">3</a></sup> The demands on my time are greater and more varied these days. The tech helps me follow a plan I can sustain <em>and adapt</em> going forward, no matter where my career or family life goes.</p>\n<p>In that way, the data has been a major catalyst for my health. The cumulative effect of the perspective shift, along with the smaller, weekly tweaks to sleep and diet, has been fairly dramatic: more consistent energy levels, better workouts, and my weight is finally dropping now. Oh, and my blood sugar labs and blood pressure were much better this most recent checkup, a big victory. It’s been worth it for me so far.</p>\n<p>I may stop using the Stelo in the spring unless I get back into longer-distance cycling or running again, where the data could help shape the rides/runs. I do want to get back into both by next summer, if my body is up for it. If all goes to plan, I should be facing that decision in the spring. Wish me luck!</p>\n<h3 id=\"tips--tricks-for-stelo\">Tips &amp; Tricks for Stelo</h3>\n<p>Here are some notes for things I’ve learned over the last few months. I’ll keep this updated as I learn more.</p>\n<ol>\n<li>Shave your arm where you want to attach the sensor, especially if you have hairy arms. My first sensor was fine, but with my second one, the adhesive overpatch didn’t last the full two weeks. Since shaving my upper arm, I’ve had no issues. Few people will see that part of your arm, in case you’re worried about aesthetics.</li>\n<li>I found using something like the <a href=\"https://trynood.com/products/the-eraser\">Nood Eraser</a> easier than a razor on that part of my arm.</li>\n<li>Some folks also suggest prepping the area with <a href=\"https://amzn.to/4fX2tWN\">SkinTac</a> to help adhesion, but I haven’t needed it after shaving.</li>\n<li>I do use the opposite product, <a href=\"https://amzn.to/3BaWY7T\">TacAway</a> to clean up the adhesive residue left behind by the sensor when I swap it out. Just wait for it to evaporate before inserting the new sensor.</li>\n<li>Buy a pack of overpatches in case you do have one come off for some reason - an intense workout, tight clothes that peel up the edges, or whatever. Best to have them on hand for an emergency. You can <a href=\"https://amzn.to/4gtTVq3\">find them at Amazon</a>, of course, but your local pharmacy probably has them. When my second sensor’s overpatch came off, I was able to pick up compatible patches at my local CVS.</li>\n<li>The <a href=\"https://preventivehealth.ai\">nutritionist/lifestyle coach</a> I’m working with warned me that CGMs can be somewhat inconsistent from one two week period to the next. They’re useful as directional guidance vs getting too worked about the specific level, at least between two different sensor periods. I have seen this in practice. If you need to be sure, you can pick up a blood prick sensor and see what the variation is. Those tend to be much more accurate, even amongst different manufacturers. I haven’t gone that far - for me the goal is the notification from Apple Health letting me know there’s a new baseline for my average blood glucose levels.</li>\n</ol>\n<p><em>Note: The links to Amazon above are affiliate links, which may result in me getting some money if you click on them and buy.</em></p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>Imagine being tired all the time, with too much to do at work (startup life!), and feeling like everyone had demands of your time. In hindsight, I was on a trajectory to burn out by the end of the year. I&rsquo;m glad the team I worked with helped us make adjustments to help and then eventually worked with me to plan an exit so I could execute a reset.&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n<li id=\"fn:2\" role=\"doc-endnote\">\n<p>If you’re working with nutritionists or doctors who have EMR systems connected to Apple Health, that can give them near real-time access to readings. It’s pretty handy.&#160;<a href=\"#fnref:2\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n<li id=\"fn:3\" role=\"doc-endnote\">\n<p>The words of <a href=\"https://hbr.org/2001/01/the-making-of-a-corporate-athlete\">The Making of a Corporate Athlete</a> ring so true. Sheila, our CEO at <a href=\"https://www.ohai.ai\">Ohai</a>, shared that article with all of us early in the Ohai/Proof of Learn days, to her credit (we really did have a good culture from that standpoint, a lesson I will carry forward). It is a personal regret that I didn’t take even stronger steps to put a rigorous fitness plan in place before the most intense months of the Ohai work. I was still running a bit and eating somewhat well, but not enough to counter the effects of a MUCH more sedentary lifestyle working from home combined with getting older.&#160;<a href=\"#fnref:3\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "Let's start this post by sharing an embarrassing fact: between leaving Disney in early 2022 and leaving Ohai in late 2024, I have gained about 28lbs (about 12kg). This wasn't a new trajectory - going back to the beginning of 2021, I've put on 40ish pounds. By January 2024, I was a very unhealthy weight and just plain unfit.\n\nMy checkup with my doctor at the beginning of the year raised some alarms. I was at risk of being diagnosed as [pre-diabetic](https://www.hopkinsmedicine.org/health/conditions-and-diseases/diabetes/prediabetes). My blood pressure was starting to wobble higher from its normally consistent healthy level. I wanted none of this future and began making changes. My weight leveled off, but I was unable to really get it moving downward consistently, or improve my energy levels. Eventually, I started feeling crummy & unhappy[^1] which led me to execute the reset I should’ve done back in 2022.\n\nAs part of the reset, I’ve incorporated using a continuous glucose monitor (CGM) to help track my blood sugar. CGMs are most often associated with diabetics who want to avoid the annoyance of finger pricks to monitor their blood sugar. These days, though, CGMs are also being [used by athletes to optimize training and performance](https://www.reuters.com/sports/olympics/why-are-top-athletes-using-diabetes-tech-pursuit-medals-2024-06-10/). These little coin-sized sensors provide insights more difficult to capture from other biosensors. There are also a few startups built around these non-diabetes uses, for example [Levels](https://www.levels.com/). \n\nI’m not a high performance athlete, but I still wanted a CGM. My initial goal was really simple: I was determined to lower my average glucose level and knock down my [A1C](https://www.niddk.nih.gov/health-information/diagnostic-tests/a1c-test) before my follow-up exam this month (December 2024). I was also curious if it would help me gain insights into some occasional bouts of fatigue that didn’t seem tied directly to sleep quality.\n\nOver the summer, a new CGM hit the market that didn't require a prescription: [Stelo](https://www.stelo.com). Stelo is made by Dexcom, makers of a [popular CGM](https://www.dexcom.com/g7-cgm-system) for diabetics, so they know how to build these sensors. The device costs between $84-$99/month, depending on the length of your subscription. They offer a single purchase (w/o subscription) and 1- and 3-month subscriptions. They can be expensed to your FSA/HSA if you want.\n\nI started using Stelo in September. Attaching the sensor is painless. The “needle” part of the sensor is super thin. I’ve never felt it go in in the 6 times I’ve replaced the sensor. It’s more painful removing the sensor - the adhesive is basically like pulling a bandage off. The sensor uses bluetooth to share data to my phone, which then records it in the background, (optionally) sharing it with the Apple Health app. [^2] The sensor takes about 30 minutes to warm up/calibrate, and then you get readings every minute that get pushed to your phone periodically - usually within 5 minutes, but sometimes a bit longer. Each sensor will last 2 weeks, and the app will notify you when it’s time to replace it. It also manages a grace period so you have time to replace it when convenient.\n\nThe app has some rough edges and bugs, but works well enough. The app will trigger a notification when it detects a blood sugar spike (i.e. a significant change in levels, which can be the normal result of eating or a heavy workout). Tapping on the notification will offer you the option to log anything that happened around the spike - meals, exercise, a stressful event, or other notes. There are weekly insights, tips for managing blood sugar, and a few other things in the app, but I basically live on its home screen, which shows the most recent readings and a graph of the last 3, 6, 12, or 24 hours.\n\nIn the three months I’ve had it, I’ve basically learned that everything my doctor has been gently encouraging me to do really has measurable, direct effects on my blood sugar and, more importantly, how I feel.\n\nI know what you’re thinking: I’m an idiot for not realizing this (or listening to my doctor). I’ll concede you have a point, but in my defense the sensor described the magnitude of the changes I needed to make, and the consistency with which I needed to implement them. Before, I fell into the trap of sort of making changes without doing anywhere near enough. The little real-time reminders, tied to real data about my specific body and choices I made that day - not just a timer that says “drink more water!” or whatever - created a perspective shift for me that registered deeper than anything else I had heard or tried to that point.\n\nSo, what have I learned since starting with the sensor?\n\nFirst, the difference between sedentary and even a small amount of daily movement is significant. Even a short walk after a meal can curb a glucose spike that might trigger fatigue for me. A more intense workout, e.g. a 30-minute Peloton ride or strength workout, will lower my average blood glucose for the rest of the day. A consistent schedule of daily movement, even if it’s just leisurely walking, was the key to a sustained reduction in my average blood glucose.\n\nNone of this should be a surprise - it’s why Oura and Apple both have step counts or activity goals in their basic feature set. The nice thing is that I could see when my body needed the workout, which made it easier to stay motivated and make adjustments if my meeting schedule or family schedule prevented a workout or a healthy meal.\n\nI was also able to see a correlation between food and the afternoon waves of fatigue that would hit on some days. There’s more I need to track there before I can share more conclusions, but there’s a pattern there that I’m now mapping to [tracked macros](https://blog.myfitnesspal.com/essential-guide-macros/) for each meal. I’m removing carb-heavy quick options (e.g. grabbing a bagel) for busy days and incorporating more of the protein-rich salads I used to eat daily at ESPN’s cafeteria pre-pandemic. Those are just two examples of several significant tweaks I’ve basically measured my way into. These changes are more recent (in the last month), but they’ve been working out really well so far.\n\nI’ve got a long road ahead of me, especially as I ramp back up into full-time hours over the coming weeks. I lost a ton of weight back in 2009-2010 - nearly 80lbs (36kg) over 18 months or so. I’ve done this before, and know it can be done without all of this technology attached. That weight loss journey was before kids and before I was a senior executive with a large team, though. [^3] The demands on my time are greater and more varied these days. The tech helps me follow a plan I can sustain *and adapt* going forward, no matter where my career or family life goes.\n\nIn that way, the data has been a major catalyst for my health. The cumulative effect of the perspective shift, along with the smaller, weekly tweaks to sleep and diet, has been fairly dramatic: more consistent energy levels, better workouts, and my weight is finally dropping now. Oh, and my blood sugar labs and blood pressure were much better this most recent checkup, a big victory. It’s been worth it for me so far.\n\nI may stop using the Stelo in the spring unless I get back into longer-distance cycling or running again, where the data could help shape the rides/runs. I do want to get back into both by next summer, if my body is up for it. If all goes to plan, I should be facing that decision in the spring. Wish me luck!\n\n### Tips & Tricks for Stelo\n\nHere are some notes for things I’ve learned over the last few months. I’ll keep this updated as I learn more.\n\n1. Shave your arm where you want to attach the sensor, especially if you have hairy arms. My first sensor was fine, but with my second one, the adhesive overpatch didn’t last the full two weeks. Since shaving my upper arm, I’ve had no issues. Few people will see that part of your arm, in case you’re worried about aesthetics.\n2. I found using something like the [Nood Eraser](https://trynood.com/products/the-eraser) easier than a razor on that part of my arm.\n3. Some folks also suggest prepping the area with [SkinTac](https://amzn.to/4fX2tWN) to help adhesion, but I haven’t needed it after shaving.\n4. I do use the opposite product, [TacAway](https://amzn.to/3BaWY7T) to clean up the adhesive residue left behind by the sensor when I swap it out. Just wait for it to evaporate before inserting the new sensor.\n5. Buy a pack of overpatches in case you do have one come off for some reason - an intense workout, tight clothes that peel up the edges, or whatever. Best to have them on hand for an emergency. You can [find them at Amazon](https://amzn.to/4gtTVq3), of course, but your local pharmacy probably has them. When my second sensor’s overpatch came off, I was able to pick up compatible patches at my local CVS.\n6. The [nutritionist/lifestyle coach](https://preventivehealth.ai) I’m working with warned me that CGMs can be somewhat inconsistent from one two week period to the next. They’re useful as directional guidance vs getting too worked about the specific level, at least between two different sensor periods. I have seen this in practice. If you need to be sure, you can pick up a blood prick sensor and see what the variation is. Those tend to be much more accurate, even amongst different manufacturers. I haven’t gone that far - for me the goal is the notification from Apple Health letting me know there’s a new baseline for my average blood glucose levels.\n\n*Note: The links to Amazon above are affiliate links, which may result in me getting some money if you click on them and buy.*\n\n[^1]: Imagine being tired all the time, with too much to do at work (startup life!), and feeling like everyone had demands of your time. In hindsight, I was on a trajectory to burn out by the end of the year. I'm glad the team I worked with helped us make adjustments to help and then eventually worked with me to plan an exit so I could execute a reset.\n\n[^2]: If you’re working with nutritionists or doctors who have EMR systems connected to Apple Health, that can give them near real-time access to readings. It’s pretty handy.\n\n[^3]: The words of [The Making of a Corporate Athlete](https://hbr.org/2001/01/the-making-of-a-corporate-athlete) ring so true. Sheila, our CEO at [Ohai](https://www.ohai.ai), shared that article with all of us early in the Ohai/Proof of Learn days, to her credit (we really did have a good culture from that standpoint, a lesson I will carry forward). It is a personal regret that I didn’t take even stronger steps to put a rigorous fitness plan in place before the most intense months of the Ohai work. I was still running a bit and eating somewhat well, but not enough to counter the effects of a MUCH more sedentary lifestyle working from home combined with getting older.\n",
				"date_published": "2024-12-10T00:09:16-05:00",
				"url": "https://fatmixx.com/2024/12/09/everything-my-doctor.html",
				"tags": ["Me Me Me"]
			},
			{
				"id": "http://sujal.micro.blog/2024/10/30/link-jeff-bezos.html",
				"title": "Link: Jeff Bezos’ view from nowhere",
				"content_html": "<p>It&rsquo;s appropriate that I should revive this site for the first time in years to post about politics, I guess. We are entering dangerous waters as a nation. That&rsquo;s why Bezos&rsquo;s decision and editorial this past week was one more disappointment on top of so many others. I was sketching out an articulation of why the piece bothered me even more than the LA Times situation. Luckily for you you don&rsquo;t need to read my writing. Casey Newton wrote a wonderful piece on the issue, which you should go read. It&rsquo;s spot on - Jeff Bezos is stuck at Day 2 with the Post:</p>\n<blockquote>\n<p>Yesterday, I explored how billionaires are thinking about their relationships with Donald Trump on the eve of the election. Just before I hit send, Amazon founder and Washington Post owner Jeff Bezos responded to criticism that he had prevented his editorial board from publishing its endorsement of Kamala Harris. It’s a piece of writing notable for how dated its thinking is for a famously forward-thinking entrepreneur. And to borrow a phrase from Amazon, it’s a recipe for a media industry that remains stuck squarely in Day 2.</p>\n</blockquote>\n<p>Worth reading the whole thing. The &ldquo;view from nowhere&rdquo; is poison when more and more audiences are turning to social media, clearly partisan voices, and spaces devoid of any cognitive dissonance. Of course faux neutral is not going to help.</p>\n",
				"content_text": "It's appropriate that I should revive this site for the first time in years to post about politics, I guess. We are entering dangerous waters as a nation. That's why Bezos's decision and editorial this past week was one more disappointment on top of so many others. I was sketching out an articulation of why the piece bothered me even more than the LA Times situation. Luckily for you you don't need to read my writing. Casey Newton wrote a wonderful piece on the issue, which you should go read. It's spot on - Jeff Bezos is stuck at Day 2 with the Post:\r\n\r\n> Yesterday, I explored how billionaires are thinking about their relationships with Donald Trump on the eve of the election. Just before I hit send, Amazon founder and Washington Post owner Jeff Bezos responded to criticism that he had prevented his editorial board from publishing its endorsement of Kamala Harris. It’s a piece of writing notable for how dated its thinking is for a famously forward-thinking entrepreneur. And to borrow a phrase from Amazon, it’s a recipe for a media industry that remains stuck squarely in Day 2. \r\n\r\nWorth reading the whole thing. The \"view from nowhere\" is poison when more and more audiences are turning to social media, clearly partisan voices, and spaces devoid of any cognitive dissonance. Of course faux neutral is not going to help.\n",
				"date_published": "2024-10-29T23:18:53-05:00",
				"url": "https://fatmixx.com/2024/10/30/link-jeff-bezos.html",
				"tags": ["Politics","Journalism"]
			},
			{
				"id": "http://sujal.micro.blog/2024/10/27/new-hosting-for.html",
				"title": "New hosting for Fatmixx",
				"content_html": "<p>Fatmixx has moved from <a href=\"https://pair.com\">Pair.com</a> to <a href=\"https://micro.blog\">micro.blog</a> for hosting. This also means we&rsquo;re no longer using Wordpress and are now hosted on <a href=\"https://gohugo.io\">Hugo</a>. Old URLs should redirect to the new ones, images should be working if they worked on the old host. If you see anything weird, let me know.</p>\n<p>If you want more technical details on why the change, I wrote more about this on <a href=\"https://www.usefulclever.com\">UsefulClever</a>.</p>\n<p>BTW - this had nothing to do with <a href=\"https://www.theverge.com/2024/9/27/24256361/wordpress-wp-engine-drama-explained-matt-mullenweg\">the recent Wordpress controversy</a>, I&rsquo;ve wanted to do this just for efficiency &amp; security &amp; cost for months. The controversy did bring it top of mind though.</p>\n",
				"content_text": "Fatmixx has moved from [Pair.com](https://pair.com) to [micro.blog](https://micro.blog) for hosting. This also means we're no longer using Wordpress and are now hosted on [Hugo](https://gohugo.io). Old URLs should redirect to the new ones, images should be working if they worked on the old host. If you see anything weird, let me know.\r\n\r\nIf you want more technical details on why the change, I wrote more about this on [UsefulClever](https://www.usefulclever.com).\r\n\r\nBTW - this had nothing to do with [the recent Wordpress controversy](https://www.theverge.com/2024/9/27/24256361/wordpress-wp-engine-drama-explained-matt-mullenweg), I've wanted to do this just for efficiency & security & cost for months. The controversy did bring it top of mind though.\n",
				"date_published": "2024-10-27T12:12:45-05:00",
				"url": "https://fatmixx.com/2024/10/27/new-hosting-for.html"
			},
			{
				"id": "http://sujal.micro.blog/2022/03/04/monday-links-moving.html",
				"title": "Monday links moving to another site",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<!-- wp:paragraph -->\n<p>Hi folks - hope you're having a good Friday! I've decided to consolidate the tech things I'm doing onto my other site, <a href=\"https://www.usefulclever.com\">UsefulClever</a>, which is where I was putting some of the fun projects I'm working on. There's a little more to this move that I'll share later, but if you're a long time reader of this site, add UsefulClever to your RSS reader or wherever you get the blog. Ping <a href=\"https://twitter.com/sujal\">me on Twitter</a> if you have any questions or concerns.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>You'll notice that I'll be migrating the existing Monday Links posts to UC over the day.</p>\n<!-- /wp:paragraph -->\n",
				"date_published": "2022-03-04T13:43:33-05:00",
				"url": "https://fatmixx.com/2022/03/04/monday-links-moving.html",
				"tags": ["In the News"]
			},
			{
				"id": "http://sujal.micro.blog/2018/08/01/time-should-fade.html",
				"title": "Time Should Fade (Almost) Everything...",
				"content_html": "<p><strong>Update:</strong> There aren&rsquo;t APIs for most of the services that I&rsquo;d want to use here, so I&rsquo;m putting this project on pause for now. I&rsquo;ll probably hack something together for my own use, but trying to turn this into a service doesn&rsquo;t seem possible given API usage guidelines from these services.</p>\n<hr>\n<p>I posted the following to Twitter the other day:</p>\n<blockquote>\n<p>So, if all goes according to plan, all of my Twitter history up to yesterday-ish will be deleted, and I will have setup some code (that I control) that will delete everything older than 7 days on an ongoing basis.</p>\n<p>I used to believe that everything posted on the Internet should stay, forever. I’m not so sure that is true. Published for public consumption, forever? Beginning to doubt that for most normal humans…</p>\n<p>In the near future (weeks hopefully), I’m going to start automatically hiding old photos, blog posts, everything except those that seem really worthwhile to keep up indefinitely. I’m working on the rules still, curious what people think are good rules.</p>\n<p>I’m almost certain that corporate social media policies, especially for public facing employees, should strongly recommend services that do the same - either delete or tighten up permissions after a window of time on public posts (And anything on FB)…</p>\n</blockquote>\n<p>So, in short - you&rsquo;re only going to see ~7 days of old tweets on my Twitter account. This post is about how I&rsquo;m setting that up.</p>\n<h2 id=\"the-short-term-hack\">The short term hack</h2>\n<p>Twitter makes this hard (though I think this is unintentional). Specifically, they make it hard to access anything more than the last 3200 tweets in your account via the API. So, getting your account down to just the last 7 days ends up requiring two bits of software:</p>\n<ol>\n<li>Find a way to delete tweets older than my most recent 3200.</li>\n<li>Setup a process that watches my twitter feed regularly and deletes tweets older than 7 (or whatever) days.</li>\n</ol>\n<h3 id=\"deleting-all-of-my-tweets\">Deleting all of my tweets</h3>\n<p>I decided I would delete all of my tweets to begin with. If twitter offered a native “archive” or unpublish option, a la Instagram, I may not have deleted everything. But they don’t, so this was my only option to start with a clean slate. <sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup></p>\n<p>I found a small script someone wrote on Github, forked it, and then modified it quite significantly. The script and instructions are <!-- raw HTML omitted -->on my Github account<!-- raw HTML omitted -->. You’ll need to be comfortable at the command line if you want to use it. It’s rough, and I offer no guarantees that it will run smoothly for you. Also, keep in mind - it will delete <!-- raw HTML omitted -->all<!-- raw HTML omitted --> of your tweets, and <!-- raw HTML omitted -->there is no undo<!-- raw HTML omitted -->. Keep your backup archive safe, and make sure this is what you want: delete <!-- raw HTML omitted -->everything<!-- raw HTML omitted -->.</p>\n<p>To get around the 3200 tweet API issue mentioned above, the script uses the <!-- raw HTML omitted -->tweets.js<!-- raw HTML omitted --> file that comes in the data backup from Twitter, so the good thing is that you’re basically forced to download the backup to use the utility. That file contains the IDs for all of your tweets (among other things), which is all we need to issue the delete command for that tweet.</p>\n<h3 id=\"the-ongoing-culling-of-my-older-tweets\">The ongoing culling of my older tweets</h3>\n<p>Again, I started with someone else’s code. I found a nice little project written in Go that leveraged AWS Lambda to run the little bot. I used this project as a chance to brush up on my Cloud Formation skills, as well. My fork, with CloudFormation templates, is <!-- raw HTML omitted -->on my Github account<!-- raw HTML omitted --> as well. There’s even a handy “Launch Stack” button if you want to set it up on your own AWS account.</p>\n<p>The bot runs every few hours, looks for tweets in my account older than the interval I’ve configured, currently set at 7 days, and deletes them if it finds anything. It’s all pretty simple.</p>\n<h2 id=\"making-this-a-thing\">Making this a thing</h2>\n<p>As I started working through this, I starting thinking about enabling this for the other social media services I use. I don’t know why everything, from Flickr to Pinboard don’t offer ephemerality as a feature. If the feature is offered, it should be the default. As I mentioned at the start, I don’t believe we, as people, are prepared for a world with total recall of our every utterance. My thoughts on this are complicated,<sup id=\"fnref:2\"><a href=\"#fn:2\" class=\"footnote-ref\" role=\"doc-noteref\">2</a></sup> but suffice to say, I am going to build tools that allow me to manage my social media presence following these guidelines.</p>\n<p>I mentioned this to a few folks, and got a few enthusiastic “I want that for my account!” comments. So, I’m going to spin this up as a side project and see what I can cobble together. If you take a look at the code I linked to above, it’s very simplistic - fine for a single account, but not the best for a real service.</p>\n<p>The other aspect of this I’m working on is governance. I don’t want to do this as a business - that’s not a goal. What I do want is a service that has a strong privacy stance, that offers high trust to folks that use it. One of the reasons I didn’t use the public services that are out there is that their business model is unclear. <sup id=\"fnref:3\"><a href=\"#fn:3\" class=\"footnote-ref\" role=\"doc-noteref\">3</a></sup></p>\n<p>I am hoping to use this as an experiment in a cooperative form of governance for an online service, one where any charges are transparently used to maintain the service, where the source code is available for people to review, and where users can have some sort of assurance that the code that is released is the code that the hosted service is actually running. These seem like interesting problems regardless of the service being offered.</p>\n<p>Because naming things is easily the most important and most fun part of any project (seriously, I have so many domain names!), I’ve decided to call this the Time Fades Project. A placeholder page is all that’s over there, but stay tuned for more.</p>\n<p>If you have any interest in this sort of governance topic, or in contributing to the service, or in what a good set of default rules are for these sorts of ephemeral behaviors (I expect this will need to be different for different social networks), please get in touch.</p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>I didn’t feel too bad about this, because I had an out. As part of this process, I had to download my official twitter data archive, which has everything. On top of that, I use a bookmarking service called <!-- raw HTML omitted -->Pinboard<!-- raw HTML omitted --> that has a feature that copies all my tweets and makes them searchable, privately, just for me. (It does require the paid archive feature in order to get the full text of the tweet. Otherwise it only stores a truncated version of the text.)&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n<li id=\"fn:2\" role=\"doc-endnote\">\n<p>For example, I’m not in favor of the right-to-be-forgotten laws even as I want services to offer that capability on the individual service level…&#160;<a href=\"#fnref:2\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n<li id=\"fn:3\" role=\"doc-endnote\">\n<p>I do think the popular ones, like <!-- raw HTML omitted -->TweetDelete<!-- raw HTML omitted -->, seem like fine options. That one, for example, is owned by a hosting company that doesn’t seem to need the revenue from a tweet deletion service.&#160;<a href=\"#fnref:3\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "**Update:** There aren't APIs for most of the services that I'd want to use here, so I'm putting this project on pause for now. I'll probably hack something together for my own use, but trying to turn this into a service doesn't seem possible given API usage guidelines from these services.\n\n----\n\nI posted the following to Twitter the other day:\n\n>  So, if all goes according to plan, all of my Twitter history up to yesterday-ish will be deleted, and I will have setup some code (that I control) that will delete everything older than 7 days on an ongoing basis.\n> \n> I used to believe that everything posted on the Internet should stay, forever. I’m not so sure that is true. Published for public consumption, forever? Beginning to doubt that for most normal humans…\n> \n> In the near future (weeks hopefully), I’m going to start automatically hiding old photos, blog posts, everything except those that seem really worthwhile to keep up indefinitely. I’m working on the rules still, curious what people think are good rules.\n> \n> I’m almost certain that corporate social media policies, especially for public facing employees, should strongly recommend services that do the same - either delete or tighten up permissions after a window of time on public posts (And anything on FB)…\n\nSo, in short - you're only going to see ~7 days of old tweets on my Twitter account. This post is about how I'm setting that up.\n\n## The short term hack\n\nTwitter makes this hard (though I think this is unintentional). Specifically, they make it hard to access anything more than the last 3200 tweets in your account via the API. So, getting your account down to just the last 7 days ends up requiring two bits of software:\n\n1. Find a way to delete tweets older than my most recent 3200.\n2. Setup a process that watches my twitter feed regularly and deletes tweets older than 7 (or whatever) days.\n\n### Deleting all of my tweets\n\nI decided I would delete all of my tweets to begin with. If twitter offered a native “archive” or unpublish option, a la Instagram, I may not have deleted everything. But they don’t, so this was my only option to start with a clean slate. [^1] \n\nI found a small script someone wrote on Github, forked it, and then modified it quite significantly. The script and instructions are <a href=\"https://github.com/sujal/tweet-cleaner\">on my Github account</a>. You’ll need to be comfortable at the command line if you want to use it. It’s rough, and I offer no guarantees that it will run smoothly for you. Also, keep in mind - it will delete <strong>all</strong> of your tweets, and <strong>there is no undo</strong>. Keep your backup archive safe, and make sure this is what you want: delete <strong>everything</strong>.\n\nTo get around the 3200 tweet API issue mentioned above, the script uses the <code>tweets.js</code> file that comes in the data backup from Twitter, so the good thing is that you’re basically forced to download the backup to use the utility. That file contains the IDs for all of your tweets (among other things), which is all we need to issue the delete command for that tweet.\n\n### The ongoing culling of my older tweets\n\nAgain, I started with someone else’s code. I found a nice little project written in Go that leveraged AWS Lambda to run the little bot. I used this project as a chance to brush up on my Cloud Formation skills, as well. My fork, with CloudFormation templates, is <a href=\"https://github.com/sujal/ephemeral\">on my Github account</a> as well. There’s even a handy “Launch Stack” button if you want to set it up on your own AWS account.\n\nThe bot runs every few hours, looks for tweets in my account older than the interval I’ve configured, currently set at 7 days, and deletes them if it finds anything. It’s all pretty simple.\n\n## Making this a thing\n\nAs I started working through this, I starting thinking about enabling this for the other social media services I use. I don’t know why everything, from Flickr to Pinboard don’t offer ephemerality as a feature. If the feature is offered, it should be the default. As I mentioned at the start, I don’t believe we, as people, are prepared for a world with total recall of our every utterance. My thoughts on this are complicated,[^2] but suffice to say, I am going to build tools that allow me to manage my social media presence following these guidelines.\n\nI mentioned this to a few folks, and got a few enthusiastic “I want that for my account!” comments. So, I’m going to spin this up as a side project and see what I can cobble together. If you take a look at the code I linked to above, it’s very simplistic - fine for a single account, but not the best for a real service.\n\nThe other aspect of this I’m working on is governance. I don’t want to do this as a business - that’s not a goal. What I do want is a service that has a strong privacy stance, that offers high trust to folks that use it. One of the reasons I didn’t use the public services that are out there is that their business model is unclear. [^3] \n\nI am hoping to use this as an experiment in a cooperative form of governance for an online service, one where any charges are transparently used to maintain the service, where the source code is available for people to review, and where users can have some sort of assurance that the code that is released is the code that the hosted service is actually running. These seem like interesting problems regardless of the service being offered.\n\nBecause naming things is easily the most important and most fun part of any project (seriously, I have so many domain names!), I’ve decided to call this the Time Fades Project. A placeholder page is all that’s over there, but stay tuned for more.\n\nIf you have any interest in this sort of governance topic, or in contributing to the service, or in what a good set of default rules are for these sorts of ephemeral behaviors (I expect this will need to be different for different social networks), please get in touch.\n\n[^1]: I didn’t feel too bad about this, because I had an out. As part of this process, I had to download my official twitter data archive, which has everything. On top of that, I use a bookmarking service called <a href=\"http://pinboard.in\">Pinboard</a> that has a feature that copies all my tweets and makes them searchable, privately, just for me. (It does require the paid archive feature in order to get the full text of the tweet. Otherwise it only stores a truncated version of the text.)\n\n[^2]: For example, I’m not in favor of the right-to-be-forgotten laws even as I want services to offer that capability on the individual service level…\n\n[^3]: I do think the popular ones, like <a href=\"https://www.tweetdelete.net\">TweetDelete</a>, seem like fine options. That one, for example, is owned by a hosting company that doesn’t seem to need the revenue from a tweet deletion service.\n",
				"date_published": "2018-08-01T21:07:10-05:00",
				"url": "https://fatmixx.com/2018/08/01/time-should-fade.html",
				"tags": ["Programming"]
			},
			{
				"id": "http://sujal.micro.blog/2018/03/25/i-deactivated-my.html",
				"title": "I Deactivated My Facebook Profile",
				"content_html": "<p>Just as a public service announcement: I deactivated my Facebook account to see what it&rsquo;s like to not have a Facebook account. I suspect I&rsquo;m going to run into places where it&rsquo;s impossible not to have one, but let&rsquo;s see what it&rsquo;s like.</p>\n<p>Over the past year, especially since the 2016 election, I find Facebook&hellip; exhausting. Mentally, it&rsquo;s draining. Lots of debate, lots of echoes, and mental noise in my life that I don&rsquo;t really need. In January, I deleted the app from my phone to see what that was like.</p>\n<p>While it wasn&rsquo;t a major factor, after the Cambridge Analytica stuff and yet another &ldquo;<!-- raw HTML omitted -->Facebook abused it&rsquo;s access to your phone<!-- raw HTML omitted -->&rdquo; tidbit coming out, I&rsquo;m also just kinda done trusting their engineers.</p>\n<p>If you want to keep up with the kids, <!-- raw HTML omitted -->friend me on Flickr<!-- raw HTML omitted --> or <!-- raw HTML omitted -->Instagram<!-- raw HTML omitted --><sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup>. If you want to keep up with my news posts, <!-- raw HTML omitted -->follow me on Twitter<!-- raw HTML omitted -->. If you want to just ignore me, I&rsquo;m cool with that, too. :)</p>\n<p>I&rsquo;m contemplating starting a project with a friend or two to replace the most valuable (to me) function of FB - as a clearinghouse for keeping up with your friends &amp; family. More on that once work quiets down a little. Lots of ideas on how to structure that as a side project&hellip;</p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>Yes, I know it&rsquo;s owned by Facebook&hellip;&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "Just as a public service announcement: I deactivated my Facebook account to see what it's like to not have a Facebook account. I suspect I'm going to run into places where it's impossible not to have one, but let's see what it's like.\n\nOver the past year, especially since the 2016 election, I find Facebook... exhausting. Mentally, it's draining. Lots of debate, lots of echoes, and mental noise in my life that I don't really need. In January, I deleted the app from my phone to see what that was like.\n\nWhile it wasn't a major factor, after the Cambridge Analytica stuff and yet another \"<a href=\"https://arstechnica.com/information-technology/2018/03/facebook-scraped-call-text-message-data-for-years-from-android-phones/\">Facebook abused it's access to your phone</a>\" tidbit coming out, I'm also just kinda done trusting their engineers.\n\nIf you want to keep up with the kids, <a href=\"https://flickr.com/photos/sujal\">friend me on Flickr</a> or <a href=\"https://instagram.com/sujal\">Instagram</a>[^1]. If you want to keep up with my news posts, <a href=\"https://twitter.com/sujal\">follow me on Twitter</a>. If you want to just ignore me, I'm cool with that, too. :)\n\nI'm contemplating starting a project with a friend or two to replace the most valuable (to me) function of FB - as a clearinghouse for keeping up with your friends & family. More on that once work quiets down a little. Lots of ideas on how to structure that as a side project...\n\n[^1]: Yes, I know it's owned by Facebook...\n",
				"date_published": "2018-03-25T22:15:48-05:00",
				"url": "https://fatmixx.com/2018/03/25/i-deactivated-my.html",
				"tags": ["Me Me Me"]
			},
			{
				"id": "http://sujal.micro.blog/2017/06/26/e-pluribus-unum.html",
				"title": "E Pluribus Unum",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<blockquote>\n  <p>The motto of the United States is not, in fact, “Fuck you, I got mine.” It was, and should have remained, “E Pluribus Unum” — out of many, one. We’re all Americans. We all deserve the blessings this country can provide. This one is willing to pay his taxes for the benefit of the many.</p>\n</blockquote>\n\n<p>Source: <a href=\"http://whatever.scalzi.com/2017/06/22/on-that-gop-health-care-bill-and-tax-breaks/\">John Scalzi</a> (read the whole thing)</p>\n",
				"date_published": "2017-06-26T11:51:00-05:00",
				"url": "https://fatmixx.com/2017/06/26/e-pluribus-unum.html",
				"tags": ["Politics","Quote"]
			},
			{
				"id": "http://sujal.micro.blog/2016/11/11/we-hold-these.html",
				"title": "We hold these truths to be self-evident...",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>Like many of you who vehemently opposed a Trump presidency, I've been walking around in a bit of a stunned stupor these last few days. I'm gathering my thoughts on what I want to do next, and how I can do the most I can to help bring about a more respectful world. There has to be a better way for us to talk to each other, and a better way to be humans to each other.</p>\n\n<p>Until then, I've been reflecting on what I know:</p>\n\n<ol>\n<li><p>I know I can't comprehend running away, even though given my current work experience, I could probably easily find a job overseas. I also can't see disengaging, Garrison Keillor, \"<a href=\"https://www.washingtonpost.com/opinions/trump-voters-will-not-like-what-happens-next/2016/11/09/e346ffc2-a67f-11e6-8fc0-7be8f848c492_story.html\">Let them deal with it</a>\" style. I love my country too much, and I know evil flourishes only when good people do nothing.</p></li>\n<li><p>I know most Trump voters aren't KKK style racists. Thus, I don't blame Trump voters en masse for the racism and bigotry that's emerging (and sure to get worse) or think they're all racists.</p></li>\n<li><p>I know that many of non-racist, non-sexist Trump voters seem blind to the limitations of their own experiences and the biases that creates. I hope that the these voters recognize the real fear that many minorities are feeling after the election. It is real. There are real fears here informed by <a href=\"https://medium.com/@seanokane/day-1-in-trumps-america-9e4d58381001#.1eazzuqgd\">real violence happening right now</a>, real fears caused by un-American behavior.</p></li>\n<li><p>I know that we, as a society, seem to be lacking in basic empathy these days. We are too willing to believe people we disagree with are stupid or blind or ignorant. Please try to approach your fellow Americans with an open mind and an willingness to understand their perspective. You don't need to agree - but it's better than assuming they're idiots or stupid for being scared. I try to assume people are acting in good faith until they prove they aren't.</p></li>\n<li><p>I know that Facebook and Twitter have fed a lot of the divisiveness this election cycle, no matter what <a href=\"http://www.theverge.com/2016/11/10/13594558/mark-zuckerberg-election-fake-news-trump?utm_campaign=theverge&amp;utm_content=chorus&amp;utm_medium=social&amp;utm_source=twitter\">Mark Zuckerberg says</a>, or what picture <a href=\"http://qz.com/833670/twitters-jack-dorsey-is-the-major-tech-ceo-to-speak-about-power-and-accountability-following-donald-trumps-election-victory/\">Jack Dorsey paints about his own beliefs</a>. We don't all need to agree, but we do need to agree on a common set of facts and some shared truths. We can and should interpret those according to our own beliefs and our own perspectives, but we can't disagree on whether gravity works or that 2+2=4. For a lot of reasons, we have receded into echo chambers, and we need to do something about it (<a href=\"http://www.niemanlab.org/2016/11/the-forces-that-drove-this-elections-media-failure-are-likely-to-get-worse/\">or it will get a lot worse</a>).</p></li>\n<li><p>I know the Democratic party as it stands doesn't work the way I want it to anymore. We need to help the party evolve, possibly by <a href=\"https://medium.com/@biggiesu/they-dont-speak-for-me-e61b1897137f#.xderzr7wu\">working outside the party</a>. Tea Partiers organized. Folks that have an alternative need to do the same.</p></li>\n<li><p>I know I need to engage more. More at the local level. More at the state level. And then maybe at the federal level. The question in front of me is, \"How?\"</p></li>\n</ol>\n\n<p>That's the question that will preoccupy me until we move back home. I'll probably not write anything else until then. I won't be able to help but retweet the odd Trump item on Twitter, but I'm going to dial back on social media, read and follow what he does, and talk offline to friends and family. It's time to get to work.</p>\n\n<img src=\"https://sujal.micro.blog/uploads/2024/a599d1f108.jpg\"> \n",
				"date_published": "2016-11-11T01:30:39-05:00",
				"url": "https://fatmixx.com/2016/11/11/we-hold-these.html",
				"tags": ["In the News","Politics"]
			},
			{
				"id": "http://sujal.micro.blog/2016/09/27/barack-obama-and.html",
				"title": "Barack Obama And Doris Kearns Goodwin: The Ultimate Exit Interview",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<blockquote>\n  <p>But I tell you what, though. [Long pause.] I’m named Barack Hussein Obama. I’m African-American. And I’ve been elected twice to this office with the majorities of the American people. So something is working.</p>\n  \n  <p><cite><a href=\"http://www.vanityfair.com/news/2016/09/barack-obama-doris-kearns-goodwin-interview\">Vanity Fair</a></cite></p>\n</blockquote>\n\n<p>Wonderful interview with President Obama. Such a decent man with a deep appreciation for America and its history. We're going to miss him, even the folks that hate him right now.</p>\n",
				"date_published": "2016-09-26T23:19:31-05:00",
				"url": "https://fatmixx.com/2016/09/27/barack-obama-and.html",
				"tags": ["In the News","Link","barack obama"]
			},
			{
				"id": "http://sujal.micro.blog/2016/02/28/rethinking-the-worklife.html",
				"title": "Rethinking the Work-Life Equation",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<blockquote>\n<p>Workers in the experimental group were told they could work wherever, and whenever, they chose so long as projects were completed on time and goals were met; the new emphasis would be on results rather than on the number of hours spent in the office.</p>\n<p><cite><a href=\"http://www.nytimes.com/2016/02/28/magazine/rethinking-the-work-life-equation.html?smid=tw-nytimes&amp;smtyp=cur&amp;_r=0\">NY Times</a></cite></p>\n</blockquote>\n",
				"date_published": "2016-02-28T01:48:45-05:00",
				"url": "https://fatmixx.com/2016/02/28/rethinking-the-worklife.html",
				"tags": ["In the News","Link"]
			},
			{
				"id": "http://sujal.micro.blog/2016/02/25/from-humble-beginnings.html",
				"title": "From Humble Beginnings: the NFL vs. eSports",
				"content_html": "<p>By most accounts, American Football<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup> started out with <a href=\"https://en.wikipedia.org/wiki/History_of_American_football\">humble beginnings</a>: a college sport that branched off association football (rugby) that spawned a bunch of disorganized professional organizations that eventually coalesced into the NFL and the college football behemoths we know about today.</p>\n<p>The game started in the mid 1800s. The first professional game was in the 1890s, with the first player getting <a href=\"https://en.wikipedia.org/wiki/William_Heffelfinger\">a secret single game contract</a> that paid him $500 (a staggering $13,000 in 2016 dollars). By 1920, what would be the NFL was born. Players were <a href=\"https://books.google.co.in/books?id=DHBujbvNV1AC&amp;pg=PA97&amp;lpg=PA97&amp;dq=1920+nfl+salaries&amp;source=bl&amp;ots=0-xSC1JeuZ&amp;sig=twf7YJqLs44yhpNFvTiu4rZKN68&amp;hl=en&amp;sa=X&amp;ved=0ahUKEwigi_fR1pDLAhXBkY4KHShSD8YQ6AEITDAI#v=onepage&amp;q=1920%20nfl%20salaries&amp;f=false\">averaging a few thousand dollars a year</a> ($27K in 2016 dollars) by the 30s and often took second jobs to make ends meet. By the 70s, the modern game and the college game began to take the form we see today. The rest you know: Billions of dollars and a billion fans watching for it’s marquee event.</p>\n<h3 id=\"parallels\">Parallels</h3>\n<p>In the late 90s, a new genre of competition now called MOBAs (multiplayer online battle arena) came to be. Derived from a popular real time strategy game, <a href=\"https://en.wikipedia.org/wiki/StarCraft\">Starcraft</a>, it has since spawned a growing industry of games in that genre. A few games, <a href=\"https://en.wikipedia.org/wiki/League_of_Legends\">League of Legends</a> (LoL) and <a href=\"https://en.wikipedia.org/wiki/Dota_2\">Dota 2</a>, have tournaments with <a href=\"https://en.wikipedia.org/wiki/League_of_Legends_World_Championship\">million dollar prizes</a>. They have <a href=\"http://na.leagueoflegends.com/en/news/community/university/university-league-legends\">college clubs around the world</a>, including at a few you may have <a href=\"https://www.facebook.com/harvardesports/\">heard of</a>. They even have <a href=\"http://www.businessinsider.in/Theres-an-Adderall-doping-scandal-in-the-world-of-professional-gaming/articleshow/48194463.cms\">their own doping</a> problems.</p>\n<h3 id=\"discovery\">Discovery</h3>\n<p>ESPN <a href=\"http://www.usatoday.com/story/tech/gaming/2014/07/17/espn-dota/12792079/\">streamed a Dota 2 tournament</a> in 2015 and even broadcast a <a href=\"http://www.sbnation.com/2015/4/27/8502649/heroes-of-the-dorm-storm-blizzard-espn2-esports-arizona-state-cal-video-games\">MOBA on ESPN2 last year</a>. Hard core sports fans were <a href=\"http://ftw.usatoday.com/2015/04/espn-esports-heroes-of-the-dorm-reaction\">less than impressed</a>.</p>\n<p>I admit, I also was a little confused why a game I personally had never heard of, let alone played, was worth broadcasting on TV. Being me, that meant I started doing my research: learned about big prizes and <a href=\"http://www.nytimes.com/2014/08/31/technology/esports-explosion-brings-opportunity-riches-for-video-gamers.html\">huge audiences</a>, read about the <a href=\"http://www.nytimes.com/2014/10/20/technology/league-of-legends-south-korea-epicenter-esports.html?_r=0\">massive popularity of eSports in Korea</a>, and looked at the games themselves.</p>\n<p>That these games are the popular tournament ones makes sense to me. I used to <em>love</em> RTS games back in the day<sup id=\"fnref:2\"><a href=\"#fn:2\" class=\"footnote-ref\" role=\"doc-noteref\">2</a></sup>. These RTS games are the predecessor to LoL, Dota 2, and Vainglory. MOBAs still share a lot in common with their ancestors. These games are a mix of:</p>\n<ul>\n<li>pure reflex and physical skill</li>\n<li>complex strategy carried out on a deceptively simple field</li>\n<li>clear, easy to understand objectives</li>\n</ul>\n<p>Actually, kind of like the NFL.</p>\n<p>In other words, if you don’t play, you can still tell what’s going on at a basic level (kill the other team, take an objective). But if you play… wow, there are layers to unfold and strategies to debate and technique to admire.</p>\n<p>I don’t play Dota or LoL, which is why a single Dota 2 broadcast couldn’t keep my attention for the whole event. I thought it was cool, recognized the RTS heritage, and basically went back to watching sports.</p>\n<h3 id=\"revelation\">Revelation</h3>\n<p>One day, I picked up <a href=\"http://vainglorygame.com\">Vainglory</a>. It’s a free MOBA for iOS which was <a href=\"https://www.youtube.com/watch?v=2ChOe6dIJHw\">featured during an Apple event</a>. I dove in and immediately was hooked. I wrote about Vainglory (indirectly) <a href=\"https://fatmixx.com/2015/04/12/an-ipad-a-mac-and-a-twitch-tv/\">last year</a>. At that time, I had been playing the game frequently for months, so now (except for a couple month hiatus around the birth of my daughter) I’ve been playing this game for over a year. I literally play a round most nights before I head to bed.</p>\n<p>I’m naturally competitive, and so naturally I want to be good at this game… Which is when the whole thing finally clicked.</p>\n<p>In the Twitch post, I likened watching Twitch to the Golf Network. Boring if you’re not a golfer, but a great source of tips and help if you are. This is true of the entire community around video gaming now. For example, I’ve been watching videos on YouTube like <a href=\"https://www.youtube.com/watch?v=yIQU7Yn_UbA\">BenTimm1’s videos</a> to learn strategy and tactics. Tournaments are often streamed on <a href=\"http://www.twitch.tv/vainglory/profile\">Twitch.tv</a>, so that’s another good resource.</p>\n<p>Vainglory also has televised tournaments in Korea. The <a href=\"http://www.vainglorygame.com/news/vipl_broadcastschedule/\">Vainglory IPL</a> is broadcast on <a href=\"https://en.wikipedia.org/wiki/OGN_(TV_channel)\">OGN</a>, &ldquo;a South Korean cable television channel that specializes in broadcasting video game-related content and eSports matches.&rdquo; Here’s one of their broadcasts of a Vainglory IPL final:</p>\n<p>Those are pretty good production values, which isn&rsquo;t very surprising given the popularity of eSports in Korea. You can see a huge improvement, though, as each subsequent tournament is streamed. There&rsquo;s a big improvement in the commentary, for example, even from <a href=\"https://www.youtube.com/watch?v=y88KJjJFvok&amp;list=PLvEkgn9uepVSRAoWa570Z-nuxCdwe2uW-&amp;index=1\">the Vainglory World Invitational final</a>, which took place right before the IPL tournament embedded above.</p>\n<p>It&rsquo;s important to note that this is for Vainglory, a relative newcomer to the MOBA and eSports world. Take everything I&rsquo;ve said above and amplify it for LoL or Dota 2. This is a shot from Wikipedia of the Dota 2 finals crowd in Seattle:</p>\n<p>[caption id=&ldquo;attachment_24736&rdquo; align=&ldquo;aligncenter&rdquo; width=&ldquo;720&rdquo;][<img src=\"https://commons.wikimedia.org/w/index.php?curid=33874814\" alt=\"By User:DarthBotto, CC BY-SA 3.0, commons.wikimedia.org/w/index.p&hellip;\"> By <a href=\"//en.wikipedia.org/wiki/User:DarthBotto\" title=\"en:User:DarthBotto\">User:DarthBotto</a>, <a href=\"http://creativecommons.org/licenses/by-sa/3.0\" title=\"Creative Commons Attribution-Share Alike 3.0\">CC BY-SA 3.0</a>, [commons.wikimedia.org/w/index.p&hellip;](https://commons.wikimedia.org/w/index.php?curid=33874814[/caption])</p>\n<h3 id=\"legitimacy\">Legitimacy</h3>\n<p>While the Great Depression hurt the growth of the NFL, it did provide one benefit: it convinced otherwise respectable men to turn to football as a primary source of income. These were college educated men, <a href=\"https://books.google.co.in/books?id=DHBujbvNV1AC&amp;pg=PA179&amp;lpg=PA179&amp;dq=white+collar+families+nfl+1920s&amp;source=bl&amp;ots=0-xSC7IeC_&amp;sig=Reb6exu-vAtJxRGGEDnFxWOpKJE&amp;hl=en&amp;sa=X&amp;ved=0ahUKEwiN0uHdspLLAhWDA44KHcpsDzwQ6AEIHDAA#v=onepage&amp;q=white%20collar%20families%20nfl%201920s&amp;f=false\">disproportionately from white collar families</a> who probably would&rsquo;ve pursued other opportunities. This raised the talent level, making the league stronger and likely creating a feedback loop<sup id=\"fnref:3\"><a href=\"#fn:3\" class=\"footnote-ref\" role=\"doc-noteref\">3</a></sup>.</p>\n<p>Vainglory, my favorite, is still small, paying out 10s of thousands for their grand prizes. Dota 2 <a href=\"http://www.digitaltrends.com/gaming/valve-is-making-worlds-best-dota-2-players-into-millionaires/\">has much higher payouts and an enormous prize pool</a>. LoL is further along in their growth, and their tournaments provide a sense of where things are going. Riot Games, makers of League of Legends, provides <a href=\"http://espn.go.com/blog/playbook/tech/post/_/id/1541/league-of-legends-esports-growing\">salaries for their tournament players</a> along with travel stipends. Make the choice to leap into professional eSports easier and the talent should follow.</p>\n<blockquote>\n<p>All of that combined makes being a professional “League of Legends” player a viable career opportunity. This helps the game reach its full potential, because we want to avoid our pro players coming under financial stress and having to hold down part-time jobs. We want to make it so being a pro player is a completely viable career opportunity. <a href=\"http://espn.go.com/blog/playbook/tech/post/_/id/1541/league-of-legends-esports-growing\">Riot Games' CEO, Brandon Beck</a></p>\n</blockquote>\n<p>It’s still not huge money. With sponsors involved, some of these players are making a decent living, even if they need to also have a side job. Kind of like the early NFL.</p>\n<h3 id=\"prediction\">Prediction</h3>\n<p>The big MOBAs are growing the infrastructure around eSports in a way that points to a sustainable future. There are campus organizations forming along with amateur associations. There’s also more mainstream acceptance of gaming thanks to smartphones, and thus a bigger potential audience. The choice to play competitively is getting easier to make for players. Those trends just need to continue in the same direction, and eSports could be a huge thing. Maybe… kind of like the NFL.</p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>… hey, I’m overseas now, have to distinguish! :)&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n<li id=\"fn:2\" role=\"doc-endnote\">\n<p>I was a decent Starcraft player in my youth, and related titles like <a href=\"https://en.wikipedia.org/wiki/Warcraft_III:_Reign_of_Chaos\">Warcraft III</a> and <a href=\"https://en.wikipedia.org/wiki/Command_%26_Conquer\">Command and Conquer</a> are still some of my favorite games. And wow, I didn’t realize C&amp;C was still being released…&#160;<a href=\"#fnref:2\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n<li id=\"fn:3\" role=\"doc-endnote\">\n<p>I didn&rsquo;t find too many sources aside from that one book (which I only have the Google excerpts for - it&rsquo;s out of print, it seems). The draft came to be toward the end of the Depression and pre-WWII, which could correlate. It&rsquo;s unclear (to me, right now) if the draft initially was because of an abundance of potential players or a way to entice players in. Worth doing more reading around this.&#160;<a href=\"#fnref:3\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "By most accounts, American Football[^1] started out with [humble beginnings](https://en.wikipedia.org/wiki/History_of_American_football): a college sport that branched off association football (rugby) that spawned a bunch of disorganized professional organizations that eventually coalesced into the NFL and the college football behemoths we know about today.\n\nThe game started in the mid 1800s. The first professional game was in the 1890s, with the first player getting [a secret single game contract](https://en.wikipedia.org/wiki/William_Heffelfinger) that paid him $500 (a staggering $13,000 in 2016 dollars). By 1920, what would be the NFL was born. Players were [averaging a few thousand dollars a year](https://books.google.co.in/books?id=DHBujbvNV1AC&pg=PA97&lpg=PA97&dq=1920+nfl+salaries&source=bl&ots=0-xSC1JeuZ&sig=twf7YJqLs44yhpNFvTiu4rZKN68&hl=en&sa=X&ved=0ahUKEwigi_fR1pDLAhXBkY4KHShSD8YQ6AEITDAI#v=onepage&q=1920%20nfl%20salaries&f=false) ($27K in 2016 dollars) by the 30s and often took second jobs to make ends meet. By the 70s, the modern game and the college game began to take the form we see today. The rest you know: Billions of dollars and a billion fans watching for it’s marquee event.\n\n### Parallels\n\nIn the late 90s, a new genre of competition now called MOBAs (multiplayer online battle arena) came to be. Derived from a popular real time strategy game, [Starcraft](https://en.wikipedia.org/wiki/StarCraft), it has since spawned a growing industry of games in that genre. A few games, [League of Legends](https://en.wikipedia.org/wiki/League_of_Legends) (LoL) and [Dota 2](https://en.wikipedia.org/wiki/Dota_2), have tournaments with [million dollar prizes](https://en.wikipedia.org/wiki/League_of_Legends_World_Championship). They have [college clubs around the world](http://na.leagueoflegends.com/en/news/community/university/university-league-legends), including at a few you may have [heard of](https://www.facebook.com/harvardesports/). They even have [their own doping](http://www.businessinsider.in/Theres-an-Adderall-doping-scandal-in-the-world-of-professional-gaming/articleshow/48194463.cms) problems.\n\n### Discovery\n\nESPN [streamed a Dota 2 tournament](http://www.usatoday.com/story/tech/gaming/2014/07/17/espn-dota/12792079/) in 2015 and even broadcast a [MOBA on ESPN2 last year](http://www.sbnation.com/2015/4/27/8502649/heroes-of-the-dorm-storm-blizzard-espn2-esports-arizona-state-cal-video-games). Hard core sports fans were [less than impressed](http://ftw.usatoday.com/2015/04/espn-esports-heroes-of-the-dorm-reaction).\n\nI admit, I also was a little confused why a game I personally had never heard of, let alone played, was worth broadcasting on TV. Being me, that meant I started doing my research: learned about big prizes and [huge audiences](http://www.nytimes.com/2014/08/31/technology/esports-explosion-brings-opportunity-riches-for-video-gamers.html), read about the [massive popularity of eSports in Korea](http://www.nytimes.com/2014/10/20/technology/league-of-legends-south-korea-epicenter-esports.html?_r=0), and looked at the games themselves.\n\nThat these games are the popular tournament ones makes sense to me. I used to _love_ RTS games back in the day[^2]. These RTS games are the predecessor to LoL, Dota 2, and Vainglory. MOBAs still share a lot in common with their ancestors. These games are a mix of:\n\n*   pure reflex and physical skill\n*   complex strategy carried out on a deceptively simple field\n*   clear, easy to understand objectives\n\nActually, kind of like the NFL.\n\nIn other words, if you don’t play, you can still tell what’s going on at a basic level (kill the other team, take an objective). But if you play… wow, there are layers to unfold and strategies to debate and technique to admire.\n\nI don’t play Dota or LoL, which is why a single Dota 2 broadcast couldn’t keep my attention for the whole event. I thought it was cool, recognized the RTS heritage, and basically went back to watching sports.\n\n### Revelation\n\nOne day, I picked up [Vainglory](http://vainglorygame.com). It’s a free MOBA for iOS which was [featured during an Apple event](https://www.youtube.com/watch?v=2ChOe6dIJHw). I dove in and immediately was hooked. I wrote about Vainglory (indirectly) [last year](https://fatmixx.com/2015/04/12/an-ipad-a-mac-and-a-twitch-tv/). At that time, I had been playing the game frequently for months, so now (except for a couple month hiatus around the birth of my daughter) I’ve been playing this game for over a year. I literally play a round most nights before I head to bed.\n\nI’m naturally competitive, and so naturally I want to be good at this game… Which is when the whole thing finally clicked.\n\nIn the Twitch post, I likened watching Twitch to the Golf Network. Boring if you’re not a golfer, but a great source of tips and help if you are. This is true of the entire community around video gaming now. For example, I’ve been watching videos on YouTube like [BenTimm1’s videos](https://www.youtube.com/watch?v=yIQU7Yn_UbA) to learn strategy and tactics. Tournaments are often streamed on [Twitch.tv](http://www.twitch.tv/vainglory/profile), so that’s another good resource.\n\nVainglory also has televised tournaments in Korea. The [Vainglory IPL](http://www.vainglorygame.com/news/vipl_broadcastschedule/) is broadcast on [OGN](https://en.wikipedia.org/wiki/OGN_(TV_channel)), \"a South Korean cable television channel that specializes in broadcasting video game-related content and eSports matches.\" Here’s one of their broadcasts of a Vainglory IPL final:\n\nThose are pretty good production values, which isn't very surprising given the popularity of eSports in Korea. You can see a huge improvement, though, as each subsequent tournament is streamed. There's a big improvement in the commentary, for example, even from [the Vainglory World Invitational final](https://www.youtube.com/watch?v=y88KJjJFvok&list=PLvEkgn9uepVSRAoWa570Z-nuxCdwe2uW-&index=1), which took place right before the IPL tournament embedded above.\n\nIt's important to note that this is for Vainglory, a relative newcomer to the MOBA and eSports world. Take everything I've said above and amplify it for LoL or Dota 2. This is a shot from Wikipedia of the Dota 2 finals crowd in Seattle:\n\n\\[caption id=\"attachment\\_24736\" align=\"aligncenter\" width=\"720\"\\][![By User:DarthBotto, CC BY-SA 3.0, [commons.wikimedia.org/w/index.p...](https://commons.wikimedia.org/w/index.php?curid=33874814](https://sujal.micro.blog/uploads/2024/8c176564a3.jpg))](https://commons.wikimedia.org/w/index.php?curid=33874814) By [User:DarthBotto](//en.wikipedia.org/wiki/User:DarthBotto \"en:User:DarthBotto\"), [CC BY-SA 3.0](http://creativecommons.org/licenses/by-sa/3.0 \"Creative Commons Attribution-Share Alike 3.0\"), \\[commons.wikimedia.org/w/index.p...\\](https://commons.wikimedia.org/w/index.php?curid=33874814\\[/caption\\])\n\n### Legitimacy\n\nWhile the Great Depression hurt the growth of the NFL, it did provide one benefit: it convinced otherwise respectable men to turn to football as a primary source of income. These were college educated men, [disproportionately from white collar families](https://books.google.co.in/books?id=DHBujbvNV1AC&pg=PA179&lpg=PA179&dq=white+collar+families+nfl+1920s&source=bl&ots=0-xSC7IeC_&sig=Reb6exu-vAtJxRGGEDnFxWOpKJE&hl=en&sa=X&ved=0ahUKEwiN0uHdspLLAhWDA44KHcpsDzwQ6AEIHDAA#v=onepage&q=white%20collar%20families%20nfl%201920s&f=false) who probably would've pursued other opportunities. This raised the talent level, making the league stronger and likely creating a feedback loop[^3].\n\nVainglory, my favorite, is still small, paying out 10s of thousands for their grand prizes. Dota 2 [has much higher payouts and an enormous prize pool](http://www.digitaltrends.com/gaming/valve-is-making-worlds-best-dota-2-players-into-millionaires/). LoL is further along in their growth, and their tournaments provide a sense of where things are going. Riot Games, makers of League of Legends, provides [salaries for their tournament players](http://espn.go.com/blog/playbook/tech/post/_/id/1541/league-of-legends-esports-growing) along with travel stipends. Make the choice to leap into professional eSports easier and the talent should follow.\n\n> All of that combined makes being a professional “League of Legends” player a viable career opportunity. This helps the game reach its full potential, because we want to avoid our pro players coming under financial stress and having to hold down part-time jobs. We want to make it so being a pro player is a completely viable career opportunity. [Riot Games' CEO, Brandon Beck](http://espn.go.com/blog/playbook/tech/post/_/id/1541/league-of-legends-esports-growing)\n\nIt’s still not huge money. With sponsors involved, some of these players are making a decent living, even if they need to also have a side job. Kind of like the early NFL.\n\n### Prediction\n\nThe big MOBAs are growing the infrastructure around eSports in a way that points to a sustainable future. There are campus organizations forming along with amateur associations. There’s also more mainstream acceptance of gaming thanks to smartphones, and thus a bigger potential audience. The choice to play competitively is getting easier to make for players. Those trends just need to continue in the same direction, and eSports could be a huge thing. Maybe… kind of like the NFL.\n\n\n[^1]: … hey, I’m overseas now, have to distinguish! :)\n\n[^2]: I was a decent Starcraft player in my youth, and related titles like [Warcraft III](https://en.wikipedia.org/wiki/Warcraft_III:_Reign_of_Chaos) and [Command and Conquer](https://en.wikipedia.org/wiki/Command_%26_Conquer) are still some of my favorite games. And wow, I didn’t realize C&C was still being released…\n\n[^3]: I didn't find too many sources aside from that one book (which I only have the Google excerpts for - it's out of print, it seems). The draft came to be toward the end of the Depression and pre-WWII, which could correlate. It's unclear (to me, right now) if the draft initially was because of an abundance of potential players or a way to entice players in. Worth doing more reading around this.\n",
				"date_published": "2016-02-25T03:05:01-05:00",
				"url": "https://fatmixx.com/2016/02/25/from-humble-beginnings.html",
				"tags": ["Technology News"]
			},
			{
				"id": "http://sujal.micro.blog/2016/02/07/master-dynamic-mw.html",
				"title": "Master \u0026 Dynamic MW60 Headphones - Bluetooth headphones that live up to the hype",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>So, I may have a headphone problem the way some people have shoe problems.[footnote]though my wife swears I have a shoe problem, too…[/footnote] It's not quite as bad as what I see with hard core audiophiles, but still, it's bad.</p>\n\n<p>Headphone addiction is kind of like they way people get hooked on adrenaline sports. You just need to get a taste, that first moment when a pair of headphones make you sit up and go, \"whoa!\"</p>\n\n<p>For me, it first started with the first pair of headphones that really drove consistent bass (remember Sony's Mega Bass? I totally got sucked into that hype). Eventually I grew up, realized that there was a lot more going on aside from the bass, even for EDM or whatever. The real a-ha moment came with a pair of <a href=\"http://www.amazon.com/dp/B0007WZLDC/?tag=fat00a-20\">Etymotic ER-4Ps</a> that I still own to this day. They are my reference for great mid &amp; treble response. Their only drawback is their bass response. It's good, but not great, especially for tracks that really need solid bass response.</p>\n\n<p>Still, I have so many \"whoa\" moments with these headphones. I'll be listening to music I've listened to a hundred times with other headphones and I'll just hear some detail that will pull me out of whatever I'm doing. \"Whoa, what was that?\" I'll just stop &amp; listen. It might just be the brush of fingers on a guitar, the bite of a bow on strings, or individual instruments that seem to merge together on other headphones.</p>\n\n<p>The problem with the Etys is that they are IEMs - in ear monitors, or what everyone else calls earbuds. They go into the ear canal, creating a seal. The quality of the seal affects bass response. That adds a variable on top of the 4Ps flat response. So, while they feel exceptionally clear, sometimes I want to feel the sub-bass thump of an EDM track or the bass line of a hip hop track. They just showed me what was possible, but I knew there had to be better. Beyond that, IEMs aren't as comfortable for long sessions, and they're not interruption friendly (can't just drop them to my neck). Plus, no mic or playback controls on these, either.</p>\n\n<p>So when I returned to ESPN, knowing I'd be working in an office again [footnote]I really miss working at home sometimes… being able to crank a pair of desktop speakers is pretty nice.[/footnote], I started looking for over ear, closed headphones. I've used a pair of <a href=\"http://www.amazon.com/dp/B000065BPB/?tag=fat00a-20\">Sennheiser HD-280s</a> (which I also love) at work since I moved to CT, through 4 different companies, but they are finally falling apart. Besides, they aren't very portable nor do they have controls for play/pause/skip or a mic for calls. So, I began searching for a good desktop pair that also had phone controls and great, \"whoa!\" inducing sound.</p>\n\n<p>One caveat - I'm not an audiophile, I don't have golden ears, so while I aspire to own something truly crazy like the <a href=\"http://www.amazon.com/dp/B005S3EIOS/?tag=fat00a-20\">HiFiMan HE6's</a>[footnote]… which require a higher end amp to drive them, probably another $500-1000 on top of the price of the headphones…[/footnote], I've generally stayed around the $300 mark (or less). For me, headphones are less about an ideal sound and more about clarity. I want them to show me something new about my music while staying very close to what the artist heard in the studio.</p>\n\n<p>I've gone through my share of headphones. I tried the Sennheiser Momentums, knowing I like Sennheiser's sound, but returned them due to fit issues (ear cups were too small for me). I bought a pair of <a href=\"http://www.amazon.com/dp/B00AFUE7S6/?tag=fat00a-20\">PSB-M4U1s</a> based on reviews at <a href=\"https://marco.org/headphones-closed-portable\">Marco Arment's site</a> and <a href=\"http://thewirecutter.com/reviews/best-400-over-ear-headphones/\">The Wirecutter</a>. Those were the pair I was using daily until recently.</p>\n\n<p>Though the reviews were great, for my taste I found the PSB's a tiny bit bass heavy and a little muddy in the mids and muted in the treble. Good all around sound, I like them, but I had very few \"whoa!\" moments. Maybe even zero… I can't remember any right now. They're also huge, at the outside edge of portable.</p>\n\n<p>So I've been keeping an eye out for a new pair. This winter, I decided to get myself a gift, the <a href=\"http://www.masterdynamic.com/products/mw60-wireless-over-ear-headphones\">Master &amp; Dynamic MW60 Wireless</a> headphones.</p>\n\n<p>I found out about them from a bunch of press reviews around the launch, all of which were uniformly positive: <a href=\"http://thenextweb.com/insider/2015/12/07/master-dynamics-mw60-wireless-headphones-are-the-finest-cans-money-can-buy/#gref\">The Next Web</a>, <a href=\"http://www.wired.com/2015/11/review-master-dynamic-mw60-wireless-headphones/\">Wired</a>, <a href=\"http://www.engadget.com/2015/11/09/master-and-dynamic-mw60-headphones-hands-on/\">Engadget</a>, <a href=\"http://www.theverge.com/2015/12/1/9827604/bang-olufsen-h7-master-dynamic-mw60-wireless-headphones-review\">the Verge</a>. Basically, a great sounding Bluetooth headphone with a unique design and a listening profile that matches my tastes.</p>\n\n<p>The main criticism is their cost. These are expensive, luxury headphones but they live up to the luxury end of the deal. The materials are amazing. The construction is solid. The earcups are so soft and just plain pleasant to wear that I'm happy to wear them for long stretches.</p>\n\n<p>They're also Bluetooth headphones, with the tradeoffs that implies: requires charging, can have interference, and requires <a href=\"http://theheadphonelist.com/wireless-fidelity-making-sense-bluetooth-headphone-technology/\">codec support on your playback device</a>.</p>\n\n<p>I'm not concerned about charging. The MW60 have a built-in Li-Ion battery, and charge using a micro-USB cable. I have yet to run down the battery, and I've gone a few days without charging at times. They claim 16 hours of use between charges. They can also fall back to corded use.</p>\n\n<p>On the interference front, I've had nearly zero issues. The MW60s have much better range and reception than most Bluetooth headphones owing to their iPhone 4-like external antenna design. Like the iPhone 4, though, you can touch the antenna or brush it accidentally and cause the signal to drop out. I've had a few blips now and then, but not enough to get me to switch to corded use (a cord is included, can be used instead of BT). It is awesome, however, to not have to deal with the cord anymore and to still have really good sound.</p>\n\n<p>To maintain sound quality over Bluetooth, the MW60s support <a href=\"https://en.m.wikipedia.org/wiki/AptX\">aptX</a>, so you have that available if your phone or other playback device supports it. iPhones do <em>not</em> support aptX, but not to fret. Apple chooses to send AAC audio over Bluetooth, which the MW60 supports (I confirmed w/ Master &amp; Dynamic before ordering). Depending on who you ask, the quality is <a href=\"http://theheadphonelist.com/wireless-fidelity-making-sense-bluetooth-headphone-technology/\">comparable to aptX</a>.</p>\n\n<p>As I mentioned, my sound preferences tend toward the more balanced side of things. The MW60 delivers on that, with a slightly bumped bass response. That's pretty much perfect for me.</p>\n\n<p>There are a few things I would improve. The button controls for play/skip/previous could use a rethink. The buttons have several functions overloaded in unique (to me) ways. The headphones have 3 buttons, but they don't map to the typical 3 button remotes on other headphones. The Apple earbuds, Bose QC-25's and my PSBs all use the main play/pause button as a skip/previous button: single tap play/pause, double tap skip, triple tap previous. The MW60 uses long presses on the volume buttons as skip/previous buttons. It introduces a delay in the skip process - basically, I want to go to the next track, but I have to wait. I also can't skip quickly because each skip is a press, wait, press, wait, etc...</p>\n\n<p>One other smaller gripe: I wish the included cord was a mic + remote cord. It's nice to have the ability to go corded for long calls, especially in the car, and to know that I can move the mic closer if it's particularly noisy.</p>\n\n<p>These are all ultimately small issues. My only real regret is not getting the brown leather version. I ordered the black pair, as all my other headphones are black, but almost immediately regretted it, too late to change the order, though. I'll live though. They're still amazing to look at. Just not as striking as the brown leather.</p>\n\n<p>I haven't yet mentioned the price, but they're expensive (MSRP is $549). There is a lot of competition in this price range. Other reviews have suggested the <a href=\"http://www.amazon.com/dp/B014WAJ4P0/?tag=fat00a-20\">Bang &amp; Olufsen BeoPlay H7</a>, the <a href=\"http://www.amazon.com/dp/B00Y0Q9LFU/?tag=fat00a-20\">B&amp;W P5s</a>, or the <a href=\"http://www.amazon.com/dp/B00SNI44CQ/?tag=fat00a-20\">Sennheiser Momentum 2.0</a> as alternatives. Those are cheaper and many have a noise-canceling option at a similar price point. I haven't tried any of those, to be honest. I'll admit that this purchase was at least 50% driven by the design of the headphones[footnote]Though, I did research Master &amp; Dynamic's previous releases to make sure I would like the sound and they lived up to the reviews. The MW60 are based on the wired MH40, which have a longer review history. For example, check out <a href=\"http://www.head-fi.org/products/master-dynamic-mh40\">Head-Fi's reviews of them</a>.[/footnote] I'm glad I took a chance on this.</p>\n\n<p>Overall, I would recommend these if you like the look of the headphones, are OK with the tradeoffs around Bluetooth (which, IMHO are minimal with this or any high-end modern set), and are looking for a luxury item. There are better value picks out there, but this pair is gorgeous.</p>\n",
				"date_published": "2016-02-07T09:37:34-05:00",
				"url": "https://fatmixx.com/2016/02/07/master-dynamic-mw.html",
				"tags": ["export","Product Reviews","headphones","master \u0026amp; dynamic"]
			},
			{
				"id": "http://sujal.micro.blog/2015/10/20/one-year-later.html",
				"title": "One year later with the Twelve South SurfacePad",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>A year ago, I wrote that the <a href=\"https://fatmixx.com/2014/12/08/my-favorite-iphone-case/\">Twelve South SurfacePad was my favorite iPhone case</a>. After a year, I'm still very happy I bought the case. I love knowing that I can leave the house with just my phone knowing I have the two most important cards with it.[footnote]Interestingly, in the US, that's my driver's license and main credit card. In India, I just carry two credit cards since I don't have a valid driver's license.[/footnote] I thought it would be worth following up on two aspects a year into using this case based on the most common questions I saw in reviews while buying the case.</p>\n\n<p>The biggest question was around one of the marquee features: can it be moved/removed without residue and while still remaining effective?</p>\n\n<p>For me, I ran into a snag, but was able to get it off and onto a new iPhone successfully. The snag has to do with how the adhesive is made. It's basically attached as a sheet to the insider of the leather. As I started pulling the case off the phone, the adhesive sheet started separating from the case and sticking to the phone. I just stopped when I noticed that, made sure I got the adhesive off, and then made sure to peel by pulling the adhesive &amp; leather. The adhesive stayed intact as a sheet, still attached to the case, once I got the first edge pulled off. I had no problem after that. No residue on the old phone, too.</p>\n\n<p>I then reattached it to the new phone. So far, it feels snug, I can dangle the phone by the case and the adhesive doesn't seem to budge at all. I'm pretty happy.</p>\n\n<p>The second question was around how the leather would age. Leather darkens and can stiffen as it ages, especially something like a phone case that's always in my hand or in a pocket.</p>\n\n<p>It has definitely darkened, and I'm debating whether to get a new case for this reason. I do like the darker red, but I'm going to get some leather cleaner and see if I can brighten it up.</p>\n\n<p>The slots that hold the cards still hold the cards well, but they do slide around a tiny bit. I have one card that's heavier, made of a faux metal material, that does want to slide out if I shake the case. That may seem contrived, but I do jog with the phone in my hand, which does worry me a little (I check to make sure the phone is right side up as I begin.</p>\n\n<p>I've included a photo below that shows the case back when I bought it, the case now, and the back of the old phone. The phone photo was taken without any cleaning or other work - just the case removed. Click on it for a larger view.</p>\n\n<p>Even with the wear, I'm really happy with the case.</p>\n\n<p><a href=\"https://fatmixx.com/wp-content/uploads/2015/10/Composite-SurfacePad-Shots-1.jpg\"><img src=\"https://sujal.micro.blog/uploads/2024/72aa472969.jpg\" alt=\"Composite-SurfacePad-Shots-small\" width=\"300\" height=\"147\" class=\"aligncenter size-medium wp-image-24655\"></a></p>\n",
				"date_published": "2015-10-20T10:34:46-05:00",
				"url": "https://fatmixx.com/2015/10/20/one-year-later.html",
				"tags": ["export","Product Reviews","twelve south"]
			},
			{
				"id": "http://sujal.micro.blog/2015/08/02/saying-goodbye-to.html",
				"title": "Saying goodbye to Google Analytics, Hello Piwik",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>In my <a href=\"https://fatmixx.com/2015/07/09/goodbye-google-apps-gmail-hello-fastmail-and-mailroute/\">previous post</a>, I mentioned that I was looking at reducing my dependence on free services as an experiment to see if I can improve my privacy.</p>\n\n<p>That post was about changing my behavior as a consumer. This time, I’m looking at the services I use in my personal development work, especially those services that feed ad networks. In the case of my personal sites, this means Google Analytics (GA).</p>\n\n<p>I did some looking around, and decided I want to be close to the same functionality as GA. It’s not a fair comparison if I don’t have the same features, so that criteria limited my choices.</p>\n\n<p>After some poking around, I settled on running <a href=\"http://piwik.org\">Piwik</a>. It’s open source, free, and can be self-hosted on hardware I control. It seems extraordinarily customizable, though I haven’t done much here.</p>\n\n<p>There are other choices like <a href=\"http://haveamint.com\">Mint</a> or <a href=\"https://www.woopra.com\">Woopra</a> or <a href=\"http://snowplowanalytics.com\">Snowplow</a>. There are actually more commercial options than I realized, in addition to the giants like <a href=\"http://www.omniture.com\">Adobe’s Marketing Cloud</a> (aka Omniture).</p>\n\n<p>Ultimately, I chose Piwik because of it’s simplicity, it’s feature set, and it’s flexibility. I wanted to own the data[footnote]I’m surprised more companies don’t setup their own analytics, at least in addition to their primary service. A lot of interesting things can be done with the raw data.[/footnote] and I also wanted the ability to keep up with a massive site if necessary.</p>\n\n<p>So far, so good.</p>\n\n<h2>My Piwik Setup</h2>\n\n<p>I setup a cheap VPS somewhere, created a domain to host the server, and then ran Piwik on that single box. It looks like the service could have been installed on my simple web hosting account at <a href=\"https://www.pair.com\">Pair Networks</a>[footnote]Which I recommend: use this <a href=\"http://promote.pair.com/direct.pl?sujal.net+29798\">referral link</a> to give me credit.[/footnote] with room to grow, but I wanted to work through the server setup for a refresher on setting up a VPS from scratch.</p>\n\n<p>I then followed the <a href=\"http://piwik.org/docs/installation/\">Getting Started</a> guide. That’s pretty much it.</p>\n\n<p>Setup was also not as smooth as hoped. The configuration wizard has a bug, for example, that wouldn’t let it complete (I fixed it locally because I could - yay open source). It’s also non-trivial setting up an Apache server with SSL enabled when you haven’t done it in a while.</p>\n\n<h2>Cost</h2>\n\n<p>Piwik has a hosted option where I still own the data, but it’s not cheap (<a href=\"https://piwik.pro/cloud/\">Piwik Cloud</a> is minimally $29/month). Not the best option for me.</p>\n\n<p>The good thing is that the software itself is free. Of course, nothing is exactly free. Here are some of the costs I ran into:</p>\n\n<ul>\n<li>hosting for my own Piwik instance</li>\n<li>SSL certificates to enable HTTPS</li>\n<li>GeoIP database for accurate IP to location lookups (I ended up sticking with their free option)</li>\n</ul>\n\n<p>This list doesn’t include my time getting all of this running, plus the time required each year to make sure the servers are secured, running the latest security patches/upgrades, and are monitored.</p>\n\n<p>Looking back on it, Piwik Cloud might have been worth it when you consider the time &amp; money spent.</p>\n\n<h2>Bye Google Analytics</h2>\n\n<p>I’ve removed Google Analytics from my main personal web projects, and replaced it with the Piwik tracking call. Since my server is the only thing that sees this data, hopefully people are more willing to whitelist the tracking domain in their ad blocker.</p>\n",
				"date_published": "2015-08-02T12:08:39-05:00",
				"url": "https://fatmixx.com/2015/08/02/saying-goodbye-to.html",
				"tags": ["export","Review","Programming","google","google-analytics","piwik"]
			},
			{
				"id": "http://sujal.micro.blog/2015/07/09/goodbye-google-apps.html",
				"title": "Goodbye Google Apps (GMail), Hello Fastmail (and MailRoute)",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>I recently moved nearly all of my email off of Google’s services over to <a href=\"http://www.fastmail.com/?STKI=14508441\">Fastmail</a>, with <a href=\"http://MailRoute.net\">MailRoute</a> in front of it to block spam. [footnote]My @gmail.com address can’t be moved, and I’m keeping it. While I'm shifting most of that email to my main address, I'll still use it for some things.[/footnote]</p>\n\n<p>So far, I’m really happy. The services are relatively inexpensive, and the features compare well with Google, both in terms of space as well as functionality that I used. The best thing is that Fastmail offers a real, simple, plain vanilla IMAP implementation, which means it works a lot better with my iPhone and OS X’s Mail.app without weird label/folder/all mail strangeness.</p>\n\n<p>MailRoute’s best feature is the <a href=\"https://support.mailroute.net/entries/23213573-Quarantine-Notifications\">quarantine summary email</a>. Basically, each morning (or any interval you define), MailRoute sends an email listing mail it blocked that might be legit. Each email listed has a link to recover the mail and/or whitelist the sender. So, from there, I can quickly recover false positives without logging in and trolling through dozens of obvious spam emails.</p>\n\n<p>I’m really happy with the setup, and with a lot of the surrounding email cleanup this prompted - I consolidated a few addresses and unsubscribed from a lot of newsletters/marketing crap I wasn’t reading anyway.</p>\n\n<p>On the spam front, it’s just a tiny, tiny bit worse than what I had with Google. There are fewer false positives (legit email that ends up in the spam folder) and once in a while, a spam message makes it into the inbox. There are knobs and controls to twiddle with if that bothered me, but so far I’m not motivated to fix it - it’s just not enough of an inconvenience that it bothers me.</p>\n\n<h2>Whys and Wherefores</h2>\n\n<p>Both Fastmail &amp; MailRoute are paid services, while my use of Google Apps for Domains/Business/Work/whatever-its-called-today was free. So, why did I do this?</p>\n\n<p>I had a long, rambling explanation written talking about tracking and the ad market and <a href=\"https://en.wikipedia.org/wiki/Evercookie\">evercookies</a> and <a href=\"http://money.cnn.com/2015/01/09/technology/security/super-cookies/\">super cookies</a> and why this bothered me, but I’ll summarize all of this with a few images. These are all the third party elements loaded when you visit a major online site like <a href=\"http://people.com\">people.com</a>:</p>\n\n<p><a href=\"https://fatmixx.com/wp-content/uploads/2015/07/people-com-1-1.png\"><img src=\"https://sujal.micro.blog/uploads/2024/51c2651952.jpg\" alt=\"people.com\" width=\"171\" height=\"300\" class=\"aligncenter size-medium wp-image-24627\"></a></p>\n\n<p>Step down to a smaller publication that has to be more creative about ad networks or revenue, like, say the <a href=\"http://www.norwichbulletin.com\">Norwich Bulletin</a>:</p>\n\n<p><a href=\"https://fatmixx.com/wp-content/uploads/2015/07/norwich-bulletin-1-1.png\"><img src=\"https://sujal.micro.blog/uploads/2024/95315df677.jpg\" alt=\"norwich-bulletin\" width=\"138\" height=\"300\" class=\"aligncenter size-medium wp-image-24626\"></a></p>\n\n<p>Tell me the business models and privacy policies of all of those third party sites. I’m in the industry and even I don’t recognize them all.</p>\n\n<p>While most of the top 10-20 online sites are pretty good about restricting the partners they work with, <a href=\"https://en.wikipedia.org/wiki/Behavioral_retargeting\">ad retargeting</a> and related ad models are getting more popular, all of which <a href=\"https://www.eff.org/deeplinks/2014/10/facebook-increases-its-tracking-reach-atlas-and-users-have-little-choice-about-it\">require tracking you</a> as you wander around the web.</p>\n\n<p>I just want to browse the Internet without a simple Google search or visit to an Amazon product page, for example, following me around the Internet for the next few days. So, that means not relying on services that need that data unless I have no choice. [footnote]I still can’t justify/rationalize quitting Facebook or Twitter. Moving email providers was easy. Yay, standards![/footnote]</p>\n\n<p>Email is only one of the things I’m looking at removing. I’m testing out <a href=\"https://duckduckgo.com\">DuckDuckGo</a> instead of Google Search.[footnote]so far, Google just seems better, especially for technical/programming searches. I haven’t switched over to DDG yet.[/footnote] I’m also contemplating writing/installing/tweaking a web analytics package to get rid of Google Analytics. That’s a bigger time commitment, though, so I may just need to find one with a better privacy stance.</p>\n\n<h3>Why Fastmail and MailRoute?</h3>\n\n<p>There are a lot of services out there and, if I’m being honest, I didn’t do a ton of research on this one. Just too busy these days. I heard about both of these services over the last few months from the <a href=\"http://atp.fm\">Accidental Tech Podcast</a> (MailRoute sponsored them a few times, I think), and co-host Marco Arment has <a href=\"http://www.marco.org/2015/05/29/why-not-google\">blogged about them a few times</a>.[footnote]That post, by the way, expresses a lot of what I like about this setup[/footnote]</p>\n\n<p>So, I basically just ran with that recommendation after pricing it out and deciding that the $5-6/month was worth it. A little more privacy (plus the better/different features) for a little bit of money seems like a fair tradeoff.</p>\n\n<p>Like I said, it’s been about a month and I’m very happy so far.</p>\n",
				"date_published": "2015-07-09T13:46:51-05:00",
				"url": "https://fatmixx.com/2015/07/09/goodbye-google-apps.html",
				"tags": ["export","Product Reviews","Technology News"]
			},
			{
				"id": "http://sujal.micro.blog/2015/06/26/on-the-new.html",
				"title": "On the New MacBook",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>I’ve been using the <a href=\"https://www.apple.com/macbook/\">new MacBook</a> as a personal travel laptop for the last month or so. I’ve been coding and writing blog posts with it and I wanted to share my experiences.</p>\n\n<p>If you care about these sorts of things, I’m sure you’ve read countless reviews of the device. So I won’t try to cover everything. Instead, I’ll hit on a few specific things that matter to me.[footnote]Two reviews that I’ll highlight, in case you missed them: <a href=\"http://www.marco.org/2015/05/19/mistake-one\">Marco Arment’s review</a> (he hated it) and <a href=\"http://www.imore.com/macbook-2015-review\">Rene Ritchie’s review</a>.[/footnote]</p>\n\n<h2>This thing is liiiiight</h2>\n\n<p>So, I bought this sort of on a whim. I had to travel quite a bit recently, internationally and with a lot of luggage already[footnote]Ex-pat living note: when you travel back to your home country, it’s expected (neighbors will mock you otherwise) that you maximize your return luggage allowance with everyday luxuries that you can’t buy easily here in India. For example, my last trip I had a suitcase full of baby stuff from our attic, many boxes of mac &amp; cheese, maple syrup, and Clif Bars.[/footnote]. I’m working on an app for myself, and using that to learn Swift. I couldn’t justify the weight of a second laptop in my carryon, so I couldn’t/didn’t want to bring my own MacBook Pro in addition to my work laptop.[footnote]Yes, I like carrying a separate laptop for personal things. I’m always hacking on personal apps and ideas, and I do all my writing on personal gear so I don’t cross the streams. Work is work. Personal is personal.</p>\n\n<p>I recognize this is like the ultimate first world, self-inflicted problem.[/footnote]</p>\n\n<p>For this scenario - a second, lightweight companion laptop - this thing is perfect. Far better than an iPad with a keyboard, because it runs OS X, and light enough that it’s like carrying a book. I hardly notice the extra weight. It’s just awesome.</p>\n\n<h2>Yes, the keyboard is weird (trackpad, too)</h2>\n\n<p>The keyboard is a polarizing feature. Reviewers seem to love it or hate it. I love it. It does take some getting used to, but once I did, I am able to type on it as fast as I can on my MacBook Pro. Switching between the two keyboards is my biggest problem. I make a few more mistakes when I first get on the Macbook, but it goes away quickly.</p>\n\n<p>The bigger problem for me is that the keyboard layout is actually subtly different. Arrow keys and the Fn keys are the big ones for me. I still haven’t figured out the arrow keys, and still stumble around on those regularly. Thankfully I tend to code in things with <a href=\"http://www.thegeekstuff.com/2009/03/8-essential-vim-editor-navigation-fundamentals/\">Vi keybindings</a>, so it doesn’t mess me up as often as it could.</p>\n\n<p>For what it’s worth, I typed up the <a href=\"https://fatmixx.com/2015/06/23/some-observations-on-the-mobile-market-in-india/\">Mobile in India</a> blog post on my MacBook (and this post, too).</p>\n\n<p>The trackpad is similarly uncanny valley-ish, but more easily ignored. I sometimes tend to crash down on the trackpad to click it (trying to stop the screensaver from kicking in, for example), but since it doesn’t give, the haptic feedback illusion breaks since it doesn’t match the force with which I hit the trackpad.</p>\n\n<h2>Performance is merely OK</h2>\n\n<p>The Intel Core M processor used in the laptop is Intel’s attempt to build a tablet/hybrid processor. The processor also limits the amount of RAM. It’s OK for most things, but the laptop does struggle with anything that’s pushing a lot of data around. Overall, I see the beachball a lot more than I ever do on my MacBook Pro.[footnote]I also installed El Capitan on this, so performance has dropped a little as I’d expect with with a beta OS and working in a beta Xcode[/footnote]</p>\n\n<p>That said, I run Xcode, I compile apps, and for the smaller applications I’m working on, it’s fine.</p>\n\n<p>On the other hand, for writing blog posts, emails, and that sort of thing… this thing is PERFECT. I love it so much that I reach for it now when I want to sit down to write. The small screen minimizes the temptation to have distractions visible, and the retina screen makes reading type easy on the eyes.</p>\n\n<h2>Should you get it?</h2>\n\n<p>Depends. If you prioritize weight over performance, this is perfect. In any other scenario, the MacBook Air or the 13” MacBook Pro is a better choice.</p>\n\n<p>For the developers, this cannot be a primary development laptop, but you can get away with Xcode or Atom or the like running with little trouble. Expect build times to be a lot longer than whatever you’re used to.</p>\n\n<p>Bottom line: I love it, glad I took a chance on it.</p>\n",
				"date_published": "2015-06-26T12:36:42-05:00",
				"url": "https://fatmixx.com/2015/06/26/on-the-new.html",
				"tags": ["export","Product Reviews","Review"]
			},
			{
				"id": "http://sujal.micro.blog/2015/06/23/some-observations-on.html",
				"title": "Some Observations on the Mobile Market in India",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>Living in India has given me a new perspective on a lot of things. Professionally, I’m constantly learning a lot just by seeing how differently people use their phones, and how different the market and ecosystem around mobile is here.</p>\n\n<h2>Intex? Karbonn? Spice Mobile? Oppo?</h2>\n\n<p>The biggest eye opener has been seeing the number of India-focused brands here in the smartphone market.</p>\n\n<p>In the US, there are global brands like Apple, Samsung, HTC, Motorola, and LG and then a spread of other smaller brands. Here’s <a href=\"https://www.idc.com/getdoc.jsp?containerId=prIN25448315\">IDC’s list of the top smartphone vendors in India last year</a>:</p>\n\n<ol>\n<li>Samsung</li>\n<li><a href=\"http://www.micromaxinfo.com\">Micromax</a></li>\n<li><a href=\"http://www.intex.in\">Intex</a></li>\n<li><a href=\"http://www.lavamobiles.com\">Lava</a></li>\n<li><a href=\"http://www.mi.com/in/\">Xiaomi</a></li>\n</ol>\n\n<p>The market is also full of up &amp; comers like <a href=\"http://www.spicesmartphones.com\">Spice Mobile</a>, and <a href=\"http://karbonnmobiles.com\">Karbonn</a>, &amp; other Chinese manufacturers like <a href=\"http://www.oppo.com/in/\">Oppo</a> among many others I probably haven’t heard of.</p>\n\n<p>Windows Phone is still a factor here, and I do still see Blackberrys from time-to-time, though they don’t rank in any public market reports I can see.</p>\n\n<p>And feature phones - J2ME, basic phones… still big in India, too.</p>\n\n<h2>I’m Developing Android First</h2>\n\n<p>Most of the smartphones sold in India run Android. Android has a <a href=\"http://timesofindia.indiatimes.com/tech/tech-news/Androids-market-share-in-India-over-90-IDC/articleshow/22793647.cms\">90+% market share</a> in India. Nothing else really is worth talking about, when you’re talking about smartphones.</p>\n\n<p>So, while I personally am a dedicated iOS user, professionally in India, our teams think Android first. This is not the case for our US development teams, where both platforms have roughly equal priority and resources.</p>\n\n<p>In the U.S., <a href=\"http://avc.com/2010/10/android/\">Fred Wilson’s 2010 call for Android first</a> was bad advice then (and probably still is now), but the realities of emerging markets like India means doing exactly that. It’s literally the only game in town that matters.</p>\n\n<h2>Price is King, But Technology Matters</h2>\n\n<p>India is a price sensitive market. Obvious, right? But what I’ve found living here and talking to coworkers is that it isn’t just price that matters, but affordable <em>value</em>. From Ben Thompson’s excellent blog, Stratechery, talking about Xiaomi’s (and others’) <a href=\"https://stratechery.com/2015/end-trickle-tech/\">rapidly growing customer base</a> in India &amp; China:</p>\n\n<blockquote>\n  <p>These customers are not conservative, or even pragmatists: they are enthusiasts and visionaries who simply don’t have very much money. The proper way to reach them, then, is not to sell them trickle-down technology: they will see right through that, and dismiss it out of hand. Rather, the solution to is develop new business models – indeed, in the case of Xiaomi, a new company – that is built from the ground-up to serve their specific needs.</p>\n  \n  <p>This, too, is a powerful opportunity: there are far, far more potential customers in developing countries than there are in developed ones, but just because they don’t have much money does not mean they are technological laggards. Indeed, many of these customers are even more advanced when it comes to being mobile first because of the lack of a PC legacy, and they will embrace a brand that lets them live on the cutting edge.</p>\n</blockquote>\n\n<p>Specs and feature bullets are still huge here, and not just because so many people in India work in the technology sector.</p>\n\n<h2>Android is Different Here</h2>\n\n<p>That central point, that people want tech but simply can’t afford the flagship devices, means that manufacturers need to find creative ways to manage cost while still offering an overall solid device. This creates subtle differences in user experience that go beyond the speed or feel of the device.</p>\n\n<p>For example, Rs. 10,000 (<a href=\"https://www.google.com/search?q=10000+rupees+in+dollars\">~$160</a>) is a common marketing cutoff for “inexpensive” smartphones (all phones are sold unlocked and contract free here).[footnote]Contrast that to a flagship <a href=\"http://www.amazon.in/Samsung-Galaxy-Edge-Black-32GB/dp/B00UTGZD52/ref=sr_1_2?ie=UTF8&amp;qid=1435081437&amp;sr=8-2&amp;keywords=Galaxy+S6\">Samsung Galaxy S6 Edge</a>, which runs for about Rs. 53,000 (~$833), or an 64GB iPhone 6 which runs around Rs. 56,000 (~$880), though on sale at Amazon for Rs. 43,499 (~$684.49) right now.[/footnote]</p>\n\n<p>So, I decided to pick up a <a href=\"http://www.micromaxinfo.com/mobiles/smartphones/canvas/Canvas-A1-AQ4501\">Micromax Canvas A1</a>, which cost me about Rs. 4800 (~$75) fully unlocked, got a SIM for it, and have been using it as my ‘free time’ phone when I don’t need work email or iMessage.</p>\n\n<p>It’s not a bad device - performance is fine - and because it’s an <a href=\"https://www.android.com/one/india/\">Android One</a> device, it runs the latest version of Android. It does have some limitations that impact how we need to develop apps.</p>\n\n<p>First, it’s a 3G phone - no LTE or HSPA+ etc. Even though LTE is coming online here in the cities, the state of the networks, plagued by inconsistent coverage, make this a less significant limitation. App developers already need to think about bandwidth as a precious resource. I’m used to seeing my iPhone on 2G/Edge networks regularly, and I’m not alone judging from our user reports.</p>\n\n<p>The bigger surprise was the limited internal storage. I always found Android fans’ focus on SD card slots odd, but now that I’m running a phone with just 2 Gigs of internal flash memory, I suddenly understand. I went to download an app yesterday and got an error that I was out of space. And all I had on the phone were about 10 reasonably sized apps (the biggest was Facebook, at 150 MB(!). Android does let you move apps and some data to the SD card, so moving apps (when you can[footnote]So, I have an SD card installed, but not all apps allow themselves to be moved to the card (it’s a developer choice to allow this). Why wouldn’t apps allow this? Because moving to the SD card disables things like the app’s <a href=\"https://developer.android.com/guide/topics/appwidgets/index.html\">widgets</a>. So… you need to focus on app distribution size, then you have to think about the user experience when the app is on the SD card, and parts of your app just stop working. Bottom line: not convinced SD cards are that useful, and rumor has it that Google is moving away from them anyway…[/footnote]) is the only way to continue installing new apps without deleting other apps.</p>\n\n<p>There are even more subtle issues, some of which are detailed in this <a href=\"http://www.nextbigwhat.com/dalda-app-barrier-297/\">blog post at NextBigWhat</a>. It’s a good summary of some of the challenges if you want to target the broadest swath of Indian mobile users.</p>\n\n<p>Of course, you do get what you pay for. While things like Twitter and Facebook run fine, the screen isn’t as nice as the flagship phones. My main gripe, though? The horribly inferior camera.</p>\n\n<p>Photo taken on my Canvas A1:</p>\n\n<p><a href=\"https://www.flickr.com/photos/sujal/19065141976\" title=\"Canvas A1 Sidewalk Shot by Sujal Shah, on Flickr\"><img src=\"https://c1.staticflickr.com/1/288/19065141976_69baa0c657_n.jpg\" width=\"320\" height=\"240\" alt=\"Canvas A1 Sidewalk Shot\" class=\"aligncenter\"></a></p>\n\n<p>Photo taken on my iPhone 6:</p>\n\n<p><a href=\"https://www.flickr.com/photos/sujal/18905206029\" title=\"iPhone 6 Sidewalk Shot by Sujal Shah, on Flickr\"><img src=\"https://c1.staticflickr.com/1/306/18905206029_7bccd46b53_n.jpg\" width=\"320\" height=\"240\" alt=\"iPhone 6 Sidewalk Shot\" class=\"aligncenter\"></a></p>\n\n<p>No contest, IMHO.</p>\n\n<p>I’m still learning a lot about India, and writing software for Indians (and the world outside the U.S. more broadly - Cricket, rugby, &amp; F1 are global sports). We’re getting close to a few new releases at work, so I’m sure I’ll have more to learn and share soon. And there's still other things - missed call marketing, the SMS market in India [footnote]Every company seems to send free text messages for everything. Seriously.[/footnote], and so much more.</p>\n",
				"date_published": "2015-06-23T13:15:13-05:00",
				"url": "https://fatmixx.com/2015/06/23/some-observations-on.html",
				"tags": ["export","Android","Programming","Technology News","iOS","india","mobile"]
			},
			{
				"id": "http://sujal.micro.blog/2015/06/10/ok-im-convinced.html",
				"title": "OK, I'm convinced... Must have headphones for heavy travelers",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>I can't believe I'm recommending this, being a Bose-hater for most of my adult life, but the <a href=\"http://www.amazon.com/gp/product/B00M1NEUKK/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B00M1NEUKK&amp;linkCode=as2&amp;tag=fatmixx0fc-20&amp;linkId=NSUVA34ZUCAA2AVZ\">Bose QuietComfort 25 Headphones</a> are now my favorite travel accessory. Overpriced, yes. Average-ish sound quality, sure. But the noise canceling is uncanny. Flip the switch and the silence is surprising. Unlike most other noise canceling headphones I've tried, these don't give me a headache. I've used them on a few long haul flights at this point (17-20 hours in the air each trip) and they're comfortable enough that I sleep with them on.</p>\n\n<p>The Sony noise canceling headphones I used to own would give me a headache on a cross country flight. They were so annoying (and others I tried so poor at canceling noise), that I switched entirely to passive noise cancelation, using IEMs that just blocked sound.</p>\n\n<p>That worked well enough, but on these long flights, enough noise gets through that my music needs to be loud enough that the music ends up giving me a headache after 5-6 hours in the air.</p>\n\n<p>So, consider me a convert. If you have to fly as much as I have had to recently, these are worth the investment.</p>\n\n<p>They work really well in the office, too. I'll still use my <a href=\"http://www.amazon.com/gp/product/B00AFUE7S6/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B00AFUE7S6&amp;linkCode=as2&amp;tag=fatmixx0fc-20&amp;linkId=HKQ6IMA4DYHUKOWU\">PSB M4U 1</a> there, because the sound quality is better and I have an office with a door. :)</p>\n",
				"date_published": "2015-06-10T13:45:33-05:00",
				"url": "https://fatmixx.com/2015/06/10/ok-im-convinced.html",
				"tags": ["export","Product Reviews"]
			},
			{
				"id": "http://sujal.micro.blog/2015/04/21/moov-fitness-coaching.html",
				"title": "Moov: Fitness coaching, not just tracking",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p><a href=\"http://www.amazon.com/gp/product/B00MV96GO2/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B00MV96GO2&amp;linkCode=as2&amp;tag=fatmixx0fc-20&amp;linkId=TS23OS76MBABVJ7O\"><img src=\"https://sujal.micro.blog/uploads/2024/c394af4e1e.jpg\" alt=\"41WGe2Sns+L._SL250_\" width=\"150\" height=\"150\" class=\"alignleft size-thumbnail wp-image-24580\"></a>We're flooded with fitness oriented wearable devices from the step/activity trackers like the <a href=\"http://fitbit.com\">Fitbit</a> and <a href=\"https://jawbone.com/up\">Up</a> to smartwatches like, of course, the <a href=\"http://www.apple.com/watch/health-and-fitness/\">Apple Watch</a>. Some phones even have dedicated <a href=\"http://en.wikipedia.org/wiki/Apple_M7\">activity tracking chips</a>.</p>\n\n<p>The sad reality, though, is that most of devices are basically the same. They do step tracking. A few add some extra dimensions of motion capture, or have some additional functionality like sleep tracking, or online tools for food tracking. They're all about quantifying your day and they're mostly passive companions. You may get a short vibration when you hit some goals, but that's kind of it.</p>\n\n<p>There are exceptions, and one of them is <a href=\"https://www.moov.cc\">Moov</a>. A few years back, I preordered it based on a tweet from a friend and one feature I hadn't seen before: it pairs with dedicated smartphone apps to provide live feedback during workouts.</p>\n\n<p>So far, they have dedicated apps for <a href=\"http://run.moov.cc\">Running/Walking</a>, for <a href=\"http://boxing.moov.cc\">Cardio Boxing</a>, <a href=\"http://swim.moov.cc\">Swimming</a>, and the trendy <a href=\"http://training.moov.cc\">7-minute workout</a> (with <a href=\"http://cycling.moov.cc\">Cycling</a> on the way).</p>\n\n<p>I've been using the Running app as I come back from my shin splints injury. As I run, the app provides feedback on my balance, stride frequency, and posture, making sure I'm landing without too much force or jarring of my leg. So far, the runs feel better on my legs when using the app, and it's been good about keeping me from running to fast or too aggressively (it talks to you to stay within a certain stride frequency). It's simple, but very useful.</p>\n\n<p>I also tried the 7-minute workout app for the first time today. The workout is based on the workout the NY Times covered in <a href=\"http://well.blogs.nytimes.com/2013/05/09/the-scientific-7-minute-workout/?_r=0\">The Scientific 7-minute workout</a>. It's not the exact same workout, instead using a simpler set of exercises with multiple reps. It did feel good this morning - the muscles I don't workout regularly were slightly sore, and the app's feedback and rep counter worked well.</p>\n\n<p>Every time I use this device, I'm impressed. I'm surprised it doesn't get more buzz, to be honest. It's way more useful than any other fitness tracker I've tried. Totally recommended.</p>\n",
				"date_published": "2015-04-21T10:48:32-05:00",
				"url": "https://fatmixx.com/2015/04/21/moov-fitness-coaching.html",
				"tags": ["export","Product Reviews","fitness trackers","moov"]
			},
			{
				"id": "http://sujal.micro.blog/2015/04/12/an-ipad-a.html",
				"title": "An iPad, a Mac, and a Twitch.tv",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>I found myself watching some players on <a href=\"http://twitch.tv\">Twitch.tv</a> this weekend playing <a href=\"http://www.vainglorygame.com\">Vainglory</a>. It's pretty much the only game I play these days and has been for months.</p>\n\n<p>This was the first time that I could remember actually watching Twitch streams naturally - not checking it out because it was in the news or whatever. I actually found it helpful to my gameplay, and it was mildly entertaining. Most of you are probably rolling your eyes now, but you can kind of think of this like watching the Golf Channel. If you're a golfer, you'll watch because it makes you better. If you're not a golfer, it's the most boring thing on your TV.</p>\n\n<p>That's a big part of Twitch - hanging out, learning from, and socializing with people who take a specific game (or gaming) as seriously as you do.</p>\n\n<p>What's interesting about Vainglory is that it's an iOS game. On Twitch, a big part of the experience is watching people play the game. So, they're streaming live from their iPad (usually with other video, e.g. a webcam looking at them) on screen too.</p>\n\n<p>So, the question is how people stream from the iPad. Today, I snuck in an hour here and there to try and get it setup.</p>\n\n<p>I was prepared to write a nice post with sample videos and screenshots of how I was able to successfully stream and record Vainglory from my iPad, but sadly none of the attempts were good enough to share.</p>\n\n<p>At this point, my conclusion is that streaming from an iPad using a Mac is frustrating and unnecessarily complicated. It involves installing a device driver from Github (to capture audio), running either an Airplay server or routing video through Quicktime, and installing a broadcasting app that's sparse on the on-boarding.</p>\n\n<p>I gather that the situation is lot better on the Windows side of the world, but I'm amazed that <a href=\"http://www.twitch.tv/year/2014\">Twitch is so popular</a> considering how barebones the streaming software options are. Even the Windows options, while better, look to involve a few steps.</p>\n\n<p>I'm surprised Twitch doesn't invest directly in the stream creation experience. They do get Twitch support embedded directly in specific games - that seems to be their avenue of choice - but those integrations tend to be very specific to each game and lack the features that make the good Twitch streams interesting (PIP, the ability for player voiceovers, etc).</p>\n\n<p>On the upside, I learned that Quicktime Player can record video (including sound) off of an iOS device with nothing more than the lightning cable that comes with the device. That's going to come in handy.</p>\n",
				"date_published": "2015-04-12T12:54:05-05:00",
				"url": "https://fatmixx.com/2015/04/12/an-ipad-a.html",
				"tags": ["export","Review","gaming","twitch.tv","vainglory"]
			},
			{
				"id": "http://sujal.micro.blog/2015/01/04/practicing-rc-flying.html",
				"title": "Practicing RC flying with a simulator",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>One of my recent obsessions has been RC flying. So far, I've played with relatively cheap quadcopters and helicopters, but I've managed to crash every single one enough times to end up with a pile of damaged copters. So, I basically gave up on the hobby thinking I didn't have the time (or budget) to really get into it. I felt like I either needed to spend to get an advanced quadcopter that auto-leveled and could correct for novice piloting, or really dedicate more time than I had to do the fly, crash, repair, charge cycle required to practice.</p>\n\n<p>Recently, though, I discovered the world of foam board RC planes. These are planes built from cheap - like under $5 cheap - foam board using either custom plans or downloaded plans over the internet. Pre-made kits for the body of the planes can be found from places like <a href=\"http://flitetest.com\">Flite Test</a> for under $40. These kits contain pre-cut or pre-scored foam board and the hardware required to connect to your electronics and servos. Flite Test has a great series of 'swappable' designs that make it easy to share batteries and electronics between several planes.</p>\n\n<p>I found out about this via one of Flite Test's videos <a href=\"https://www.youtube.com/watch?v=Ww91mSkQWNc\">featuring planes modeled after characters from Planes: Fire &amp; Rescue</a>, which happens to be my son's current movie obsession. The models are amazing, and when they mentioned foam board, I had to see what it would take to build one with my son.</p>\n\n<p>As I was trying to figure out if I could build one of these with my son, I discovered that I can now buy hardware that lets me practice RC flying using a flight simulator with a real RC transmitter. So, I could actually practice flying without all the crash, repair, charge steps in between flights.</p>\n\n<p>I finally snuck in an hour to set this up at home and the results were awesome:</p>\n\n<script type=\"text/javascript\">\n  function resizeIframe(iframe) {\n    iframe.height = (iframe.offsetWidth / 1.779359431) + \"px\";\n  }\n</script>\n\n<iframe onload=\"resizeIframe(this);\" class=\"aligncenter\" style=\"text-align: center;\" src=\"//player.vimeo.com/video/115842027\" width=\"100%\" height=\"281\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe>\n\n<p><a href=\"http://vimeo.com/115842027\">Aerofly RC 7 10th flight</a> from <a href=\"http://vimeo.com/sujal\">sujal shah</a> on <a href=\"https://vimeo.com\">Vimeo</a>.</p>\n\n<p>It's hard to tell from the video, but I'm flying a simple RC plane in the simulator using a transmitter wirelessly. The sim is focused on RC flying, which is a little different than a typical flight simulator. The big difference is that the sim simulates operating the plane from the ground, not from inside the cockpit. This lets me practice the hardest aspect of this for me, which is maintaining an understanding of the spatial orientation of the plane and my controls. In other words, when the plane is flying toward me, I need to remember that pushing right on the stick will make the plane turn toward my left (because it's facing me). That's really hard for me, especially with my cheap quadcopters where identifying the \"front\" is tricky in flight.</p>\n\n<p><a href=\"https://www.flickr.com/photos/sujal/16165661956/\"><img src=\"https://farm8.staticflickr.com/7492/16165661956_b388b6c3eb_z.jpg\" width=\"640\" height=\"480\" class=\"aligncenter\"></a></p>\n\n<p>That's all the gear I needed to do this:</p>\n\n<ul>\n<li>my Macbook</li>\n<li>\n<a href=\"https://itunes.apple.com/us/app/aerofly-rc-7-r-c-flight-simulator/id794308605?mt=12&amp;uo=4&amp;at=11l9Wt\">Aerofly RC 7</a> - Available for Mac &amp; Windows (that's a Mac App Store link)</li>\n<li>\n<a href=\"http://www.amazon.com/gp/product/B00JMP53Z6/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B00JMP53Z6&amp;linkCode=as2&amp;tag=fatmixx0fc-20&amp;linkId=JYOVJTOFZ2VGECOA\">Ikarus USB-Interface adapter for aeroflyRC7</a><img src=\"//ir-na.amazon-adsystem.com/e/ir?t=fatmixx0fc-20&amp;l=as2&amp;o=1&amp;a=B00JMP53Z6\" width=\"1\" height=\"1\" border=\"0\" alt=\"\" style=\"border:none !important; margin:0px !important;\">\n</li>\n<li>\n<a href=\"http://www.amazon.com/gp/product/B00DRAM38M/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B00DRAM38M&amp;linkCode=as2&amp;tag=fatmixx0fc-20&amp;linkId=6QSMUX6HKE4YSAEC\">Single Line Converter for aeroflyRC7</a><img src=\"//ir-na.amazon-adsystem.com/e/ir?t=fatmixx0fc-20&amp;l=as2&amp;o=1&amp;a=B00DRAM38M\" width=\"1\" height=\"1\" border=\"0\" alt=\"\" style=\"border:none !important; margin:0px !important;\">\n</li>\n<li>A transmitter (mine is a <a href=\"http://www.amazon.com/gp/product/B00K1P3KYW/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B00K1P3KYW&amp;linkCode=as2&amp;tag=fatmixx0fc-20&amp;linkId=T36GICYPWGLTV2GK\">Spektrum DX6i</a><img src=\"//ir-na.amazon-adsystem.com/e/ir?t=fatmixx0fc-20&amp;l=as2&amp;o=1&amp;a=B00K1P3KYW\" width=\"1\" height=\"1\" border=\"0\" alt=\"\" style=\"border:none !important; margin:0px !important;\">)</li>\n<li>A receiver (mine is a <a href=\"http://www.amazon.com/gp/product/B00HZSD8UO/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B00HZSD8UO&amp;linkCode=as2&amp;tag=fatmixx0fc-20&amp;linkId=V25B236XWEHTENGR\">OrangeRx R615X</a><img src=\"//ir-na.amazon-adsystem.com/e/ir?t=fatmixx0fc-20&amp;l=as2&amp;o=1&amp;a=B00HZSD8UO\" width=\"1\" height=\"1\" border=\"0\" alt=\"\" style=\"border:none !important; margin:0px !important;\"> - just make sure it's compatible with your transmitter)</li>\n</ul>\n\n<p>The connection process is pretty simple. Make sure the receiver is paired to your transmitter before you start connecting everything up. Then, the basic wiring pattern is the Single Line Converter (SLC) connects the receiver to the USB adapter on the computer side. Just connect channels 1-6 on the SLC (or as many channels as your equipment has) to the same channel output on the receiver using the included cables. The slot labeled S on the SLC should be connected to the USB adapter. Then just plug the USB adapter into the computer and fire up Aerofly. It will detect the USB connection and walk you through the setup process. It was pretty painless, though I recommend reading the instructions that come with the Ikarus stuff (for example, pay attention to connect + pin to + pin, - pin to - pin, etc. between the SLC and the receiver - the instructions contain the diagrams you need to make sure this is done right).</p>\n\n<p>There were some gotchas in my particular setup: the Orange receiver doesn't label the pins by channel number, but they <a href=\"http://www.hobbyking.com/hobbyking/store/uploads/274862609X1451549X36.txt\">turned out to be in order</a>. Next, the Spektrum's channel 6 isn't in use by default. Aerofly likes all the channels to be calibrated, so I had to figure out how to enable that channel on my transmitter so I could finish the calibration without a warning message (it is a harmless error, but I was being picky).</p>\n\n<p>Once that was done, I was able to get a plane up in the air, which I promptly crashed. I was thrilled, though, and am now just trying to do a simple racetrack around the airfield and then land. So far, I haven't succeeded. :)</p>\n",
				"date_published": "2015-01-04T00:47:14-05:00",
				"url": "https://fatmixx.com/2015/01/04/practicing-rc-flying.html",
				"tags": ["export","Product Reviews","Review","Me Me Me","aerofly","flitetest","rc airplanes"]
			},
			{
				"id": "http://sujal.micro.blog/2014/12/08/my-favorite-iphone.html",
				"title": "My favorite iPhone case",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<pre><code>    Truth be told, it’s still not perfectly square, which I only noticed when taking the pictures. OCD sufferers, take note. :)&lt;a href=&quot;#fnref:20141208-1&quot; title=&quot;return to article&quot;&gt; ↩&lt;/a&gt;\n\n&lt;/li&gt;\n</code></pre>\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>For the last two years, I didn’t use a case for my iPhone. I really love the look of the 5 &amp; 5S, and didn’t want anything to cover it up. Of course, by the end of the year, the screens had dozens of fine (and one or two not-so-fine) scratches. Really annoying.</p>\n\n<p>So, for the iPhone 6, I decided I’d keep an eye out for a case that I could live with. A few weeks ago, I ran across an ad for the <a href=\"http://www.amazon.com/gp/product/B00P9UAHXG/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B00P9UAHXG&amp;linkCode=as2&amp;tag=fatmixx00-20&amp;linkId=CF5VEAECSBFORCZI\">Twelve South SurfacePad</a><img src=\"https://ir-na.amazon-adsystem.com/e/ir?t=fatmixx00-20&amp;l=as2&amp;o=1&amp;a=B00P9UAHXG\" width=\"1\" height=\"1\" border=\"0\" alt=\"\" style=\"border:none !important; margin:0px !important;\"> (Amazon link). It looked perfect: a minimalist case that looks great and could help simplify my wallet (a separate mission I’m focused on before our move to India).</p>\n\n<p>I bought and received the case last week directly from <a href=\"https://www.twelvesouth.com/product/surfacepad-iphone6\">Twelve South</a>. So far, it’s been great. I’ve included a few photos below. It’s easily the best case I’ve seen for the iPhone 6.</p>\n\n<p>The case attaches to the back of the iPhone using a special adhesive that can be reattached multiple times. It took a few tries to get it attached squarely.<sup id=\"fnref:20141208-1\"><a href=\"#fn:20141208-1\" rel=\"footnote\">1</a></sup> It feels secure.</p>\n\n<p>I love having my license and primary credit card with the phone. I can basically lock my wallet up when I’m traveling, and I rarely need to pull it out otherwise.</p>\n\n<p>It also looks great, and it seems like the leather is breaking in as Twelve South indicates in the booklet they include with the case.</p>\n\n<p>There are two drawbacks with this case. First, the cover can be awkward in two situations. When taking photos, the cover needs to dangle or get folded in the stand mode so that it doesn’t block the lens. When trying to use the phone one handed or as a phone, the case needs to be flipped around to the back (think of the smart cover on the iPad), which makes me slightly nervous about having the cards exposed. They are quite snug in their slots, but as the leather softens, I worry about the slots loosening up. Hopefully the cards will stay securely in their slots.</p>\n\n<p>The second drawback has to do with combining a wallet with the phone. This weekend, for example, I had to use my card outside at a parking kiosk. It was raining, so getting to my primary credit card meant pulling my phone out and exposing it to the elements. Manageable, but not ideal.</p>\n\n<p>Those are both tradeoffs I can live with, though. I really love this case. It looks gorgeous and functions well for me. Recommended.</p>\n\n<p>I included some photos below of the case on my iPhone 6. (photos taken with a Google Nexus 6).</p>\n\n<p>[caption width=\"320\" align=\"aligncenter\"]<a href=\"https://www.flickr.com/photos/sujal/15793889119\" title=\"New iPhone case: SurfacePad for iPhone 6 by Sujal Shah, on Flickr\"><img src=\"https://farm8.staticflickr.com/7575/15793889119_913cd68e1b_z.jpg\" width=\"320\" height=\"240\" alt=\"New iPhone case: SurfacePad for iPhone 6\"></a> Front of the SurfacePad[/caption]</p>\n\n<p>[caption width=\"320\" align=\"aligncenter\"]<a href=\"https://www.flickr.com/photos/sujal/15360277473\" title=\"New iPhone case: SurfacePad for iPhone 6 by Sujal Shah, on Flickr\"><img src=\"https://farm8.staticflickr.com/7543/15360277473_52f49aab99_z.jpg\" width=\"640\" height=\"480\" alt=\"New iPhone case: SurfacePad for iPhone 6\"></a> Back of the SurfacePad[/caption]</p>\n\n<p>[caption width=\"320\" align=\"aligncenter\"]<a href=\"https://www.flickr.com/photos/sujal/15979892145\" title=\"New iPhone case: SurfacePad for iPhone 6 by Sujal Shah, on Flickr\"><img src=\"https://farm9.staticflickr.com/8572/15979892145_0ef98cbd62_z.jpg\" width=\"640\" height=\"480\" alt=\"New iPhone case: SurfacePad for iPhone 6\"></a> Inside of the SurfacePad[/caption]</p>\n\n<hr>\n\n<div class=\"footnotes\" markdown=\"20141208-1\"><ol>\n    <li class=\"footnote\" id=\"fn:20141208-1\">\n\n        Truth be told, it’s still not perfectly square, which I only noticed when taking the pictures. OCD sufferers, take note. :)<a href=\"#fnref:20141208-1\" title=\"return to article\"> ↩</a>\n\n    </li>\n</ol></div>\n",
				"date_published": "2014-12-08T22:00:14-05:00",
				"url": "https://fatmixx.com/2014/12/08/my-favorite-iphone.html",
				"tags": ["export","Product Reviews","Review"]
			},
			{
				"id": "http://sujal.micro.blog/2013/08/02/yeah-i-got.html",
				"title": "Yeah, I got nothing",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<p>Compare it to, say, Inman Square in Cambridge, Mass.: It would not do in BBS to have buses passing right through and stopping right in front of the Cheesecake Factory, if those buses ran a route that included, say, the local district court and jail, and nearby housing projects. Nor would it do to have upscale boutiques interspersed with dollar stores and appliance repair stores and bodegas, the way you might see in a secondary commercial center in Brooklyn, like 5th Avenue in Sunset Park, or even on Manhattan’s Upper East Side.</p>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p><em>(Note: This will likely only be of interest to my local friends and social network buddies. It's a response to <a href=\"http://invisiblesystems.tumblr.com/post/57068807925/concerning-the-suburbs-their-raison-detre-and-how-it\">Concerning The Suburbs, Their Raison D’etre, And How It Is Reflected In Their Planned Public Spaces</a>, prompted by a discussion on Twitter earlier today. If you're curious, or want the context, go read that first.</em></p>\n\n<p><em>So, I've been staring at that essay for a good 30 minutes trying to figure out what my thesis is here. So far, I got nothing. I'm struggling because there are two separate arguments being made, intertwined in ways that make them difficult to separate. Here goes my attempt to understand, then respond.)</em></p>\n\n<p>My impression walking away from the conversation this morning was that Josh had set an unattainable standard by which to evaluate the impact of Blue Back Square on the town of West Hartford. The essay reinforces that impression.</p>\n\n<p>In particular, this rankles:</p>\n\n<blockquote>\n\nCompare it to, say, Inman Square in Cambridge, Mass.: It would not do in BBS to have buses passing right through and stopping right in front of the Cheesecake Factory, if those buses ran a route that included, say, the local district court and jail, and nearby housing projects. Nor would it do to have upscale boutiques interspersed with dollar stores and appliance repair stores and bodegas, the way you might see in a secondary commercial center in Brooklyn, like 5th Avenue in Sunset Park, or even on Manhattan’s Upper East Side.\n\n</blockquote>\n\n<p>I'd quibble on the details here. I consider Blue Back to be part of West Hartford's town center. In that scope, most of the objections of how Blue Back fosters economic exclusivity fall apart. Major bus lines run right through WH center and they go right into Hartford, past the court, even - take the 60-66. It's not like that bus stop is prohibitively far, it's two mini blocks east of BBS.</p>\n\n<p>Businesses are not corner bodegas, but they're mid-tier chains &amp; indy businesses at the low end: CVS, Harry's Pizza, Cosi, Gyro Palace, Moe's, Subway, Ben &amp; Jerry's, etc. Sure, there are more upscale places, but there's more variety than you're allowing for.</p>\n\n<p>But this is all debating the details.</p>\n\n<p>If you're arguing Blue Back could have a more economically diverse customer and visitor base, I don't disagree with that. But I also think it's hard to argue that it hasn't brought in more economic diversity and created more unpredictable interaction than what was there before it. In that light, and measured against any development project in the state, I think it's done a net positive for the area and for the town on the diversity front.</p>\n\n<p>Held up to the ideal of something like Inman Square or Brooklyn, the products of organic and <a href=\"http://en.wikipedia.org/wiki/Inman_Square#1700s_and_1800s\">centuries long</a> growth of two major American cities and their environs... well, sure, it's not going to measure up in terms of economic diversity and retail/residential integration. But what does?</p>\n\n<p>It would help to have an example of a development plan or project that provided the kind of new urbanism or whatever you're calling this that you're describing. I don't know of any, especially any that have done a better job than BBS that didn't already start in already dense construction.</p>\n\n<p>And it would be nice to talk about what urban means, and what counts as \"authentic urban\" -- I don't agree with the narrow definition because I don't think it's historically valid (I also am not well educated on this topic to make the argument here... so, worthy of a conversation, I think, perhaps with others).</p>\n",
				"date_published": "2013-08-02T00:16:44-05:00",
				"url": "https://fatmixx.com/2013/08/02/yeah-i-got.html",
				"tags": ["export","Connecticut","West Hartford"]
			},
			{
				"id": "http://sujal.micro.blog/2013/06/18/why-we-stopped.html",
				"title": "Why we stopped using Trello, even though we love it",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>I tweeted this earlier …</p>\n\n<blockquote class=\"twitter-tweet\">\n<p>we’ve stopped using <a href=\"https://twitter.com/trello\">@trello</a> at <a href=\"https://twitter.com/fanzter\">@fanzter</a>, but I still love the product. The new board view looks great: <a href=\"http://t.co/fhvRuFN87X\">http://t.co/fhvRuFN87X</a> <a href=\"https://twitter.com/search?q=%23fb&amp;src=hash\">#fb</a></p>— Sujal Shah (@sujal) <a href=\"https://twitter.com/sujal/statuses/347005026255904768\">June 18, 2013</a>\n</blockquote>\n\n<script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p>… which prompted a few people to ask, \"Why'd you stop using <a href=\"http://trello.com\">Trello</a>?\"</p>\n\n<p>The answer is pretty specific to us and our particular organizational inertia (such as it is for a small company like us), but here it is:</p>\n\n<p>We liked Trello a lot, but we ended up switching to use Github issues. While it's somewhat inferior to Trello, it had two features that made it compelling.</p>\n\n<ol>\n<li><p>We use Github for source control, and Trello really doesn't integrate with that workflow at all. For example, we can manage Github issues from our commit messages, reference them, and comment on them in a place we already have to look.</p></li>\n<li><p>We use <a href=\"http://campfirenow.com\">Campfire</a>, and Trello didn't have any integration with it. We could've built that, but Github already has it, and so laziness won the day.</p></li>\n</ol>\n\n<p>In truth, Github issues is pretty nice, too, so it's not like we're giving up that much.</p>\n\n<p>I did like Trello's visibility and the visual metaphor. It also is a lovely app. The other great thing about it was that it was easy to throw it up on the screen and use during meetings. Github issues (or any bug tracker, really), is merely OK projected.</p>\n\n<p>Anyway, all of this might be moot now. Someone did the work we didn't want to do, and built a <a href=\"https://zapier.com/zapbook/github/trello/\">service that integrates Github &amp; Trello</a>. We may have to take a look at this. :)</p>\n",
				"date_published": "2013-06-18T10:23:04-05:00",
				"url": "https://fatmixx.com/2013/06/18/why-we-stopped.html",
				"tags": ["export","Programming","Fanzter Inc."]
			},
			{
				"id": "http://sujal.micro.blog/2013/01/29/i-was-on.html",
				"title": "I was on the radio",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>I was a guest on today's episode of Where We Live on WNPR. The topic was on <a href=\"http://www.yourpublicmedia.org/content/wnpr/connecticut-startup-culture\">Connecticut Startup Culture</a>. Give it a listen, and let the mocking commence (\"Check it out, it's awesome!\" <em>groan</em>).</p>\n\n<p>One thing we didn't get to on the show (and, let's be honest, there are probably a dozen conversations wrapped into this wax ball of a topic), was the demographic differences between CT and NYC or San Francisco. My sense is, and this is definitely anecdotal, that our mix of entrepreneurs in CT is probably a little older than the folks in those other cities. Probably doubly so in tech.</p>\n\n<p>Before the show, I joked to Gitamba that the prototypical ramen diet isn't really an option when you have a child at home. Accelerators like <a href=\"http://www.techstars.com\">TechStars</a> or <a href=\"http://ycombinator.com\">Y Combinator</a> target that frenetic pace and schedule. That makes sense for their programs, and there's nothing wrong with that, but it might not be the only or best model for areas still building up their entrepreneur base and culture.</p>\n\n<p>Anyway, just an extra thought on the way out the door of the station.</p>\n",
				"date_published": "2013-01-29T13:16:37-05:00",
				"url": "https://fatmixx.com/2013/01/29/i-was-on.html",
				"tags": ["export","Me Me Me","Connecticut","Fanzter Inc."]
			},
			{
				"id": "http://sujal.micro.blog/2013/01/01/sensors-leds-iphones.html",
				"title": "Sensors, LEDs \u0026 iPhones, oh my!",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>Over Christmas, I hacked together my first hardware/software project. It's been a long time since I've picked up a soldering iron, let alone built something worthy of sharing. It turned out to be a fun little project.</p>\n\n<h2>Cause, effect, agency</h2>\n\n<p>I got the idea to do a project over Christmas while looking for toys for my son for Christmas. I wanted to find something that would teach him simple cause and effect relationships where he could cause something (e.g. clicking red &amp; blue blocks together) that produced an observable effect (e.g. the blocks changing color to purple). I hoped that I could prime some interest in science. I also really wanted to instill a sense that he can make things happen for himself.</p>\n\n<p>For a two year old, I basically came up empty.</p>\n\n<p>But for a kid slightly older, we're living in a golden age of hackable creativity. We have 3D printers that are slowly becoming affordable. The Internet makes finding (and sharing!) instructions on building everything from <a href=\"http://www.ikeahackers.net\">customized furniture</a> to <a href=\"http://www.kickstarter.com/projects/openrov/openrov-the-open-source-underwater-robot\">undersea robots</a> easy. Open source and community based tools are getting cheaper and easier to use every year. Several businesses <a href=\"http://www.adafruit.com/blog/2012/12/18/adafruits-ladyada-limor-fried-named-entrepreneur-of-the-year-by-entrepreneur-magazine-entmagazine/\">have grown up</a> offering easy instructions and tutorials. (Come on, <a href=\"http://www.amazon.com/exec/obidos/ASIN/B00ADSHWQY/coolspotters-20\">these look cool</a>, don't they?)</p>\n\n<p>So, I decided I'd use the four-day Christmas long weekend to hack together a hardware prototype (with help from my wife's nephew).</p>\n\n<h2>The project</h2>\n\n<p>For the project, I set out to build a simple thermometer &amp; barometer that I could check from my iPhone. I also wanted it to have some visible indicator that would be fun to look at so my son could check it. As a beginner, I also wanted something I thought I could pull off.</p>\n\n<p>My project centered around an Arduino microcontroller board. An <a href=\"http://www.arduino.cc\">Arduino</a> is an inexpensive open source \"electronics prototyping platform\" that can be programmed using nearly any computer and a USB cable. Because it's cheap and freely documented, people have hooked up dozens (if not hundreds) of sensors &amp; other electronics to it.</p>\n\n<p>I had an old kit laying around that I rediscovered after I returned to <a href=\"http://fanzter.com\">Fanzter</a> and started working with our resident hardware hacker extraordinaire, <a href=\"http://unwin.org\">Josh</a>. I recommend starting with a starter kit if you're just getting into electronics projects. You can get several decent options from <a href=\"http://adafruit.com\">Adafruit</a>, <a href=\"http://makershed.com\">MakerSHED</a>, or <a href=\"http://sparkfun.com\">Sparkfun</a>. I have an older Sparkfun Inventor's Kit, but any from these three vendors will do.</p>\n\n<p>You should go through a few of the tutorials before trying the rest of this to get familiar with the basics of Arduino programming.</p>\n\n<p>Here's the full parts list:</p>\n\n<ul>\n<li>Arduino board (got mine from kit, an Arduino Uno R2)</li>\n<li>Breadboard (also from the kit)</li>\n<li>Breadboarding wires (from kit)</li>\n<li>Single LED (from kit, for debugging)</li>\n<li>Bosch BMP085 Barometric Pressure &amp; Temp sensor kit <a href=\"http://www.adafruit.com/products/391\">from Adafruit</a>\n</li>\n<li><a href=\"http://www.adafruit.com/products/902\">Adafruit 8x8 Bicolor LED Matrix kit</a></li>\n<li><a href=\"http://www.makershed.com/BTLE_Arduino_Shield_p/mkrbl1.htm\">RedBear Lab Bluetooth Low Energy (BLE) Shield</a></li>\n<li>A little bit of <a href=\"http://www.adafruit.com/products/145\">0.031\" solder</a>\n</li>\n</ul>\n\n<p>Tools:</p>\n\n<ul>\n<li>Soldering iron (I used a cheap <a href=\"http://www.radioshack.com/product/index.jsp?productId=2062728&amp;filterName=Brand&amp;filterValue=RadioShack\">Radio Shack model</a> for this build)</li>\n<li><a href=\"http://www.amazon.com/exec/obidos/ASIN/B000JNRQJ6/coolspotters-20\">Flush Diagonal Pliers</a></li>\n</ul>\n\n<p>In addition, if you want to get an app running on your iPhone, iPad, or iPod Touch, you'll need to have a developer account with Apple.</p>\n\n<p>The build out is really simple. The BLE shield snaps onto the Arduino board basically extending the pins and sockets on the Arduino through itself. Just make sure you line up all the pins and sockets. More details <a href=\"http://redbearlab.com/bleshield/\">at RedBearLab if you want them</a>.</p>\n\n<p>For the LED matrix and the temperature sensor, there's a little soldering involved. For both the soldering and the basic wiring setup, I followed the instructions in Adafruit's tutorials:</p>\n\n<ul>\n<li><a href=\"http://learn.adafruit.com/bmp085\">Tutorial for the BMP085 sensor</a></li>\n<li><a href=\"http://learn.adafruit.com/adafruit-led-backpack/bi-color-8x8-matrix\">Tutorial for the 8x8 LED Matrix</a></li>\n</ul>\n\n<p>Make sure you position the LED matrix correctly before soldering it. I got multiple warnings about that from people.</p>\n\n<p>Here are the results of my soldering job:</p>\n\n<div style=\"text-align: center; margin-bottom: 15px;\">\n  <a href=\"http://www.flickr.com/photos/sujal/8333891533/\" title=\"Arduino project images by sujal, on Flickr\"><img src=\"https://farm9.staticflickr.com/8072/8333891533_88fb100ec4_m.jpg\" width=\"240\" height=\"180\" alt=\"Arduino project images\"></a>\n</div>\n\n<p>I'll admit, I'm proud of how well that came out considering it was my first soldering project in 20 years.</p>\n\n<p><a href=\"http://www.flickr.com/photos/sujal/8333908145/\" title=\"Arduino project photo by sujal, on Flickr\" style=\"float: left; padding-right: 20px;\"><img src=\"https://sujal.micro.blog/uploads/2024/e3f06fc8f7.jpg\" width=\"150\" height=\"150\" alt=\"Arduino project photo\"></a> <a name=\"20130101-fnr1\">The only difference</a> in my final wiring from the two tutorials is that I hooked the matrix CLK and DAT pins to the same rows containing the CLK and DAT lines from the Arduino to the temperature sensor. In the picture at left, those are the green and orange wires (Click through for a larger view). This works because they both speak a protocol called <a href=\"http://en.wikipedia.org/wiki/I%C2%B2C\">I2C</a> and have different addresses. <a href=\"#20130101-fn1\">[1]</a></p>\n\n<p>For power and ground, I used the breadboard instead of hooking the sensor or backpack directly to the Arduino board. This is standard, and what the kit tutorials encourage. Just thought I should mention it, since it's not directly mentioned in the two Adafruit tutorials above.</p>\n\n<p>The next step is programming the Arduino. Rather than walk you through all the details, <a href=\"https://github.com/sujal/SimpleTempStation\">here's the source code</a>. Feel free to fork the project and mess around. I'd appreciate any bug fixes if you have them. To use the source code, you'll need to install the <a href=\"http://arduino.cc/en/Main/Software\">Arduino software</a> &amp; the <a href=\"http://inotool.org\">Ino tool</a>. I used Ino so that the github repository would have everything you need. To run the project, launch Terminal, then type <code>ino build</code> and then <code>ino upload</code> to get the project onto your Arduino. If you want to see the serial output, you can use <code>ino serial -b 57600</code> to get that on your terminal screen.</p>\n\n<p>I also have the <a href=\"https://github.com/sujal/WeatherHack\">iOS code available</a> if you'd like to play with that. You'll need to be comfortable with iOS development to use this. I may submit a version to the store if there's enough interest. Let me know.</p>\n\n<p>That's it. The finished wiring looks like this:</p>\n\n<div style=\"text-align: center; margin-bottom: 15px;\">\n  <a href=\"http://www.flickr.com/photos/sujal/8334950886/\" title=\"Arduino project images by sujal, on Flickr\"><img src=\"https://farm9.staticflickr.com/8076/8334950886_d69975ab0d_n.jpg\" width=\"320\" height=\"240\" alt=\"Arduino project images\"></a>\n</div>\n\n<p>When lit up, it looks something like this (only 2 readings are displayed - normally there are 8):</p>\n\n<div style=\"text-align: center; margin-bottom: 15px;\">\n  <a href=\"http://www.flickr.com/photos/sujal/8310090296/\" title=\"The arduino end of this, the simple temperature station. by sujal, on Flickr\"><img src=\"https://farm9.staticflickr.com/8497/8310090296_9ce19999c1_n.jpg\" width=\"320\" height=\"240\" alt=\"The arduino end of this, the simple temperature station.\"></a>\n</div>\n\n<p>The iOS app is really simple:</p>\n\n<div style=\"text-align: center; margin-bottom: 15px;\">\n  <a href=\"http://www.flickr.com/photos/sujal/8310060286/\" title=\"Weekend hack: arduino weather station talking to iOS app via BLE. Boom. by sujal, on Flickr\"><img src=\"https://farm9.staticflickr.com/8363/8310060286_1507dd4dbb_m.jpg\" width=\"135\" height=\"240\" alt=\"Weekend hack: arduino weather station talking to iOS app via BLE. Boom.\"></a>\n</div>\n\n<p>Drag up to trigger a connect or disconnect. Eventually, I'll add a pull down to trigger a temp refresh. Otherwise, it polls every minute.</p>\n\n<h2>Known issues</h2>\n\n<p>The code isn't perfect and, as I get free time, I'm still cleaning up a few things. Here are some known issues:</p>\n\n<ul>\n<li><p><strong>Bluetooth reliability</strong>: For some reason, the iPhone doesn't seem to disconnect and/or reconnect properly to the device. Pressing the reset button on the BLE shield usually fixes it, which makes me think there's something wrong in my code.</p></li>\n<li><p><strong>Memory usage</strong>: So, the main challenge programming an Arduino is that the device only has about 2K of RAM for the sketch. Yes, that's two kilobytes. It's a challenging environment when I'm used to phones that have 256-512MB RAM (or more). My code is definitely not particularly optimized. The program did run out of memory regularly. I think it's stable now, but it's not as good as I think I can get it.</p></li>\n</ul>\n\n<h2>Next steps</h2>\n\n<p>I'm going to try and hook it up to a <a href=\"http://www.raspberrypi.org\">Raspberry Pi</a> and put it in an weatherproof enclosure so I can leave it outside. My other goal is to change the LED Matrix to <a href=\"http://www.adafruit.com/products/306\">an LED strip like this</a> so I can make it look like an actual thermometer.</p>\n\n<p>I'll update this with photos if I get that far.</p>\n\n<p>Hope that helps someone out. It was a fun project, and I'm looking forward to working on this more.</p>\n\n<hr>\n\n<p><a name=\"20130101-fn1\"> </a></p>\n\n<p><a href=\"http://www.ikeahackers.net\">1</a> I2C is a simple two-wire interface to hardware components. I2C allows the Arduino to control multiple devices over just two pins. The Wikipedia page has the gory details, but just know that each device has an address which has to be unique, and then you just wire them up in parallel. The LED Matrix backpack that Adafruit provides provides an I2C interface to the LED matrix, and the Bosch sensor comes on a board that also speaks I2C, so all the work is basically done for you.</p>\n\n<p>That's more detail than you probably need, but I thought it was neat.<a href=\"#20130101-fnr1\">↩</a></p>\n\n<hr>\n\n<p><strong>Update</strong>: Two corrections above, both minor but notable. I accidentally described an Arduino as a microprocessor instead of microcontroller, but then Josh pointed out that it's really a whole platform because the microcontroller is the specific chip at the heart of the Arduino. It's a significant detail when you get more advanced because different versions of the Arduino might have different microcontrollers at the heart of the platform.</p>\n\n<p>The other is how I described the I2C wiring in the footnote. The sensor and the LED matrix are wired in parallel, not series. I had a feeling that was the wrong word, but forgot to look that up. Minor detail, but again significant for deeper understanding.</p>\n\n<p>Sorry about both of those. They're fixed above.</p>\n",
				"date_published": "2013-01-01T16:14:10-05:00",
				"url": "https://fatmixx.com/2013/01/01/sensors-leds-iphones.html",
				"tags": ["export","Programming","iOS"]
			},
			{
				"id": "http://sujal.micro.blog/2012/12/15/a-jumble-of.html",
				"title": "A jumble of thoughts",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>On a normal Friday of a normal December, a bunch of families said goodbye to their kids and sent them off to school. Announcements. Meetings for the Principal. A normal Friday.</p>\n\n<p>Then the abnormal sound of gunfire. Of violence. Of death.</p>\n\n<p>And now, the sound of tears, of sadness, of remembering and loss... of fears and nightmares past and future.</p>\n\n<hr>\n\n<p>I keep imagining what it must be like for the parents of the victims today, especially of the young children. I imagine myself in their shoes, I imagine walking by a now-always-empty room with bright paint evoking happier times.</p>\n\n<p>My thoughts are with the families affected by the tragedy.</p>\n\n<hr>\n\n<p>When I walk into my son's class, the kids say \"Hi Che's Dad!\" They make me smile no matter how crappy my morning has been. I keep thinking about what someone must go through to walk into a classroom full of children and open fire. Why would anyone want to hurt them?</p>\n\n<p>It's unfathomable. The loss is unfathomable. The chance and the randomness is most unfathomable of all.</p>\n\n<hr>\n\n<p>I wrote this earlier today re: discussing gun control policy on the day of a tragedy (slightly edited for grammar):</p>\n\n<blockquote>\n  <p>My only point is that today should be about the tragedy itself, to burn in the news and to cope with the loss &amp; fear of loss that these events bring up.</p>\n  \n  <p>We get wrapped up in hammering the stats, the policy ideas, and how \"stupid\" the other side is on this debates today, but the real work is how we keep this in the public eye going forward.</p>\n  \n  <p>I'm also seeing things like <a href=\"http://talkingpointsmemo.com/archives/2012/12/how_do_we_fix_this.php?ref=fpblg\">this at TPM</a> that ask good questions. This is the nitty gritty of how we help prevent these sorts of tragedies in the future. Even on the mental care front, how would those laws work?</p>\n  \n  <p>I'm just incredibly sad &amp; angry about this, and I'm not ready to have those conversations today. That's all I'm saying.</p>\n</blockquote>\n\n<p>The response I got from people on Twitter &amp; elsewhere primarily centered on getting people talking about the issues at play while attention is fully on the tragedy. They argue that tomorrow the pain will be a little less for those of us not directly affected. In a month the national media will forget about this completely.</p>\n\n<p>There's probably a lot of truth to that... the second, little tragedy that goes along with the big, evil tragedy that happened in Newtown.</p>\n\n<blockquote>\n  <p><em>\"Those who cannot remember the past are condemned to repeat it.\"</em></p>\n</blockquote>\n\n<p>So, it seems our job is to keep us from forgetting this bit of our past, to keep it squarely in focus during the next Congress and the next legislative session here in CT and beyond. Take a moment and ask yourself, \"What am I doing for the victims of Newtown?\"</p>\n\n<p>If you're upset about this, and want the government to do something about this, learn what you can about the issues at play. What ideas do people have for reducing gun violence? What should we ask our representatives in government to do? Is gun violence reduction about more than guns? Do we need to rethink mental health policies in this country?</p>\n\n<p>As you do learn about these things, contact your representatives in your state legislature, Congress, and anyone else you think is in a position to advocate for better policies. Tell them what you're learning, ask them to look into the best ideas you find.</p>\n\n<p>There's always a risk that bad laws get rushed through in the wake of tragedies. This one will be no different, so it's up to all of us to become smarter about the dynamics at play here and what public policy options people have considered. We need to do something. Let's make sure that something lives up to the memories of those lost today.</p>\n",
				"date_published": "2012-12-14T23:49:32-05:00",
				"url": "https://fatmixx.com/2012/12/15/a-jumble-of.html",
				"tags": ["export","Connecticut","In the News"]
			},
			{
				"id": "http://sujal.micro.blog/2012/07/12/we-need-context.html",
				"title": "We need context, not balance",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<p><!-- raw HTML omitted -->Fire, police overtime nears $3 million in 2010<!-- raw HTML omitted --></p>\n<p>The Town of West Hartford paid nearly $3 million in overtime compensation in 2010 to police and fire department personnel, according to data released under a Freedom of Information request.</p>\n<p>&hellip;</p>\n<p>Town administrators this year combed through expenses, trimming nearly $1 million from the original proposed budget before approving a 2012-13 spending plan. But in trying to cut, administrators lack the power to control specific items, such as overtime paid to union employees.</p>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>Like many towns, West Hartford has a advertising supported, free weekly paper that's mailed to everyone. The latest issue arrived today with this as <a href=\"http://westhartfordnews.com/articles/2012/07/12/news/doc4ffaf04904fcb085569769.txt\">the front page article</a>:</p>\n\n<blockquote>\n\n<span style=\"font-size: 1.25em; display: block; margin-bottom: 1.0em;\">Fire, police overtime nears $3 million in 2010</span>\n\nThe Town of West Hartford paid nearly $3 million in overtime compensation in 2010 to police and fire department personnel, according to data released under a Freedom of Information request.\n\n...\n\nTown administrators this year combed through expenses, trimming nearly $1 million from the original proposed budget before approving a 2012-13 spending plan. But in trying to cut, administrators lack the power to control specific items, such as overtime paid to union employees.\n\n</blockquote>\n\n<p>You should go read the article.</p>\n\n<p>Here's what stood out to me: the next several paragraphs (easily the first third of the article) includes quotes by the Republican members of our town council (the minority party) and other claims that collective bargaining is to blame for the OT in 2010.</p>\n\n<p>At first, I wondered why they didn't include any quotes by the Mayor or from Democrats on the council. Then I realized that I actually didn't really care about that. I don't really care about balance in that sense.</p>\n\n<p>What bugs me is that there's no context given to these numbers or information. For example, the reporter names particular police officers and firefighters who earned a significant amount of overtime. The reporter writes about how the Republican members of the council want to go after the contracts negotiated with the unions. They give particular salary numbers out.</p>\n\n<p>I read all of this and was left with... \"and so what?\" I don't know if this is a matter of lazy reporting or tight deadlines and a need to print something or an assumption by the writer that readers are already super informed, but as a pretty regular watcher of town news, I was left with a bunch of questions. I needed context in order to put the numbers in perspective and to understand some of the claims made in the article (both by people quoted as well as the author).</p>\n\n<p>Some questions I would love to see answered:</p>\n\n<ul>\n<li>What is a typical yearly budget for overtime expenditure?</li>\n<li>What is typical overtime budgeting for towns around the state with similar populations?</li>\n<li>Why did the cited officers get so much overtime pay? How many hours did they work? What was the purpose of those hours?</li>\n<li>What are some of these union rules that drive overtime costs? What union rules do the Republican members find objectionable?</li>\n</ul>\n\n<p>That's just a small list. These numbers sound big (\"$3 million in OT!\" - \"That police officer doubled his salary!\") but given some context, they may not be crazy. For example, if the officer is working double shifts most days to make up for staffing shortages, that may be reasonable compensation. If he does it every year, maybe there's a policy change required. How can we tell with the information provided?</p>\n\n<p>I want better reporting from our papers. People might be willing to pay for them if they actually dug a little deeper than a blogger with SEO skills...</p>\n",
				"date_published": "2012-07-12T21:39:19-05:00",
				"url": "https://fatmixx.com/2012/07/12/we-need-context.html",
				"tags": ["export","Connecticut","Politics","West Hartford","Journalism","taxes"]
			},
			{
				"id": "http://sujal.micro.blog/2012/05/12/proxigram-supports-facebook.html",
				"title": "Proxigram supports Facebook",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>You can now pull in photos from your Facebook account. Right now, it grabs everything, but I have controls in the works to let you choose privacy settings or hide individual photos.</p>\n\n<p>There's pseudo realtime support, too. Proxigram should update basically as soon as you upload the photo.</p>\n\n<p>As always, everything is <a href=\"https://github.com/sujal/proxigram\">on Github</a>.</p>\n",
				"date_published": "2012-05-12T21:12:33-05:00",
				"url": "https://fatmixx.com/2012/05/12/proxigram-supports-facebook.html",
				"tags": ["export","Programming","Forche Software","node.js","proxigram","facebook"]
			},
			{
				"id": "http://sujal.micro.blog/2012/05/10/proxigram-now-supports.html",
				"title": "Proxigram now supports Flickr",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>Quick update on Proxigram: it now supports <a href=\"http://flickr.com\">Flickr</a>, Yahoo's popular photo sharing service. If you're a Pro account holder, it will even get realtime updates from Flickr, just like Instagram provides.</p>\n\n<p>The \"point\" of the app has changed, too. The goal is to build a single API endpoint for all of your photos. While the photos will still be hosted on their respective services, you can now get one read-only API to see a normalized view of them all.</p>\n\n<p>The project is still open source, so if you're looking for a sample node app that connects multiple third party services via oAuth (using passport.js), you can <a href=\"https://github.com/sujal/proxigram\">get the source on Github</a>.</p>\n\n<p>Facebook support is coming next. If you want support for your favorite photo services, please let me know what you want or, if you have the ability, submit pull requests with patches.</p>\n\n<p>I've also written a few bits of supporting code for this. I abstracted out the basic PubSubHubbub verification calls into a standalone library: <a href=\"https://github.com/sujal/node-push-helper\">node-push-helper</a>.</p>\n\n<p>I also have stubbed out a new node Flickr client. I made a new one because I wanted to use oAuth instead of the deprecated Flickr authentication methods. After trying to retrofit one of the other libraries, I decided to just start over. I may merge this back into one of them, but for now, expect new functionality in the coming weeks. Here it is: <a href=\"https://github.com/sujal/node-flickr\">node-flickr</a>.</p>\n\n<p>Would love code reviews and criticism from node experts. I know the code can be better.</p>\n",
				"date_published": "2012-05-10T11:26:34-05:00",
				"url": "https://fatmixx.com/2012/05/10/proxigram-now-supports.html",
				"tags": ["export","Programming","Forche Software","node.js","flickr","instagram","passport.js","proxigram"]
			},
			{
				"id": "http://sujal.micro.blog/2012/04/28/proxigram-a-sprint.html",
				"title": "Proxigram - a sprint using Node.js, Express.js, \u0026 the Instagram API",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>I'm happy to share a little experiment I played with this week. I needed to take a look at Node.js &amp; it's family of technology for a project but found it hard to find good explanations of best practices, etc. There are a half-dozen competing boilerplate/template samples that have very little in the way of explanation or comments. So, I decided the best way to get familiar with the nitty gritty of building a Node/Express app was to write one.</p>\n\n<p>I decided to solve a simple problem I had. I wanted to get my recent photos from Instagram onto my blog. I wanted it to be a simple JS call or plugin, and I wanted it to be smart about storing keys for read-only access to my Instagram account. It seemed like a simple proxy for the Instagram API would suffice. The OAuth credentials are stored on the proxy and a new, non-Instagram specific key gets embedded in the JS.</p>\n\n<p>And thus, <a href=\"http://proxigram.com\">Proxigram</a> was born.</p>\n\n<p>Sure, it's a little contrived, but now that I've built it, I've got ideas for some improvements and, even better, I now have a functional, real app to share with everyone so I can get feedback about all the things I did poorly.</p>\n\n<p>The source code is all on Github, both for <a href=\"https://github.com/sujal/proxigram\">Proxigram itself</a> as well as the <a href=\"https://github.com/sujal/jquery-proxigram\">jQuery Proxigram library</a> to access it.</p>\n\n<p>The app is interesting to look at on a few levels. The package.json listing the bits and pieces I used is below. The app talks to the <a href=\"http://instagram.com/developer/\">Instagram API</a>, obviously uses MongoDB to cache results local to the app. It keeps that cache fresh by using <a href=\"http://instagram.com/developer/realtime/\">Instagram's real-time API</a> to get updates for users. It uses <a href=\"http://passportjs.org/\">passport.js</a> for authentication (though it seems like more of the cool kids are using <a href=\"https://github.com/bnoguchi/everyauth\">everyauth</a> these days). It uses less.js for the stylesheets.</p>\n\n<p>So, if you need a working example for all of those things, here you go.</p>\n\n<p>Please leave feedback about things that make you itch about <a href=\"https://github.com/sujal/proxigram\">the code</a>. I know a bunch of you are serious Node.js mavens, so I'm really curious what you folks think and what conventions you're following in your projects. My biggest question at this point is how to deal with making shared components available to code in different files. For example, I made some of the authentication filters global because I split my routes up into multiple \"controller-ish\" files. None of the boilerplate/template apps did it better, IMHO. If you have thoughts on that one, let me know.</p>\n\n<p>PS. The images on the right are getting served through Proxigram. :-)</p>\n\n<p>Here's the dependency list from my package.json:</p>\n\n<pre><code class=\"prettyprint linenums lang-js\">{\n    \"name\": \"proxigram\"\n  , \"version\": \"0.1.0\"\n  , \"private\": true\n  , \"dependencies\": {\n      \"express\": \"2.5.8\"\n    , \"less-middleware\": \"&gt;= 0.0.1\"\n    , \"jade\": \"&gt;= 0.0.1\"\n    , \"moment\": \"&gt;= 0.0.1\"\n    , \"passport\": \"&gt;= 0.1.8\"\n    , \"passport-instagram\": \"&gt;= 0.1.1\"\n    , \"passport-http-bearer\": \"&gt;= 0.1.2\"\n    , \"mongoose\": \"&gt;= 2.5.0\"\n    , \"connect\": \"&gt;= 0.0.1 &lt; 2\"\n    , \"connect-redis\": \"&gt;= 1.0.0\"\n    , \"connect-heroku-redis\": \"&gt;= 0.1.2\"\n    , \"airbrake\" : \"&gt;=0.2.0\"\n    , \"instagram-node-lib\": \"&gt;=0.0.7\"\n    , \"express-messages-bootstrap\": \"git://github.com/sujal/express-messages-bootstrap.git#bootstrap2.0\"\n  }\n  , \"engines\": {\n      \"node\": \"0.6.x\"\n    , \"npm\":  \"1.1.x\"\n  }\n}\n</code></pre>\n",
				"date_published": "2012-04-28T01:06:24-05:00",
				"url": "https://fatmixx.com/2012/04/28/proxigram-a-sprint.html",
				"tags": ["export","Programming","express.js","Forche Software","node.js"]
			},
			{
				"id": "http://sujal.micro.blog/2012/04/19/incentivizing-individual-relocation.html",
				"title": "Incentivizing individual relocation vs. corporate relocation",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p><a href=\"http://www.cpbn.org/program/where-we-live\">Where We Live</a> ran a show today on <a href=\"http://www.yourpublicmedia.org/node/19545\">why younger people (25-34) are leaving the state</a>. I ended up missing the show (listening to it now!), but caught a very lively discussion on Twitter.</p>\n\n<p>One side conversation (you can see it <a href=\"http://storify.com/sujal/where-we-live-s-keeping-people-in-ct-discussion\">on storify here</a>) that I joined in on was about how hard it is to convince people to move to CT.</p>\n\n<p>Let's be honest. It's hard. Harder than it should be, quite honestly, considering how nice it is to live here. I had a lot of experience with this when I was hiring people at ESPN. Even with a kick ass company, a dream job for most sports fans, and great relocation packages, it was hard to convince people to move to CT. There are a lot of reasons, and they vary by person, but they all seemed to boil down to cost and opportunity.</p>\n\n<p>For people moving from a relatively low cost-of-living area, like Kansas or Vermont or Nevada, it was mostly about cost. CT looks and feels expensive when you're browsing real estate or rents even though we're cheap-ish for the region. For whatever reason, cost-of-living adjustments never seemed to truly capture the difference people felt.</p>\n\n<p>For people moving from a big city or high cost-of-living area, like New York City or Boston or San Francisco, it was mostly about opportunity. What if they didn't like the job here? What job opportunities would they have at a similar style company? This was exaggerated in my particular industry. There aren't many of the kind of companies that are doing consumer Internet or mobile products that ESPN makes. If you live in NYC or Boston or SF, on the other hand, you have dozens of options plus many, many strong startup and entrepreneurial companies nearby.</p>\n\n<p>There are people working on the second issue (e.g. <a href=\"http://www.hartfordhub.org/\">this effort</a>). So I asked about the cost reason, specifically:</p>\n\n<blockquote class=\"twitter-tweet\">\n<p>@<a href=\"https://twitter.com/wherewelive\">wherewelive</a> silly question: what programs incentivize people to move to area/city? I know we subsidize companies all the time.</p>— Sujal Shah (@sujal) <a href=\"https://twitter.com/sujal/status/192971223733510144\" data-datetime=\"2012-04-19T13:41:39+00:00\">April 19, 2012</a>\n</blockquote>\n\n<script src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p>As I mentioned, you can read the <a href=\"http://storify.com/sujal/where-we-live-s-keeping-people-in-ct-discussion\">whole convo if you want</a>, but that's the main point.</p>\n\n<p>CT just <a href=\"http://www.pressherald.com/news/connecticut-to-invest-_291-million-in-jackson-lab_2012-01-31.html\">authorized $291 million in spending over 10 years</a> to incentivize Jackson Labs to build a $1 billion facility here. Of that, $192 million is a loan that is entirely forgiven if the facility creates &amp; retains 300 jobs in 10 years.</p>\n\n<p>Now, I don't know whether that's a good program or not for 300 jobs, but like a lot of programs, the government seems to focus on giving money to companies rather than individuals. This isn't bad per se, but the tradeoffs are worth talking about.</p>\n\n<p>For one thing, this means that the government has to choose an industry or individual company to offer these incentives to. This doesn't prevent existing companies from leaving, nor does it help them. That seems odd to me. But it's also exceedingly common. Remember the brouhaha about <a href=\"http://www.nytimes.com/2001/03/22/us/boeing-jolting-seattle-will-move-headquarters.html?pagewanted=all&amp;src=pm\">Boeing moving it's HQ</a>?</p>\n\n<p>Instead, I wonder if cities or states have considered incentivizing individuals to take existing jobs. For the same expenditure ($192 million over 10 years), the state could offer 5 year rent or property tax credits of $5,000 to over 7,500 families or individuals. $5,000 would cover over 100% of <a href=\"http://www.tax-rates.org/connecticut/property-tax\">the median property tax for the state</a>.</p>\n\n<p>On the surface, that seems like a better use of taxpayer money. That assumes there are, of course, 7,500 jobs to fill in the state. Then again, more people moving here mean more people needing services and products. I suspect like any social network, virtual or real, there are network effects that come into play once you create some momentum.</p>\n\n<p>Curious if anyone has seen studies or programs like this in the United States. I wonder how well they work, and what data we can glean from them.</p>\n",
				"date_published": "2012-04-19T10:40:01-05:00",
				"url": "https://fatmixx.com/2012/04/19/incentivizing-individual-relocation.html",
				"tags": ["export","Connecticut","Politics"]
			},
			{
				"id": "http://sujal.micro.blog/2011/11/07/what-we-have.html",
				"title": "What we have here is a failure to communicate",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<p>In West Hartford this week, when the electric company was refusing to tell town leaders what streets its crews were going to be working on, officials came up with their own improvised solution. Municipal leaders sent town police over to CL&amp;P&rsquo;s staging area at Westfarms mall in the evening to ask the crews themselves where they would be heading to work the next day.</p>\n<p>This isn&rsquo;t neurotic small town bureaucrats overreacting. This information is critical during an emergency, when fire and rescue personnel must know what streets are passable. Already, one elderly West Hartford woman without power died in a fire at her home this week.</p>\n<p>So what did CL&amp;P do when they found out West Hartford police were tracking down where crews were going to work?</p>\n<p>They told their workers not to talk to the cops. Now there&rsquo;s a company that cares.</p>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>(I should point out, coincidently, and in testament to how obvious the headline choice is, the <a href=\"http://articles.courant.com/2011-11-05/news/hc-green-dayseven-1106-20111105_1_cl-p-operating-officer-jeffrey-butler-communication\">Courant chose a similar headline</a>. I started writing this before I saw the Courant article, for the record. :-) )</p>\n\n<p>I had a rather animated conversation with a friend today about CL&amp;P's performance during this most recent storm. I won't bore you with the whole thing, but there are a few things I wanted to open up to a broader conversation. At this point, my focus is about how to ensure that people aren't surprised, frustrated and without power the next time weather happens.</p>\n\n<p>My expectation as a customer is that they have a plan to:</p>\n\n<ol>\n<li>… maintain the lines during normal times to minimize potential damage from a weather event.</li>\n<li>… repair the lines quickly, including how to get additional crews in if necessary</li>\n<li>… coordinate repairs with town leaders around the state</li>\n</ol>\n\n<p>Reporting about the outage has called into question CL&amp;P's effectiveness on all three aspects. The Times <a href=\"http://www.nytimes.com/2011/11/04/business/the-troubling-connecticut-power-failure.html\">published an article this weekend</a> calling into question the maintenance budgeting at CL&amp;P and planning. Even better was this anecdote <a href=\"http://articles.courant.com/2011-11-05/news/hc-green-dayseven-1106-20111105_1_cl-p-operating-officer-jeffrey-butler-communication\">from our own Mayor Slifka in the Courant</a>:</p>\n\n<blockquote>\n\nIn West Hartford this week, when the electric company was refusing to tell town leaders what streets its crews were going to be working on, officials came up with their own improvised solution. Municipal leaders sent town police over to CL&amp;P's staging area at Westfarms mall in the evening to ask the crews themselves where they would be heading to work the next day.\n\nThis isn't neurotic small town bureaucrats overreacting. This information is critical during an emergency, when fire and rescue personnel must know what streets are passable. Already, one elderly West Hartford woman without power died in a fire at her home this week.\n\nSo what did CL&amp;P do when they found out West Hartford police were tracking down where crews were going to work?\n\nThey told their workers not to talk to the cops. Now there's a company that cares.\n\n</blockquote>\n\n<p>The communication issues seem unforgivable. No one has come up with a plausible reason why CL&amp;P couldn't tell the towns where their crews would be, or in what order they were approaching the work. Either they didn't have a plan or central coordination, or they put their corporate image above the safety of citizens. That's basically it.</p>\n\n<p>There's <a href=\"http://www.governor.ct.gov/malloy/cwp/view.asp?A=4010&amp;Q=490324\">going to be an investigation</a> into CL&amp;P's performance, so maybe we'll find out more about how they stack up to other utilities. Regardless, though, the episode has raised an alternate option that we should consider.</p>\n\n<p>I think it's time to consider organizing our utilities differently. For example, the way we handle water here in West Hartford is via a public/private corporation. With the <a href=\"http://themdc.com/\">MDC</a>, we have pooled together resources with several surrounding towns and cities in order to provide water to our citizens via a non-profit corporation. The city of Norwich has run <a href=\"http://norwichpublicutilities.com/\">their own public utility corporation</a> (for profit) for over 100 years. We let governments at all levels maintain roads, airports, and other infrastructure. In my mind, the lines that carry telephone, cable, and Internet (particularly at the local level - the last mile networks) should be like roads - shared, impartially maintained where private companies compete to provide us service. I don't see why power lines, especially at the local level, should be any different. In all of these cases, you break monopolies, accelerate the competition from private vendors for new products and solutions, and bring accountability closer to the customer. At least the mayor won't have to send out the police to chat up crews to find out details about the repair efforts.</p>\n\n<p>These seem like good things. There are certainly going to be tradeoffs. Curious how everyone else feels about something like this.</p>\n\n<p>If you're interested in learning more, the Colin McEnroe show <a href=\"http://www.yourpublicmedia.org/node/16734\">covered this topic today</a>, including a few towns that converted their transmission functions to a public agency or a public/private corporation. I caught part of it this afternoon, looking forward to listening to the rest later tonight (after the Eagles game - Go Eagles!)</p>\n",
				"date_published": "2011-11-07T21:22:12-05:00",
				"url": "https://fatmixx.com/2011/11/07/what-we-have.html",
				"tags": ["export","Connecticut","In the News","cl\u0026amp;p","october snowstorm","West Hartford"]
			},
			{
				"id": "http://sujal.micro.blog/2011/05/11/google-io-an.html",
				"title": "Google I/O: An unadulterated celebration of technological imagination",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>That mouthful is my one sentence description of <a href=\"http://www.google.com/events/io/2011/\">Google I/O</a>. The demo floors and tonight's After Hours party are full of whimsy and wonder, literal playgrounds for technology geeks of all stripes.</p>\n\n<p>The atmosphere at I/O is all about the possible, the future, and the fanciful. There are companies making robots, others building home mesh networks that can control all your lights, and yet others working on all sorts of crazy gadgetry. It was all very cool. I went from demo to demo filled with a sense of wonder of what the next few years might bring. Sure, there were really practical sessions about new APIs and tech, but stepping outside of the sessions put you in a geeky wonderland.</p>\n\n<p>At the same time, I can't help but see this as a metaphor for the differences between Apple &amp; Google or Apple &amp; Android. At Apple's <a href=\"http://developer.apple.com/wwdc/\">WWDC</a>, it's intensely about what will get done now. It's about making connections and learning the tech that you're going to put into your next application. Folks on stage demo apps that will launch very soon. Apple talks about features that will be available in weeks. It's about go, go, go and very much about making money. It's almost businesslike during the day, with fun during the evening.</p>\n\n<p>WWDC is all about execution, making money, and shipping NOW. For Android, folks know it's going to be huge, eventually, so they know they'll make money, eventually. Every time I saw a cool hardware demo, or a neat looking app with some advanced tech, the answer I inevitably got to my, \"When can I get it (I really want it!)?\" was \"fourth quarter this year\" or later.</p>\n\n<p>If that doesn't summarize the state of the two app markets, I'm not sure what else does.</p>\n\n<p>I'll be adding more photos to <a href=\"http://www.flickr.com/photos/sujal/sets/72157626563557729/\">my Google I/O 2011 set</a> as I get time. I have some great photos of some of the demos at the party and around the daytime demo area. You can see what I mean for yourself.</p>\n",
				"date_published": "2011-05-11T01:55:38-05:00",
				"url": "https://fatmixx.com/2011/05/11/google-io-an.html",
				"tags": ["export","Android","google io","iPhone","Programming","Technology News","wwdc"]
			},
			{
				"id": "http://sujal.micro.blog/2010/12/01/weight-loss-faq.html",
				"title": "Weight loss FAQ",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>As most of my friends and coworkers know, I've lost a whole lot of weight over the last year. Folks that see me for the first time ask me a lot of the same questions, so consider this my attempt to answer the most common ones.</p>\n\n<p><strong>1. How much weight have you lost?</strong></p>\n\n<p>As of this morning, just under 60 pounds.</p>\n\n<p><strong>2. Why did you decide to do this?</strong></p>\n\n<p>When we realized we were going to have a kid this fall, I figured out that I'm going to be over 50 when he graduates high school. At the rate I was going with my health and weight... well, I just wanted to do something about it. My initial goal was just to shed 15-20 pounds and ride my bike consistently. The rest has just been bonus, in large part because sticking with the new habits has been pretty easy.</p>\n\n<p><strong>3. How did you lose the weight?</strong></p>\n\n<p>Combination of eating better &amp; exercise, but mostly eating a lot better. I use the  <a href=\"http://www.weightwatchers.com/\">Weight Watchers</a> iPhone app &amp; online tools to track and guide what I eat. I also started exercising consistently once or twice a week. That's pretty much it.</p>\n\n<p><strong>4. Weight Watchers, huh? Why? Don't you have to go to meetings or buy their food?</strong></p>\n\n<p>I did Weight Watchers because a few folks I know through Twitter were having great success with the program. I also used a Points guide a bunch of years back to understand my diet. I didn't really follow the program then, but I was familiar with the concepts and it made sense to me: measure calories in, keep it slightly below calories out to lose weight.</p>\n\n<p>The good thing about Weight Watchers is that you don't need to buy any particular food. You can eat whatever. It's really about moderation and making healthier choices on the whole. The meetings are also not necessary. Some people need the motivation and the support. I just need the data, and the iPhone app and online tools were perfect for me.</p>\n\n<p>The program assigns a points value to food based on it's nutritional value. Based on your weight, age, and activity level, they give you a daily point budget. You track what you eat and make sure you stay under the daily limit. On nights when you're out with your friends or out for a special dinner or you just need a treat after a rough day at work, you also have a weekly budget you can draw from. Finally, you can bank extra weekly points by exercising (which could be playing Wii Fit for 30 minutes, or mowing the lawn...).</p>\n\n<p>There are lot of other apps out there for the iPhone that take a very similar approach. Many are cheaper. The <a href=\"http://fitbit.com\">Fitbit</a>, for example, has calorie tracking functionality.</p>\n\n<p><strong>5. How much are you exercising?</strong></p>\n\n<p><a href=\"http://www.dailymile.com/people/sujal\">Not a whole heck of a lot</a>. The key thing is that I have fun with it. I don't particularly like the gym. So, last summer, I started biking regularly, starting with short rides (20-30 minutes) and building up. I then realized how much I really enjoyed being out on my bike.  This past summer, I rode my bike for 60-90 minutes once or twice a week. I played 9 holes of golf walking &amp; carrying my bag (even in the pouring rain) with our office league once a week. That's basically it. Most weeks, I'd have a full days worth of points banked from just one bike ride and 9 holes of golf.</p>\n\n<p>As the weather has gotten colder, and I have less free time because of the baby, I've started running instead. I can get a workout that feels good in 30-40 minutes instead of 90. Plus, it's more fun than I imagined.</p>\n\n<p>I keep bringing \"fun\" up because I want this to be sustainable. Exotic diets or constant gym routines aren't sustainable for me. This works.</p>\n\n<p><strong>6. Any other tips?</strong></p>\n\n<p>The one thing I have been using more than I imagined possible is a small, inexpensive <a href=\"http://amzn.to/fgOvoO\">food scale</a>. I don't use it to be precise about portions. I use it to be <em>lazy</em> about dishes. If I wanted to know how much 2 tablespoons of, say, olive oil is, or a quarter cup of cheese, I'd have to use a measuring cup or a spoon, then wash it. If i have multiple ingredients, I dirty more dishes. With the scale, I can just weigh each step and then turn the scale off and I'm done. Most nutrition labels indicate serving sizes by both volume &amp; weight, by the way. Pretty handy. And, yes, I'm that lazy.</p>\n\n<p>The other thing is to find activities that work for you. I'm imagining that most guys will be alright with an excuse to play golf, and walking is awesome on a beautiful golf course. Heck, it's the only reason I kept playing all summer because, honestly, I'm the worst golfer I know. Plus, its cheaper than renting a golf cart each time.</p>\n\n<p><strong>7. When will you stop trying to lose weight?</strong></p>\n\n<p>I basically kinda have. In the last 7 weeks, I've lost ~5lbs, which is less than a pound a week. My official goal is to get my BMI to be in the <a href=\"http://www.nhlbisupport.com/bmi/\">normal range</a>. I'm technically still just on the overweight side of that line. Once I hit that goal, I'll switch the Weight Watchers plan into maintenance mode and then focus on my fitness goals instead.</p>\n",
				"date_published": "2010-12-01T22:15:02-05:00",
				"url": "https://fatmixx.com/2010/12/01/weight-loss-faq.html",
				"tags": ["export","Me Me Me"]
			},
			{
				"id": "http://sujal.micro.blog/2010/11/13/our-great-education.html",
				"title": "'Our Great Education Challenge' at the CT Forum",
				"content_html": "<p>I attend each <!-- raw HTML omitted -->Connecticut Forum<!-- raw HTML omitted --> event hoping to leave smarter than when I arrive. This is usually a slam dunk, no doubt it&rsquo;ll happen thing for any given Forum event. Except, that is, for last night.</p>\n<p>The topic was <!-- raw HTML omitted -->Our Great Education Challenge<!-- raw HTML omitted -->. The panel consisted of:</p>\n<!-- raw HTML omitted -->\n<p>It helps, at this point, to be familiar with <!-- raw HTML omitted -->Waiting for Superman<!-- raw HTML omitted -->. If you haven&rsquo;t seen the movie, you can quickly read <!-- raw HTML omitted -->my review of the film<!-- raw HTML omitted -->. Short version: the film concludes unions are at the heart of America&rsquo;s education problem because they prevent principals and schools from coaching, firing, or adequately managing teachers.</p>\n<p>As it turns out, every person on the panel (plus the moderator) basically took the <!-- raw HTML omitted -->Superman<!-- raw HTML omitted --> position as a given except Lily Eskelsen (the sole union perspective on the panel). This is unsurprising considering their backgrounds - two are school administrators who spar with unions constantly. Guggenheim obviously agrees with his own film. Excluding Schnur, then, you have the makings of a pile on for Eskelsen. So, that&rsquo;s essentially what we got. The entire Forum consisted of the panelists delivering applause lines ripping on the unions or going back and forth with Eskelsen.</p>\n<p>It would&rsquo;ve been more productive to talk about specific union concessions that would make school improvements easier, or to discuss whether the union even has a purpose in today&rsquo;s school system. I&rsquo;d be interested in understanding why only 17% of charter schools perform better than public schools, or why Joel Klein thinks that&rsquo;s a success rate worth &ldquo;cherishing.&rdquo; Or, why Deborah Gist thinks school systems would negotiate these weird, applause line worthy rules into their teacher contracts.</p>\n<p>It&rsquo;s not that I believe these people are playing fast and loose with the numbers, or have some hidden agenda. In fact, I believe they have sound reasons for their perspectives (and they wear their agendas pretty plainly out in the open). I just think they&rsquo;re used to talking about this topic with other educators and school reformers. So, they mention things like &ldquo;alternative evaluation systems&rdquo; without explaining what that means because, well, everyone on the panel knows.</p>\n<p>This seems like a flaw in the Forum format. The moderators are often prepared to discuss the issues and to facilitate conversation among the panel, but not so much to facilitate understanding for the audience. It&rsquo;s really a missed opportunity. I would love a moderator who worked to get panelists to explain terms or concepts that may not be obvious to non-experts.</p>\n<p>For example, teacher evaluation was a key topic of discussion. During the Forum, Eskelsen brought up concerns with using test scores as a sole measure of teacher effectiveness. A number of panelists mentioned that some districts were testing alternative and more comprehensive teacher evaluation systems. No one, however, ever bothered to explain what some of them are or what else they look at beyond a standardized test. I was really curious about that and felt let down when the topics shifted.</p>\n<p>My other takeaway from the forum was that there were lots of anecdotes or quips that highlighted some ridiculous policy or other that everyone universally could hate or be amused by. Applause lines, if you will. Last night, I called it <!-- raw HTML omitted -->sloganeering<!-- raw HTML omitted -->. That still seems like the best description of last night&rsquo;s conversation.</p>\n<p>For example, at one point, Norah O&rsquo;Donnell turned to the audience and called teachers heroes who have a tough job and work very hard. Its the constant refrain, didn&rsquo;t seem particularly sincere. Mere minutes later, a panelist cracks a joke about teachers leaving at 3PM even though their schools are failing. Well, which one is it? There&rsquo;s a weird sort of contradiction that comes up in education reform conversations. Teachers are both working really hard and lazy, overpaid and underpaid, and so on. Doesn&rsquo;t really help the conversation.</p>\n<p>Ultimately, I walked away with the same questions I had at the end of <!-- raw HTML omitted -->Superman<!-- raw HTML omitted -->, which was disappointing. There was one exception, though. During the audience Q&amp;A portion, O&rsquo;Donnell asked a question I submitted about class size (cool!). Joel Klein pointed out that one of the Harlem charters has 30 kids in some classes. Eskelsen pointed out that she&rsquo;s taught up to 39 in one. Pretty big difference, and one reason I remain skeptical that firing teachers has anything to do with charter success.</p>\n<p>I&rsquo;m hoping we can continue this discussion in the coming weeks among ourselves. I have some ideas on how to bring this conversation along, and I want to start by looking at some of the questions I asked in my review of <!-- raw HTML omitted -->Superman<!-- raw HTML omitted -->. I also have a bunch of questions jotted down in my notes from the Forum last night. Between the two, there are a lot of items worth a follow up. On that front, the Forum was a rousing success.</p>\n",
				"content_text": "I attend each <a href=\"http://www.ctforum.org/\">Connecticut Forum</a> event hoping to leave smarter than when I arrive. This is usually a slam dunk, no doubt it'll happen thing for any given Forum event. Except, that is, for last night.\n\nThe topic was <a href=\"http://www.ctforum.org/content/our-great-education-challenge\">Our Great Education Challenge</a>. The panel consisted of:\n<ul>\n \t<li>Davis Guggenheim, the filmmaker behind <a href=\"https://en.wikipedia.org/wiki/Waiting_for_%22Superman%22\">Waiting for Superman</a> &amp; <em>An Inconvenient Truth</em>\n</li>\n \t<li>Lily Eskelsen, VP of the National Educators Association (NEA), the largest teachers' union</li>\n \t<li>Joel Klein, the current and outgoing chancellor of the New York City public schools</li>\n \t<li>Deborah Gist, Rhode Island Commissioner of Education</li>\n \t<li>Jon Schnur, CEO of <a href=\"http://www.nlns.org/\">New Leaders for New Schools</a>\n</li>\n \t<li>The panel was moderated by MSNBC correspondent <a href=\"http://en.wikipedia.org/wiki/Norah_O'Donnell\">Norah O'Donnell</a>.</li>\n</ul>\nLooking at that list, it seems like this group was (unintentionally, I'm sure) set up to fail to reach any sort of consensus or real conversation.\n\nIt helps, at this point, to be familiar with <em>Waiting for Superman</em>. If you haven't seen the movie, you can quickly read <a href=\"http://www.fatmixx.com/2010/11/01/30-second-review-waiting-for-superman/\">my review of the film</a>. Short version: the film concludes unions are at the heart of America's education problem because they prevent principals and schools from coaching, firing, or adequately managing teachers.\n\nAs it turns out, every person on the panel (plus the moderator) basically took the <em>Superman</em> position as a given except Lily Eskelsen (the sole union perspective on the panel). This is unsurprising considering their backgrounds - two are school administrators who spar with unions constantly. Guggenheim obviously agrees with his own film. Excluding Schnur, then, you have the makings of a pile on for Eskelsen. So, that's essentially what we got. The entire Forum consisted of the panelists delivering applause lines ripping on the unions or going back and forth with Eskelsen.\n\nIt would've been more productive to talk about specific union concessions that would make school improvements easier, or to discuss whether the union even has a purpose in today's school system. I'd be interested in understanding why only 17% of charter schools perform better than public schools, or why Joel Klein thinks that's a success rate worth \"cherishing.\" Or, why Deborah Gist thinks school systems would negotiate these weird, applause line worthy rules into their teacher contracts.\n\nIt's not that I believe these people are playing fast and loose with the numbers, or have some hidden agenda. In fact, I believe they have sound reasons for their perspectives (and they wear their agendas pretty plainly out in the open). I just think they're used to talking about this topic with other educators and school reformers. So, they mention things like \"alternative evaluation systems\" without explaining what that means because, well, everyone on the panel knows.\n\nThis seems like a flaw in the Forum format. The moderators are often prepared to discuss the issues and to facilitate conversation among the panel, but not so much to facilitate understanding for the audience. It's really a missed opportunity. I would love a moderator who worked to get panelists to explain terms or concepts that may not be obvious to non-experts.\n\nFor example, teacher evaluation was a key topic of discussion. During the Forum, Eskelsen brought up concerns with using test scores as a sole measure of teacher effectiveness. A number of panelists mentioned that some districts were testing alternative and more comprehensive teacher evaluation systems. No one, however, ever bothered to explain what some of them are or what else they look at beyond a standardized test. I was really curious about that and felt let down when the topics shifted.\n\nMy other takeaway from the forum was that there were lots of anecdotes or quips that highlighted some ridiculous policy or other that everyone universally could hate or be amused by. Applause lines, if you will. Last night, I called it <a href=\"http://wordnetweb.princeton.edu/perl/webwn?s=sloganeering&amp;sub=Search+WordNet&amp;o2=&amp;o0=1&amp;o7=&amp;o5=&amp;o1=1&amp;o6=&amp;o4=&amp;o3=&amp;h=\">sloganeering</a>. That still seems like the best description of last night's conversation.\n\nFor example, at one point, Norah O'Donnell turned to the audience and called teachers heroes who have a tough job and work very hard. Its the constant refrain, didn't seem particularly sincere. Mere minutes later, a panelist cracks a joke about teachers leaving at 3PM even though their schools are failing. Well, which one is it? There's a weird sort of contradiction that comes up in education reform conversations. Teachers are both working really hard and lazy, overpaid and underpaid, and so on. Doesn't really help the conversation.\n\nUltimately, I walked away with the same questions I had at the end of <em>Superman</em>, which was disappointing. There was one exception, though. During the audience Q&amp;A portion, O'Donnell asked a question I submitted about class size (cool!). Joel Klein pointed out that one of the Harlem charters has 30 kids in some classes. Eskelsen pointed out that she's taught up to 39 in one. Pretty big difference, and one reason I remain skeptical that firing teachers has anything to do with charter success.\n\nI'm hoping we can continue this discussion in the coming weeks among ourselves. I have some ideas on how to bring this conversation along, and I want to start by looking at some of the questions I asked in my review of <em>Superman</em>. I also have a bunch of questions jotted down in my notes from the Forum last night. Between the two, there are a lot of items worth a follow up. On that front, the Forum was a rousing success.\n",
				"date_published": "2010-11-12T23:47:41-05:00",
				"url": "https://fatmixx.com/2010/11/13/our-great-education.html",
				"tags": ["export","Connecticut","connecticut forum","ctforum","Politics","Education"]
			},
			{
				"id": "http://sujal.micro.blog/2010/10/03/following-up-on.html",
				"title": "Following up on my @ctforum tweet",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>I wanted to briefly expand on a few tweets I made during last night's Connecticut Forum.  The topic was \"<a href=\"http://www.ctforum.org/content/end-civility\">The End of Civility?</a>\" and the panel featured <a href=\"http://en.wikipedia.org/wiki/David_Gergen\">David Gergen</a>, <a href=\"http://en.wikipedia.org/wiki/Stephen_L._Carter\">Stephen Carter</a>, <a href=\"http://en.wikipedia.org/wiki/Christopher_Buckley\">Christopher Buckley</a>, and <a href=\"http://en.wikipedia.org/wiki/Gina_Barreca\">Gina Barreca</a>.  It was a good discussion, and what I'll address was only one aspect of it.</p>\n\n<p>The rise of the political blogs is as much about a shift of power as it is about technology.  Having a panel of elites decry the rise of blogs is a bit one-sided.  Three of the panelists were the children of university professors or, uh, William F. Buckley. They grew up with access and opportunity - I doubt any of them would've had trouble meeting a Senator or Congressman as a high school or university student.</p>\n\n<p>Technology enabled others outside the establishment to get heard.  That's what explains the rise of blogging.  Buckley's characterization of blogging as the equivalent of \"Ask Any A**hole\" in newspaper-speak is an oversimplification.  There are smart bloggers and stupid bloggers and rabble rouser bloggers.  They're not all the same.</p>\n\n<p>Take it another way: we've seen this with lots of other technological shifts, from the advent of the printing press and cheaper presses to the rise of radio and TV. I haven't studied this closely, but my sense is that we've seen similar noise before things sort of settle down, e.g. yellow journalism, conspiracy newsletters, pamphleteers.</p>\n\n<p>We're still settling down with the Internet in our political sphere.  The fact that we're still getting used to how it fits into the discourse shouldn't be a surprise.</p>\n\n<p>For the forum, I would've preferred some representation of bloggers on the panel.  It was bordering on annoying listening to 3 scions of establishment elites decry the rise of the \"rabble.\"  It would've been more interesting to have Gergen chat with, say, Duncan Black of Eschaton or even Michelle Malkin or one of the intense right wing blogs.  The conversation would've really gotten into the civility of current political discourse a lot faster.</p>\n\n<p>For long time friends and readers, my opinion on the lack of civility won't surprise you.  I look to an abdication of the referee role by our TV media, instead becoming passive stenographers of the news. Or, worse, active partisanship on the part of Fox News and the WSJ and WaPo editorial boards.</p>\n\n<p>It would be easier to add perspective to the lies and attack of the blogs if there were a referee.  That doesn't exist.  Even worse, we have national press taking explicit sides.  Fox News didn't come up once, by the way. It's hard for me to believe that their active encouragement of the worst sorts of rumors and falsehoods from the blogs isn't hurting the civility of our discourse.  But of course, they're on TV, so it's not their fault.</p>\n\n<p>(yes, they brought up cable news as a broad topic, but Fox News as a network is a phenomenon more akin to <a href=\"http://en.wikipedia.org/wiki/Yellow_journalism\">yellow journalism</a>.  The other networks aren't the same in that regard.  Individual shows may be, e.g. Olbermann, but there is no network as partisan as Fox.)</p>\n",
				"date_published": "2010-10-03T13:59:24-05:00",
				"url": "https://fatmixx.com/2010/10/03/following-up-on.html",
				"tags": ["export","Connecticut","connecticut forum","ctforum","hartford","In the News","Politics"]
			},
			{
				"id": "http://sujal.micro.blog/2010/09/12/nurses-make-all.html",
				"title": "Nurses make all the difference",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>It's hard to find time to blog or write or do much of anything aside from take care of our new baby, but I've been itching to write this post since we left the hospital last week.</p>\n\n<p>When you're expecting a baby, you can tour the hospital.  They show you the rooms in labor and delivery and in maternity and the nursery wing. They tell you about the amenities, the security, and medical technologies they have available.  After our stay at Hartford Hospital, I can honestly tell you that none of those things are that important. What made our stay there amazing were the nurses and care staff. To a person, they were thoughtful, kind, attentive, and, most of all, helpful.</p>\n\n<p>Helpful is under-appreciated. Helpful could be knowing what to say when a mom is upset because her son isn't latching on right. It could be the nurse that stays in the room reassuring the new parents because, let's face it, new parents worry a lot (especially us). Or it could be the PCA that gets the mom some extra supplies or juice containers.  Our nurses and PCAs at Hartford Hospital were the best.</p>\n\n<p>To all the nurses and care staff at Hartford Hospital that took care of Heidi and my son, from the bottom of our hearts, thank you.  You made our time at the hospital comfortable and helped Heidi and I get comfortable with caring for our new son, from swaddling instructions to breast feeding help.  Our time at the hospital exceeded our expectations in just about every way.  Thank you.</p>\n",
				"date_published": "2010-09-12T16:07:58-05:00",
				"url": "https://fatmixx.com/2010/09/12/nurses-make-all.html",
				"tags": ["export","Me Me Me","Connecticut","hartford hospital"]
			},
			{
				"id": "http://sujal.micro.blog/2010/08/08/acadia-national-park.html",
				"title": "Acadia National Park: one of my favorite places",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<div class=\"rightReviewBox\"><a href=\"http://www.flickr.com/photos/sujal/4861642477/\" title=\"Bubble Pond, along the carriage road by sujal, on Flickr\"><img src=\"http://farm5.static.flickr.com/4123/4861642477_ef686c8be5_m.jpg\" width=\"180\" height=\"240\" alt=\"Bubble Pond, along the carriage road\"></a></div>\n\n<p>For so many reasons, <a href=\"http://www.nps.gov/acad/index.htm\">Acadia National Park</a> is special to Heidi and me. If you haven't been, you're missing out on one of the treasures of the National Park system and, really, of the east coast.  The beauty of the park is remarkable (just look at the photo on the right!). Acadia's real strength, though, is how accessible and easy it is to explore.  The park is crisscrossed with miles of easy to ride carriage roads and easily reachable trails. It's an easy, if long drive up to the park from New York or anywhere in New England, and has a great little town right outside the park in Bar Harbor.  Whether you go for a drive on the Park Loop Road, or a hike or bike ride on the trails or carriage roads, you'll be rewarded with spectacular views of water, islands, and the rugged coast of Maine.</p>\n\n<p>On our most recent trip, I made time to take a <a href=\"http://www.dailymile.com/people/sujal/entries/2705468\">long bike ride through</a> the eastern half of the park.  The carriage roads, <a href=\"http://en.wikipedia.org/wiki/John_D._Rockefeller,_Jr.#Conservation\">built by John D. Rockefeller, Jr. as a labor of love</a>, run through some of the most beautiful sections of the park.  There are different loop combinations possible, allowing you to choose the duration and difficulty of your ride, run, or walk with ease. Some of the roads hug the lakes and ponds through the park, while others follow ridge lines or climb mountains in the park, leading to spectacular views out over all of Mount Desert Island.  There are some challenging climbs, but since the roads are graded for horse-drawn carriages, there aren't many of them.  On the other hand, because of Acadia's mountains and glacial past, there are really no flats anywhere. As one of my guide books said, the good thing is that nearly every climb is rewarded with a good view and a nice downhill after.</p>\n\n<p>The route I chose covered about 33 miles, around 30 inside the park on the carriage roads (there's a map below). While riding, I saw a number of families and groups riding around.  I even saw a number of older couples (60+) making their way around the carriage roads.  The western part of my loop (miles 6-13 in the map below), and the climb to the top of Day Mountain were among the quietest portions.  I passed only a handful of riders and joggers.  The portions closer to Jordan Pond &amp; Eagle Lake were the busiest.  If you know the park at all, that probably wasn't surprising.  I highly recommend getting away from the busy portions if you have the time.  Just bring some food &amp; a decent amount of water and give yourself enough time to take breaks and enjoy the views.</p>\n\n<div class=\"leftReviewBox\"><a href=\"http://www.dailymile.com/routes/269625-cycling-route-in-bar-harbor-me\"><img src=\"https://cdn.uploads.micro.blog/wp-content/709/2010/08/SafariScreenSnapz011-1-1.png\" alt=\"\" title=\"SafariScreenSnapz011\" width=\"280\" height=\"224\" class=\"alignnone size-full wp-image-6228\"></a></div>\n\n<p>The one thing I wish I had was a guidebook for Acadia.  I carried a bike map and a small guide for the roads, but concerned about weight, I left everything else except the water and my cell phone behind.  After I tweeted about my ride, though, a developer based in Maine sent me a tweet about an iPhone &amp; Android app he'd built for Acadia National Park.  He offered to let me take a look for free and to offer feedback.  After taking a look, I really wish I had it on the ride.  The app is <a href=\"http://itunes.apple.com/us/app/chimani-acadia-national-park/id373153975?mt=8\">Chimani Acadia National Park</a>, developed by <a href=\"http://www.chimani.com/\">Chimani, LLC</a>.  The app is beautifully designed and well thought out.  It contains trail maps, cycling routes, sunset/sunrise info, ranger events and even an audio tour for the Park Loop Road.  The app also has a schedule and route map for the free Island Explorer busses.  Best of all, everything works without a network connection.  Acadia may be many things, but cell phone friendly it isn't, so this is a requirement for a park app.</p>\n\n<div class=\"rightReviewBox\" style=\"border: 1px solid black; padding: 10px;\">\n<span style=\"font-size: 0.8em; font-weight: bold;\">Ride cheat sheet</span><br>\n5 right<br>\n3 left<br>\n2 left<br>\n4 right<br>\n6 right<br>\n9 right<br>\n11 right<br>\n13 right<br>\n18 left<br>\n19 right<br>\n20 left<br>\n21 left<br>\n14 right<br>\n15 left<br>\n16 left<br>\n17 left or loop day mtn<br>\n7 right<br>\n6 right<br>\n4 right<br>\nback to Bar Harbor, shop</div>\n\n<p>My guide book was a little better in a few ways, though. First, the app's maps don't really have a turn-by-turn set of instructions for any of the routes or trails.  They just indicate the starting position of a route or some portion, and list out points of interest.  It would be great if they included turns at the sign posts.  Every intersection on the carriage roads is numbered and is usually a three way intersection, so your choices always basically boil down to right or left.  For each route, then, \"directions\" are a list of left &amp; right turns.  For example, the box to the right shows my cheat sheet for the ride (Note: I amended this while on the ride, so it doesn't match the route above).  It would be great if the app either listed the turns or allowed the user to create a cheat sheet like this.</p>\n\n<p>That being said, it's a great complement to a good bike map.  The routes all include points of interest with some background info.  For example, the <a href=\"http://www.nps.gov/acad/historyculture/historiccarriageroads.htm\">carriage roads include</a> many beautiful stone bridges throughout the parks.  If I would have used this for my ride, I would've tweaked my route to include the <a href=\"http://www.google.com/search?client=safari&amp;rls=en&amp;q=%22cliffside+bridge%22+acadia&amp;ie=UTF-8&amp;oe=UTF-8\">Cliffside Bridge</a>, which sounds spectacular.</p>\n\n<p>Overall, the app looks solid and worth having if you're going through the park.  My only advice is not to rely on the app as your primary map when you're hiking or biking.  For one thing, the maps aren't detailed enough.  Most importantly, though, batteries don't die on paper maps. Many of the maps you can pick up at the Visitor Center are also waterproof.  For what it's worth, I usually keep my phone inside a ziplock back when I ride in case it rains along with a little cash and one credit card.</p>\n\n<p>My paper map was an awesome one that's available at the Visitor Center. It's the \"Complete Hiking Trail &amp; Carriage Road Map\" by the <a href=\"http://www.friendsofacadia.org\">Friends of Acadia</a>. It's $3.50 and well worth it.</p>\n\n<div class=\"leftReviewBox\"><a href=\"http://www.flickr.com/photos/sujal/4862262306/\" title=\"Top of Day Mountain, Acadia National Park by sujal, on Flickr\"><img src=\"http://farm5.static.flickr.com/4116/4862262306_aa0f60e07a_m.jpg\" width=\"240\" height=\"180\" alt=\"Top of Day Mountain, Acadia National Park\"></a></div>\n\n<p>This ride was also the first time I've been on any sort of mountain bike in years. I rented a nice <a href=\"http://www.cannondale.com/usa/usaeng/Products/2009/Mountain/Details/1592-9FS4-F4-with-CAFFEINE-frame-technology\">Cannondale F4</a> from <a href=\"http://www.barharborbike.com/\">Bar Harbor Bicycle Shop</a>.  This was my first time renting there, but I'd be happy to do it again.  You really can't go wrong at any of the shops along Cottage St. in Bar Harbor, but they had a full bike shop attached, which was great for last minute gear I needed.</p>\n\n<p>The F4 is a nice ride.  While it felt super slow compared to my road bike, it was really pretty damn fun to zoom around the park without worrying as much about the gravel or rocks. I recommend staying away from road bikes on the carriage roads.  I wanted the wider tires of a comfort bike or mountain bike on the gravel.  I also really appreciated the hill friendly gearing on the mountain bike.  I've been on the roads using a comfort bike and was fine, so just use your judgement.  Bikes aren't allowed on the hiking trails, so there's no real easy opportunities to truly go trail riding, as far as I know.  It was the first time I really wish I had a cross bike.</p>\n\n<div class=\"rightReviewBox\"><a href=\"http://www.flickr.com/photos/sujal/4861626459/\" title=\"Untitled by sujal, on Flickr\"><img src=\"http://farm5.static.flickr.com/4095/4861626459_c139e09dfc_m.jpg\" width=\"240\" height=\"160\" alt=\"\"></a></div>\n\n<p>Heidi and I also went on a whale watch.  This was my first time doing one.  I didn't really expect much from the trip, thinking we might be lucky if we saw even one whale.  Boy, was I wrong.  We saw at least 4 finback whales playing and diving.  No breaches (leaps out of the water), but we saw a fin slap and a number of terminal dives where we saw the tail before it disappeared below the surface.  We did <a href=\"http://www.barharborwhales.com/\">a sunset whale watch</a>, so we were treated to some beautiful views on the way home.  If you've never been on one, highly recommended.  Just remember to dress warmly.  We were freezing out on the water, and when the boat really gets moving, you feel like you're in a wind tunnel experiment about wind chill. We were both freezing, but didn't want to take a chance we'd miss a whale sighting. Definitely, bring fall/winter layers (sweatshirt or fleece plus windbreaker or warmer jacket, etc.).  It's a great way to spend time with nature when you don't want to be out in the park or can't hike (say, if you're with a pregnant wife, for example :) )  I'm really glad we went on this.</p>\n\n<p>Beyond all the nature and hiking and biking, Bar Harbor and the other towns on the island have great, great restaurants. A lot of places are very vegetarian friendly, and there's a variety of cuisines to suit whatever you might want.  There are great restaurants all over, including Thai, Mexican, Greek, Italian, and lots of seafood. A lot of the restaurants use locally sourced ingredients, too.  Good stuff.  Some of the places we like include <a href=\"http://www.guinnessporcellis.com/\">Guinness &amp; Porcelli's</a>, <a href=\"http://www.lompoccafe.com/\">Lompoc Cafe</a>, <a href=\"http://www.mckayspublichouse.com/\">McKay's Public House</a>, and a number of the pizza joints on Cottage and everything <a href=\"http://maps.google.com/maps?client=safari&amp;q=rodick+st+bar+harbor&amp;oe=UTF-8&amp;ie=UTF8&amp;hq=&amp;hnear=Rodick+St,+Bar+Harbor,+Hancock,+Maine+04609&amp;gl=us&amp;ei=0ohfTI6UEYT78AaEmcjCDQ&amp;ved=0CBMQ8gEwAA&amp;ll=44.388808,-68.206365&amp;spn=0.002089,0.003498&amp;z=18\">on Rodick St</a>.  There are also some great restaurants in Southwest Harbor and in some of the other towns on the island, so be sure to get out and explore!</p>\n\n<div class=\"rightReviewBox\"><a href=\"http://www.flickr.com/photos/sujal/4841476069/\" title=\"Atlantean Inn, Bar Harbor by sujal, on Flickr\"><img src=\"http://farm5.static.flickr.com/4085/4841476069_f617abc89b_m.jpg\" width=\"240\" height=\"179\" alt=\"Atlantean Inn, Bar Harbor\"></a></div>\n\n<p>Finally, getting a place to stay up there can be a bit expensive during the high season.  The best thing we've found is to rent a house for a week and try to go up with another couple or family.  We've done this a few times now and it's really the most cost effective way to go.  You can eat in, since you have a kitchen, and make lunches for your hikes/rides/whatever.  The other thing we've done is camped.  The park has a number of campgrounds nearby and many are reasonably priced and have showers and other amenities.  We've stayed at <a href=\"http://www.smugglersdencampground.com/main.html\">Smuggler's Den Campground</a>.  They had a shower and a pool and a shop on the campgrounds for things you may have forgotten.  On our most recent trip, we went a little more upscale, since it was our anniversary, and stayed at a phenomenal B&amp;B called the <a href=\"http://www.atlanteaninn.com/\">Atlantean Inn</a>.  The owners were awesome, balancing the being helpful but giving us space thing perfectly.  Our room was great, and the breakfasts were amazing.  They cook vegetarian breakfasts, but I'd be surprised if most non-vegetarians would notice or care, the food was that good.  I really loved staying there.  Too bad they don't allow kids, otherwise we'd probably plan another trip in a few years.</p>\n\n<p>Acadia National Park and Mount Desert Island are really great places to visit.  Hopefully this has given you a taste of some of things you can do there and why I really love the place.  Even with everything I've mentioned, there's so much more (the <a href=\"http://en.wikipedia.org/wiki/Somes_Sound\">only fjord on the east coast</a>!, the first place in the U.S. to see a sunrise!).</p>\n\n<p>I have a lot of <a href=\"http://www.flickr.com/photos/sujal/sets/72157624531910873/\">good photographs up on Flickr</a> from our recent trip, and would also suggest checking out <a href=\"http://www.flickr.com/photos/bumblebee-eats/sets/72157624506444377/with/4871765363/\">Faith's beautiful photo set</a> from her recent trip.  This is a gorgeous park and a rugged and beautiful part of the world. Whether you've been there before or not, I hope you get a chance to visit soon.</p>\n",
				"date_published": "2010-08-08T22:56:32-05:00",
				"url": "https://fatmixx.com/2010/08/08/acadia-national-park.html",
				"tags": ["export","acadia-national-park","maine","Me Me Me","national parks","Travel"]
			},
			{
				"id": "http://sujal.micro.blog/2009/09/19/binoculars-for-looking.html",
				"title": "Binoculars for looking at butterflies and insects? Who knew?",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<div class=\"leftReviewBox\">\n  <a href=\"http://www.amazon.com/gp/product/B0007TSYCK?ie=UTF8&amp;tag=sujaldotnet-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B0007TSYCK\"><img src=\"https://sujal.micro.blog/uploads/2024/1806e7a5e6.jpg\" alt=\"41JLJGaFRrL._SL160_\" title=\"41JLJGaFRrL._SL160_\" width=\"160\" height=\"103\" class=\"wp-image-6091\"></a>\n</div>\n\n<p>A while ago, I was looking at (and tweeted about) <a href=\"http://frysinger.net/packing/\">some dude's travel gear list</a> and noticed a nice pair of binoculars in the pack, a pair of <a href=\"http://www.amazon.com/gp/product/B0007TSYCK?ie=UTF8&amp;tag=sujaldotnet-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B0007TSYCK\">Pentax Papilio 8.5x21</a> binoculars. I saved it to my Amazon Wish List and this year Heidi bought them for me for my birthday. We've taken them on a short hike near our house and I've been messing with them here and there. I want to point out a couple of nice things about the set that might make them useful for some of you.</p>\n\n<p>The cool thing about these binoculars is that they can focus at things about 2 feet away. While this may seem sort of silly for the traditional use for binoculars, the cool thing is that you can actually focus on things like bugs, butterflies, and flowers. They almost work like a magnifying glass but from a distance. If, like me, you're curious about the little critters but are mildly afraid of getting too close, this is a great thing. I suspect kids would have a great time with these out in the woods just looking at all the little things in the woods.</p>\n\n<p>The Papilios are decent at range. They're not particularly powerful. At 8.5x you'll find some cameras with more powerful zoom. Binoculars are nice, though, because you can look at things with a larger field of view and in better viewing conditions than a little screen on the back of a camera. I could see using them for casual bird watching or checking out animals from a distance. We're not serious birders, but our primary use will be on hikes and longer rides.</p>\n\n<p>I was also pleased by how light they were. On our walk, I hardly noticed I was carrying them. If you want a pair of binoculars, this is a good pair to take a look at. I really like them so far.</p>\n",
				"date_published": "2009-09-19T15:47:40-05:00",
				"url": "https://fatmixx.com/2009/09/19/binoculars-for-looking.html",
				"tags": ["export","Product Reviews","pentax papilio"]
			},
			{
				"id": "http://sujal.micro.blog/2008/01/06/the-backtobasics-egg.html",
				"title": "The Back-to-Basics Egg Muffin Toaster",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<div class=\"rightReviewBox\">\n  <a href=\"http://www.amazon.com/gp/product/B000B18P96?ie=UTF8&amp;tag=sujaldotnet-20&amp;linkCode=as2&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B000B18P96\"><img src=\"https://sujal.micro.blog/uploads/2024/92f571945a.jpg\" alt=\"Back to Basics Egg and Muffin Toaster\"></a>\n</div>\n\n<p>I've been remiss in my blogging responsibilities and, for that, I apologize. It's already January 5th and I haven't mentioned the most unusual of my Christmas gifts this year. It's the <a href=\"http://www.amazon.com/gp/product/B000B18P96?ie=UTF8&amp;tag=sujaldotnet-20&amp;linkCode=as2&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B000B18P96\">Back to Basics Egg and Muffin 2 slice Toaster and Egg Poacher</a>. No, really!</p>\n\n<p>What is this thing? Well, if you've ever had or seen an <a href=\"http://www.mcdonalds.com/corp/news/media/multi/Prod/breakfast_menu.html\">McDonald's Egg McMuffin</a>, you know exactly what this machine makes. It's a combination toaster and egg maker that has a special cycle that poaches the egg and pops the toasted bread at exactly the same moment. Take your warm bread and your poached egg, add some cheese and/or meat of your choice and, voila!, home made breakfast sandwich. It also can hard boil eggs, so if you're an egg fan, you can just use the egg part.</p>\n\n<p>Heidi and I have been using egg substitute rather than real eggs or scrambling the egg before putting it in the machine since I'm not a fan of the runny yolk in a poached egg. Aside from that, I can add veggie sausage, different kinds of cheese, and better muffins than what McDonald's might use. Choosing my own ingredients and making a warm breakfast sandwich so easily is worth it.</p>\n\n<p>I found out about this machine from <a href=\"http://machinist.salon.com/blog/2007/12/18/egg_muffin_maker\">Fahrad Manjoo's enthusiastic review on Salon</a>. For $29.99, I was willing to give it a try. It works as well as he said, and the sandwiches are much tastier than anything I remember from McD's. If you like Egg McMuffins, this is the machine for you.</p>\n\n<p><strong>Update:</strong> Forgot to mention another egg-related device. A buddy at work who stays fit eats eggs pretty much every day. I had him in our office Secret Santa so I got him the <a href=\"http://www.amazon.com/gp/product/B00005KIRS?ie=UTF8&amp;tag=sujaldotnet-20&amp;linkCode=as2&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B00005KIRS\">Krups Egg Express Egg Cooker</a> as his gift. He loves it and says it does a great job making hard boiled eggs. So, in case you're just into eggs without the bread (say, you're an Atkins person), this is a pretty decent machine. Amazon shows it at $22.32, but I bought it from Amazon for $19.99. Not sure why the price went up.</p>\n",
				"date_published": "2008-01-05T23:09:53-05:00",
				"url": "https://fatmixx.com/2008/01/06/the-backtobasics-egg.html",
				"tags": ["export","Product Reviews","Review","back to basics","Egg McMuffin","kitchen appliances"]
			},
			{
				"id": "http://sujal.micro.blog/2007/12/31/one-year-with.html",
				"title": "One year with the best universal remote I've ever used: Logitech Harmony Universal Remote",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>That's pretty much the review right there in the headline, but as I continue to stall actually finishing my work for, uh, work (I'm suffering from the coder equivalent of writers block on one problem at the moment), here's a quick endorsement for the Logitech Harmony line of universal remotes.  While a bit expensive for most casual TV viewers, it's a great device for those of us with more than 3 things attached to the TV.  I had an XBox 360, PS2, DVR, Receiver, and cable box when I bought this remote.  I have the <a href=\"http://www.amazon.com/exec/obidos/ASIN/B000CCXCYC/ref=nosim/sujaldotnet-20\">XBox 360 version</a> which works great for the combination of devices I have.  The rest of this review assumes the features of that version, though it should apply to most of them.</p>\n\n<p>The best thing about this remote is that it comes with software for your home Mac or PC to configure the remote.  The one thing that drives me insane about most universal remotes, including some high end ones, is trying to program the remote on the remote itself.  Too often you have to point the remotes at each other and go through a manual, button-by-button programming for each remote.  Ugh.</p>\n\n<p>The Harmony does away with that (for the most part).  It leverages a web-based service that allows your remote to pull updated definitions from Logitech.  This way, they're not limited to what devices they can fit on the remote's memory.  New TV in 3 years?  Odds are that Logitech will have the device added into their DB.  Occasionally, you have to verify which version of a particular model you have and that requires pointing its remote at the Logitech remote, but that's OK because it's easier than trying to find a revision number or firmware revision from the TV or device.</p>\n\n<p>The remote also uses an \"activity\" based approach rather than a device based approach.  So, for example, I have an activity called \"Watch TV\" that turns on the TV, sets it to the right input, and turns on the DirecTV DVR.  I chose a couple of shortcuts I want featured by selecting them in a menu, and I have one touch access to common functions like the Guide or the List of programs on the DVR.</p>\n\n<p>The great thing about this approach is that I can create a lot of activities quickly and easily.  For example, I have a \"Watch DVD\" activity along with a \"Watch DVD (no receiver)\" activity. You can use either to watch DVDs, but the first turns on the surround sound and uses the receiver to control the volume while the second activity uses the TV for audio instead.</p>\n\n<p>Also, because it understands typical viewing patterns, replacing devices is pretty easy.  When I swapped TVs recently, I walked through a few menus and the software replaced the old TV with the new one in all the activities where it made sense.</p>\n\n<p>My only complaint is really a minor issue.  The remote needs to \"know\" whether your devices are on or off, so it's really important that you use the remote only to turn things on and off.  Takes some getting used to if you're in the habit of hitting the power switch on the TV.</p>\n\n<p>Trust me, it's worth the money if you have a several devices attached to your home theater.  I love it and can't imagine going to another remote.</p>\n",
				"date_published": "2007-12-31T00:11:22-05:00",
				"url": "https://fatmixx.com/2007/12/31/one-year-with.html",
				"tags": ["export","harmony remote","logitech","Product Reviews","Review","TV and Movies","universal remotes"]
			},
			{
				"id": "http://sujal.micro.blog/2007/11/02/washed-out-colors.html",
				"title": "Washed out colors on a MacBook Pro (or any Mac OS X Computer)",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>Another bit of Google fodder, in case others run into this problem.  BTW, this applies to a computer running Mac OS X 10.4 (Tiger), but I'm assuming similar controls exist in Leopard.  I'll know in a day or two. :)</p>\n\n<p>So, on my work MacBook Pro, I noticed that the colors were extremely washed out.  The gradients in the title bar of my applications almost looked like two color stripes.  NetNewsWire lost the nice pinstripes, and on my development application, some of the tints on my background colors were off or not visible.  For example, #FAFAFF, which should be a very, very light blue was showing up as white on my screen.</p>\n\n<p>It sure seemed like the contrast was off, but the Displays Preference Pane only allows you to either change the brightness or try to calibrate the display using a fairly complex and meaningless tool (for those of us not doing professional color work, at least).</p>\n\n<p>Well, after using the handy search feature in System Preferences and searching for contrast, I found that the Universal Access preference pane contains an override for the contrast for your system apparently to allow people with different vision problems to use the display.  Somehow, and I'm not really sure how, this Enhance Contrast setting was set away from \"Normal\" or the far left.  Bringing that setting to Normal has gotten my colors and gradients back.  Trust me, it was weird living in an unsubtle world.</p>\n",
				"date_published": "2007-11-02T13:39:09-05:00",
				"url": "https://fatmixx.com/2007/11/02/washed-out-colors.html",
				"tags": ["colors","displays","export","mac-os-x","Random"]
			}
	]
}
